1) /var/www/app/Http/Controllers/Api/v1/AuthController.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Support\Facades\Hash;
 class AuthController extends Controller
 {
-    public function login(Request $request)
+    protected function login(Request $request)
     {
         $validator = Validator::make($request->all(), ['email' => ['required', 'string'], 'password' => ['required', 'string']]);
         if ($validator->fails()) {

2) /var/www/app/Http/Controllers/Api/v1/AuthController.php:15    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function login(Request $request)
     {
-        $validator = Validator::make($request->all(), ['email' => ['required', 'string'], 'password' => ['required', 'string']]);
+        $validator = Validator::make($request->all(), ['password' => ['required', 'string']]);
         if ($validator->fails()) {
             return response()->json(['status' => false, 'error' => $validator->messages()], 200);
         }

3) /var/www/app/Http/Controllers/Api/v1/AuthController.php:16    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function login(Request $request)
     {
-        $validator = Validator::make($request->all(), ['email' => ['required', 'string'], 'password' => ['required', 'string']]);
+        $validator = Validator::make($request->all(), ['email' => ['string'], 'password' => ['required', 'string']]);
         if ($validator->fails()) {
             return response()->json(['status' => false, 'error' => $validator->messages()], 200);
         }

4) /var/www/app/Http/Controllers/Api/v1/AuthController.php:17    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
 {
     public function login(Request $request)
     {
-        $validator = Validator::make($request->all(), ['email' => ['required', 'string'], 'password' => ['required', 'string']]);
+        $validator = Validator::make($request->all(), ['email' => ['required', 'string'], 'password' => ['string']]);
         if ($validator->fails()) {
             return response()->json(['status' => false, 'error' => $validator->messages()], 200);
         }

5) /var/www/app/Http/Controllers/Api/v1/AuthController.php:48    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return response()->json(['token' => $token]);
     }
-    public function logout(Request $request)
+    protected function logout(Request $request)
     {
         auth('api')->logout();
         return response()->json(['success' => true]);

6) /var/www/app/Http/Controllers/Api/v1/AuthController.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function logout(Request $request)
     {
-        auth('api')->logout();
+        
         return response()->json(['success' => true]);
     }
     public function me(Request $request)

7) /var/www/app/Http/Controllers/Api/v1/AuthController.php:56    [M] PublicVisibility

--- Original
+++ New
@@ @@
         auth('api')->logout();
         return response()->json(['success' => true]);
     }
-    public function me(Request $request)
+    protected function me(Request $request)
     {
         return response()->json(['user' => auth("api")->user()]);
     }

8) /var/www/app/Http/Controllers/Api/v1/AuthController.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function me(Request $request)
     {
-        return response()->json(['user' => auth("api")->user()]);
+        return response()->json([]);
     }
     public function refresh(Request $request)
     {

9) /var/www/app/Http/Controllers/Api/v1/AuthController.php:59    [M] ArrayItem

--- Original
+++ New
@@ @@
     }
     public function me(Request $request)
     {
-        return response()->json(['user' => auth("api")->user()]);
+        return response()->json(['user' > auth("api")->user()]);
     }
     public function refresh(Request $request)
     {

10) /var/www/app/Http/Controllers/Api/v1/AuthController.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return response()->json(['user' => auth("api")->user()]);
     }
-    public function refresh(Request $request)
+    protected function refresh(Request $request)
     {
         return response()->json(['token' => auth('api')->refresh()]);
     }
 }

3) /var/www/app/Http/Controllers/Api/v1/AuthController.php:24    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $validator = Validator::make($request->all(), ['email' => ['required', 'string'], 'password' => ['required', 'string']]);
         if ($validator->fails()) {
-            return response()->json(['status' => false, 'error' => $validator->messages()], 200);
+            return response()->json(['status' => false, 'error' => $validator->messages()], 199);
         }
         $attemptedUser = User::where('email', '=', $request['email'])->first();
         if (!$attemptedUser || !Hash::check($request['password'], $attemptedUser->password)) {

4) /var/www/app/Http/Controllers/Api/v1/AuthController.php:24    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $validator = Validator::make($request->all(), ['email' => ['required', 'string'], 'password' => ['required', 'string']]);
         if ($validator->fails()) {
-            return response()->json(['status' => false, 'error' => $validator->messages()], 200);
+            return response()->json(['status' => false, 'error' => $validator->messages()], 201);
         }
         $attemptedUser = User::where('email', '=', $request['email'])->first();
         if (!$attemptedUser || !Hash::check($request['password'], $attemptedUser->password)) {

5) /var/www/app/Http/Controllers/Api/v1/AuthController.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
         if (!($token = auth('api')->login($attemptedUser))) {
-            return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 401);
+            return response()->json(['error' => 'Could not login. Please try later'], 401);
         }
         return response()->json(['token' => $token]);
     }

6) /var/www/app/Http/Controllers/Api/v1/AuthController.php:38    [M] FalseValue

--- Original
+++ New
@@ @@
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
         if (!($token = auth('api')->login($attemptedUser))) {
-            return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 401);
+            return response()->json(['status' => true, 'error' => 'Could not login. Please try later'], 401);
         }
         return response()->json(['token' => $token]);
     }

7) /var/www/app/Http/Controllers/Api/v1/AuthController.php:40    [M] DecrementInteger

--- Original
+++ New
@@ @@
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
         if (!($token = auth('api')->login($attemptedUser))) {
-            return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 401);
+            return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 400);
         }
         return response()->json(['token' => $token]);
     }

8) /var/www/app/Http/Controllers/Api/v1/AuthController.php:40    [M] IncrementInteger

--- Original
+++ New
@@ @@
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
         if (!($token = auth('api')->login($attemptedUser))) {
-            return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 401);
+            return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 402);
         }
         return response()->json(['token' => $token]);
     }

717) /var/www/app/Http/Controllers/LoginAdminController.php:18    [M] FunctionCall

--- Original
+++ New
@@ @@
         if (Auth::check()) {
             return redirect()->route('admin.home');
         }
-        return view('admin.login');
+        view('admin.login');
+        return null;
     }
     public function login_p(Request $request)
     {

718) /var/www/app/Http/Controllers/LoginAdminController.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return view('admin.login');
     }
-    public function login_p(Request $request)
+    protected function login_p(Request $request)
     {
         $credentials = $request->only('email', 'password');
         if (Auth::attempt($credentials)) {

720) /var/www/app/Http/Controllers/LoginAdminController.php:36    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function logout(Request $request)
     {
-        Auth::logout();
+        
         return redirect()->route('instances.home');
     }
 }

722) /var/www/app/Http/Controllers/LoginInstanceController.php:18    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function login()
     {
         if (Auth::check()) {
-            return redirect()->route('home', ['instance' => \Instantiation::instance()]);
+            return redirect()->route('home', []);
         }
         \Instantiation::set_default_connection();
         $instances = Instance::all();

724) /var/www/app/Http/Controllers/LoginInstanceController.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instances = Instance::all();
-        \Instantiation::set_default_instance();
+        
         if (count($instances) == 0) {
             return redirect()->route('admin.login');
         }

725) /var/www/app/Http/Controllers/LoginInstanceController.php:25    [M] Equal

--- Original
+++ New
@@ @@
         \Instantiation::set_default_connection();
         $instances = Instance::all();
         \Instantiation::set_default_instance();
-        if (count($instances) == 0) {
+        if (count($instances) != 0) {
             return redirect()->route('admin.login');
         }
         return view('auth.login', ['instances' => $instances]);

726) /var/www/app/Http/Controllers/LoginInstanceController.php:29    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if (count($instances) == 0) {
             return redirect()->route('admin.login');
         }
-        return view('auth.login', ['instances' => $instances]);
+        return view('auth.login', []);
     }
     public function login_p(Request $request)
     {

727) /var/www/app/Http/Controllers/LoginInstanceController.php:29    [M] FunctionCall

--- Original
+++ New
@@ @@
         if (count($instances) == 0) {
             return redirect()->route('admin.login');
         }
-        return view('auth.login', ['instances' => $instances]);
+        view('auth.login', ['instances' => $instances]);
+        return null;
     }
     public function login_p(Request $request)
     {

729) /var/www/app/Http/Controllers/LoginInstanceController.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $credentials = $request->only('username', 'password');
         if (Auth::attempt($credentials)) {
-            return redirect()->route('home', ['instance' => \Instantiation::instance()]);
+            return redirect()->route('home', []);
         }
         return back()->withInput()->with('error', 'Las credenciales no son válidas.');
     }

732) /var/www/app/Http/Controllers/LoginInstanceController.php:49    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function logout(Request $request)
     {
         Auth::logout();
-        return redirect()->route('home', ['instance' => \Instantiation::instance()]);
+        return redirect()->route('home', []);
     }
 }

1300) /var/www/app/Http/Controllers/PasswordResetController.php:22    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('guest');
     }
-    public function reset($instance)
+    protected function reset($instance)
     {
         return view('auth.passwords.reset', ['instance' => $instance]);
     }

1301) /var/www/app/Http/Controllers/PasswordResetController.php:25    [M] FunctionCall

--- Original
+++ New
@@ @@
     }
     public function reset($instance)
     {
-        return view('auth.passwords.reset', ['instance' => $instance]);
+        view('auth.passwords.reset', ['instance' => $instance]);
+        return null;
     }
     public function reset_p(Request $request)
     {

1302) /var/www/app/Http/Controllers/PasswordResetController.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function reset($instance)
     {
-        return view('auth.passwords.reset', ['instance' => $instance]);
+        return view('auth.passwords.reset', []);
     }
     public function reset_p(Request $request)
     {

1303) /var/www/app/Http/Controllers/PasswordResetController.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return view('auth.passwords.reset', ['instance' => $instance]);
     }
-    public function reset_p(Request $request)
+    protected function reset_p(Request $request)
     {
         $request->validate(['email' => 'required']);
         $user = User::where('email', $request->email)->first();

1304) /var/www/app/Http/Controllers/PasswordResetController.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function reset_p(Request $request)
     {
-        $request->validate(['email' => 'required']);
+        $request->validate([]);
         $user = User::where('email', $request->email)->first();
         if ($user != null) {
             // medida de seguridad: si se genera un nuevo token, todos los anteriores se invalidan

1305) /var/www/app/Http/Controllers/PasswordResetController.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function reset_p(Request $request)
     {
-        $request->validate(['email' => 'required']);
+        
         $user = User::where('email', $request->email)->first();
         if ($user != null) {
             // medida de seguridad: si se genera un nuevo token, todos los anteriores se invalidan

1306) /var/www/app/Http/Controllers/PasswordResetController.php:39    [M] NotEqual

--- Original
+++ New
@@ @@
     {
         $request->validate(['email' => 'required']);
         $user = User::where('email', $request->email)->first();
-        if ($user != null) {
+        if ($user == null) {
             // medida de seguridad: si se genera un nuevo token, todos los anteriores se invalidan
             $tokens = Token::where("user_id", $user->id)->get();
             foreach ($tokens as $t) {

1307) /var/www/app/Http/Controllers/PasswordResetController.php:43    [M] Foreach_

--- Original
+++ New
@@ @@
         if ($user != null) {
             // medida de seguridad: si se genera un nuevo token, todos los anteriores se invalidan
             $tokens = Token::where("user_id", $user->id)->get();
-            foreach ($tokens as $t) {
+            foreach (array() as $t) {
                 $t->used = true;
                 $t->save();
             }

1308) /var/www/app/Http/Controllers/PasswordResetController.php:44    [M] TrueValue

--- Original
+++ New
@@ @@
             // medida de seguridad: si se genera un nuevo token, todos los anteriores se invalidan
             $tokens = Token::where("user_id", $user->id)->get();
             foreach ($tokens as $t) {
-                $t->used = true;
+                $t->used = false;
                 $t->save();
             }
             $token_str = Str::random(255);

1309) /var/www/app/Http/Controllers/PasswordResetController.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $tokens = Token::where("user_id", $user->id)->get();
             foreach ($tokens as $t) {
                 $t->used = true;
-                $t->save();
+                
             }
             $token_str = Str::random(255);
             $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);

1310) /var/www/app/Http/Controllers/PasswordResetController.php:48    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $t->used = true;
                 $t->save();
             }
-            $token_str = Str::random(255);
+            $token_str = Str::random(254);
             $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {

1311) /var/www/app/Http/Controllers/PasswordResetController.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $t->used = true;
                 $t->save();
             }
-            $token_str = Str::random(255);
+            $token_str = Str::random(256);
             $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {

1312) /var/www/app/Http/Controllers/PasswordResetController.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $t->save();
             }
             $token_str = Str::random(255);
-            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
+            $token = Token::create(["used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));

1313) /var/www/app/Http/Controllers/PasswordResetController.php:52    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $t->save();
             }
             $token_str = Str::random(255);
-            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
+            $token = Token::create(["token" => $token_str, "used" => -1, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));

1314) /var/www/app/Http/Controllers/PasswordResetController.php:52    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $t->save();
             }
             $token_str = Str::random(255);
-            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
+            $token = Token::create(["token" => $token_str, "used" => 1, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));

1315) /var/www/app/Http/Controllers/PasswordResetController.php:53    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 $t->save();
             }
             $token_str = Str::random(255);
-            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
+            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(23)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));

1316) /var/www/app/Http/Controllers/PasswordResetController.php:53    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $t->save();
             }
             $token_str = Str::random(255);
-            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
+            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(25)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));

1317) /var/www/app/Http/Controllers/PasswordResetController.php:53    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $t->save();
             }
             $token_str = Str::random(255);
-            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
+            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" > \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));

1318) /var/www/app/Http/Controllers/PasswordResetController.php:54    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $t->save();
             }
             $token_str = Str::random(255);
-            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
+            $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" > $user->id]);
             $token->save();
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));

1319) /var/www/app/Http/Controllers/PasswordResetController.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $token_str = Str::random(255);
             $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
-            $token->save();
+            
             try {
                 Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));
             } catch (\Exception $e) {

1320) /var/www/app/Http/Controllers/PasswordResetController.php:60    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $token = Token::create(["token" => $token_str, "used" => 0, "valid_until_timestamp" => \Carbon\Carbon::now()->addHours(24)->toDateTime(), "user_id" => $user->id]);
             $token->save();
             try {
-                Mail::to($user)->send(new PasswordReset(\Instantiation::instance(), $token, $user));
+                
             } catch (\Exception $e) {
             }
         }

1321) /var/www/app/Http/Controllers/PasswordResetController.php:69    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('instance.login', \Instantiation::instance())->with('light', 'Si el email se encuentra en nuestros registros, recibirás un correo con instrucciones para restablecer tu contraseña.');
     }
-    public function update($instance, $token)
+    protected function update($instance, $token)
     {
         $token_entity = Token::where("token", $token)->first();
         if ($token_entity != null) {

1322) /var/www/app/Http/Controllers/PasswordResetController.php:74    [M] NotEqual

--- Original
+++ New
@@ @@
     public function update($instance, $token)
     {
         $token_entity = Token::where("token", $token)->first();
-        if ($token_entity != null) {
+        if ($token_entity == null) {
             if ($token_entity->is_valid()) {
                 return view('auth.passwords.update', ['instance' => $instance, 'token' => $token]);
             }

1323) /var/www/app/Http/Controllers/PasswordResetController.php:77    [M] FunctionCall

--- Original
+++ New
@@ @@
         $token_entity = Token::where("token", $token)->first();
         if ($token_entity != null) {
             if ($token_entity->is_valid()) {
-                return view('auth.passwords.update', ['instance' => $instance, 'token' => $token]);
+                view('auth.passwords.update', ['instance' => $instance, 'token' => $token]);
+                return null;
             }
             return redirect()->route('instance.login', $instance)->with('error', 'El token no es válido o ha caducado.');
         }

1324) /var/www/app/Http/Controllers/PasswordResetController.php:78    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $token_entity = Token::where("token", $token)->first();
         if ($token_entity != null) {
             if ($token_entity->is_valid()) {
-                return view('auth.passwords.update', ['instance' => $instance, 'token' => $token]);
+                return view('auth.passwords.update', ['token' => $token]);
             }
             return redirect()->route('instance.login', $instance)->with('error', 'El token no es válido o ha caducado.');
         }

1325) /var/www/app/Http/Controllers/PasswordResetController.php:89    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('instance.login', $instance);
     }
-    public function update_p(Request $request)
+    protected function update_p(Request $request)
     {
         $request->validate(['password' => 'required|confirmed|min:6']);
         $token_entity = Token::where("token", $request->route('token'))->first();

1326) /var/www/app/Http/Controllers/PasswordResetController.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function update_p(Request $request)
     {
-        $request->validate(['password' => 'required|confirmed|min:6']);
+        $request->validate([]);
         $token_entity = Token::where("token", $request->route('token'))->first();
         if ($token_entity != null) {
             // cambio de contraseña

1327) /var/www/app/Http/Controllers/PasswordResetController.php:91    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function update_p(Request $request)
     {
-        $request->validate(['password' => 'required|confirmed|min:6']);
+        
         $token_entity = Token::where("token", $request->route('token'))->first();
         if ($token_entity != null) {
             // cambio de contraseña

1328) /var/www/app/Http/Controllers/PasswordResetController.php:97    [M] NotEqual

--- Original
+++ New
@@ @@
     {
         $request->validate(['password' => 'required|confirmed|min:6']);
         $token_entity = Token::where("token", $request->route('token'))->first();
-        if ($token_entity != null) {
+        if ($token_entity == null) {
             // cambio de contraseña
             $user = User::find($token_entity->user_id);
             $user->password = Hash::make($request->input('password'));

1330) /var/www/app/Http/Controllers/PasswordResetController.php:105    [M] TrueValue

--- Original
+++ New
@@ @@
             $user->password = Hash::make($request->input('password'));
             $user->save();
             // el token deja de ser válido
-            $token_entity->used = true;
+            $token_entity->used = false;
             $token_entity->save();
             return redirect()->route('instance.login', \Instantiation::instance())->with('success', 'Contraseña cambiada con éxito. Ahora puedes iniciar sesión.');
         } else {

1331) /var/www/app/Http/Controllers/PasswordResetController.php:106    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->save();
             // el token deja de ser válido
             $token_entity->used = true;
-            $token_entity->save();
+            
             return redirect()->route('instance.login', \Instantiation::instance())->with('success', 'Contraseña cambiada con éxito. Ahora puedes iniciar sesión.');
         } else {
             return redirect()->route('instance.login', \Instantiation::instance())->with('error', 'El token no es válido o ha caducado.');
