11) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Support\Facades\Validator;
 class CommiteeController extends Controller
 {
-    public function getAll()
+    protected function getAll()
     {
         return response()->json(Comittee::paginate());
     }

12) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return response()->json(Comittee::paginate());
     }
-    public function create(Request $request)
+    protected function create(Request $request)
     {
         $validator = Validator::make($request->all(), ['name' => ['required', 'string'], 'icon' => ['required', 'string']]);
         if ($validator->fails()) {

13) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:19    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function create(Request $request)
     {
-        $validator = Validator::make($request->all(), ['name' => ['required', 'string'], 'icon' => ['required', 'string']]);
+        $validator = Validator::make($request->all(), ['name' => ['required', 'string'], 'icon' => ['string']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

14) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:36    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $committee = Comittee::create(['name' => $request['name'], 'icon' => $request['icon']]);
         return response()->json($committee);
     }
-    public function getById(Request $request)
+    protected function getById(Request $request)
     {
         return response()->json(Comittee::find($request['id']));
     }

15) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return response()->json(Comittee::find($request['id']));
     }
-    public function updateById(Request $request)
+    protected function updateById(Request $request)
     {
         $validator = Validator::make($request->all(), ['name' => ['required', 'string'], 'icon' => ['required', 'string']]);
         if ($validator->fails()) {

17) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $committee->update(['name' => $request['name'], 'icon' => $request['icon']]);
         return response()->json($committee);
     }
-    public function deleteById(Request $request)
+    protected function deleteById(Request $request)
     {
         $committee = Comittee::find($request['id']);
         if (!$committee) {

41) /var/www/app/Http/Controllers/Api/v1/EvidenceController.php:104    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (!$evidence) {
             return response()->json(['error' => ['id' => 'Invalid id']]);
         }
-        $evidence->delete();
+        
         return response()->json($evidence);
     }
 }

44) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:19    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function create(Request $request)
     {
-        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
+        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

45) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:20    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function create(Request $request)
     {
-        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
+        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

46) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function create(Request $request)
     {
-        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
+        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

47) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function create(Request $request)
     {
-        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
+        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['numeric'], 'hours' => ['required', 'numeric']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

48) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function create(Request $request)
     {
-        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
+        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['numeric']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

51) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:49    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function updateById(Request $request)
     {
-        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
+        $validator = Validator::make($request->all(), ['datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

52) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:50    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function updateById(Request $request)
     {
-        $validator = Validator::make($request->all(), ['title' => ['required', 'string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
+        $validator = Validator::make($request->all(), ['title' => ['string'], 'datetime' => ['required', 'string'], 'place' => ['required', 'string'], 'type' => ['required', 'numeric'], 'modality' => ['required', 'numeric'], 'hours' => ['required', 'numeric']]);
         if ($validator->fails()) {
             return response()->json(['error' => $validator->messages()]);
         }

58) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:91    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (!$meeting) {
             return response()->json(['error' => ['id' => 'Invalid id']]);
         }
-        $meeting->delete();
+        
         return response()->json($meeting);
     }
 }

76) /var/www/app/Http/Controllers/MetaHomeController.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Support\Facades\Auth;
 class MetaHomeController extends Controller
 {
-    public function home()
+    protected function home()
     {
         // obtenemos la última instancia creada
         $instance = Instance::orderBy('created_at', 'desc')->first();

77) /var/www/app/Http/Controllers/MetaHomeController.php:21    [M] Equal

--- Original
+++ New
@@ @@
         $instance = Instance::orderBy('created_at', 'desc')->first();
         // si la instancia es null, es que no hay ninguna creada, así que redirigimos al panel
         // del admin
-        if ($instance == null) {
+        if ($instance != null) {
             return redirect()->route('admin.login');
         }
         // si estoy logueado

78) /var/www/app/Http/Controllers/MetaHomeController.php:31    [M] ArrayItem

--- Original
+++ New
@@ @@
         if (Auth::check()) {
             return redirect()->route('instance.login', ['instance' => $instance->route]);
         }
-        return redirect()->route('instance.login', ['instance' => $instance->route]);
+        return redirect()->route('instance.login', ['instance' > $instance->route]);
     }
 }


Timed Out mutants:
==================

2) /var/www/app/Http/Controllers/AdminController.php:13    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function home()
     {
         if (Auth::check()) {
-            return view('admin.home');
+            view('admin.home');
+            return null;
         }
         return redirect()->route('admin.login');
     }
 }

9) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:54    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $committee = Comittee::find($request['id']);
         if (!$committee) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json([]);
         }
         $committee->update(['name' => $request['name'], 'icon' => $request['icon']]);
         return response()->json($committee);

10) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $committee = Comittee::find($request['id']);
         if (!$committee) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json(['error' => []]);
         }
         $committee->update(['name' => $request['name'], 'icon' => $request['icon']]);
         return response()->json($committee);

11) /var/www/app/Http/Controllers/Api/v1/CommiteeController.php:75    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (!$committee) {
             return response()->json(['error' => ['id' => 'Invalid id']]);
         }
-        $committee->delete();
+        
         return response()->json($committee);
     }
 }

12) /var/www/app/Http/Controllers/Api/v1/EvidenceController.php:76    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $evidence = Evidence::find($request['id']);
         if (!$evidence) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json([]);
         }
         return response()->json($evidence);

13) /var/www/app/Http/Controllers/Api/v1/EvidenceController.php:77    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $evidence = Evidence::find($request['id']);
         if (!$evidence) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json(['error' => []]);
         }
         return response()->json($evidence);

14) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:66    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $meeting = Meeting::find($request['id']);
         if (!$meeting) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json([]);
         }
         $meeting->update(['title' => $request['title'], 'datetime' => $request['datetime'], 'place' => $request['place'], 'type' => $request['type'], 'modality' => $request['modality'], 'hours' => $request['hours']]);
         return response()->json($meeting);

15) /var/www/app/Http/Controllers/Api/v1/MeetingController.php:67    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $meeting = Meeting::find($request['id']);
         if (!$meeting) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json(['error' => []]);
         }
         $meeting->update(['title' => $request['title'], 'datetime' => $request['datetime'], 'place' => $request['place'], 'type' => $request['type'], 'modality' => $request['modality'], 'hours' => $request['hours']]);
         return response()->json($meeting);

16) /var/www/app/Http/Controllers/Api/v1/UserController.php:75    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $user = User::find($request['id']);
         if (!$user) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json([]);
         }
         return response()->json($user);

17) /var/www/app/Http/Controllers/Api/v1/UserController.php:76    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         $user = User::find($request['id']);
         if (!$user) {
-            return response()->json(['error' => ['id' => 'Invalid id']]);
+            return response()->json(['error' => []]);
         }
         return response()->json($user);

19) /var/www/app/Http/Controllers/AttendeeController.php:15    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('checkroles:STUDENT');
+        
     }
     public function list()
     {

20) /var/www/app/Http/Controllers/AttendeeController.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->middleware('auth');
         $this->middleware('checkroles:STUDENT');
     }
-    public function list()
+    protected function list()
     {
         $instance = \Instantiation::instance();
         $attendees = Auth::user()->attendees;

21) /var/www/app/Http/Controllers/AttendeeController.php:26    [M] FunctionCall

--- Original
+++ New
@@ @@
         $attendees = Auth::user()->attendees;
         $events_update = \Config::events_uploaded_timestamp();
         $attendees_update = \Config::attendees_uploaded_timestamp();
-        return view('attendee.list', ['instance' => $instance, 'attendees' => $attendees, 'events_update' => $events_update, 'attendees_update' => $attendees_update]);
+        view('attendee.list', ['instance' => $instance, 'attendees' => $attendees, 'events_update' => $events_update, 'attendees_update' => $attendees_update]);
+        return null;
     }
     public function export($instance, $ext)
     {

22) /var/www/app/Http/Controllers/AttendeeController.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $attendees = Auth::user()->attendees;
         $events_update = \Config::events_uploaded_timestamp();
         $attendees_update = \Config::attendees_uploaded_timestamp();
-        return view('attendee.list', ['instance' => $instance, 'attendees' => $attendees, 'events_update' => $events_update, 'attendees_update' => $attendees_update]);
+        return view('attendee.list', ['attendees' => $attendees, 'events_update' => $events_update, 'attendees_update' => $attendees_update]);
     }
     public function export($instance, $ext)
     {

23) /var/www/app/Http/Controllers/AttendeeController.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $attendees_update = \Config::attendees_uploaded_timestamp();
         return view('attendee.list', ['instance' => $instance, 'attendees' => $attendees, 'events_update' => $events_update, 'attendees_update' => $attendees_update]);
     }
-    public function export($instance, $ext)
+    protected function export($instance, $ext)
     {
         try {
             ob_end_clean();

24) /var/www/app/Http/Controllers/AttendeeController.php:34    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     public function export($instance, $ext)
     {
         try {
-            ob_end_clean();
+            
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }

25) /var/www/app/Http/Controllers/AttendeeController.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         try {
             ob_end_clean();
-            if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
+            if (!in_array($ext, ['pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
             return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);

26) /var/www/app/Http/Controllers/AttendeeController.php:35    [M] LogicalNot

--- Original
+++ New
@@ @@
     {
         try {
             ob_end_clean();
-            if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
+            if (in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
             return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);

27) /var/www/app/Http/Controllers/AttendeeController.php:38    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyAttendeesExport(), \Illuminate\Support\Carbon::now() . 'misasistencias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

28) /var/www/app/Http/Controllers/AttendeeController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyAttendeesExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

29) /var/www/app/Http/Controllers/AttendeeController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

30) /var/www/app/Http/Controllers/AttendeeController.php:38    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

31) /var/www/app/Http/Controllers/AttendeeController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

32) /var/www/app/Http/Controllers/AttendeeController.php:38    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

33) /var/www/app/Http/Controllers/AttendeeController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

34) /var/www/app/Http/Controllers/AttendeeController.php:40    [M] Concat

--- Original
+++ New
@@ @@
             }
             return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
-            return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return back()->with('error', $e->getMessage() . 'Ocurrió un error: ');
         }
     }
 }

35) /var/www/app/Http/Controllers/AttendeeController.php:40    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
-            return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return back()->with('error', $e->getMessage());
         }
     }
 }

36) /var/www/app/Http/Controllers/AttendeeController.php:40    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
             return Excel::download(new MyAttendeesExport(), 'misasistencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
-            return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return back()->with('error', 'Ocurrió un error: ');
         }
     }
 }

51) /var/www/app/Http/Controllers/AvatarController.php:20    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
     }
-    public function avatar($instance, $id)
+    protected function avatar($instance, $id)
     {
         $user = User::find($id);
         $path = null;

52) /var/www/app/Http/Controllers/AvatarController.php:26    [M] NotEqual

--- Original
+++ New
@@ @@
         $user = User::find($id);
         $path = null;
         // ¿el usuario tiene avatar?
-        if ($user->avatar != null) {
+        if ($user->avatar == null) {
             $path = storage_path('app/' . $user->avatar->file->route);
         } else {
             $path = storage_path('app/public/default.png');

53) /var/www/app/Http/Controllers/AvatarController.php:27    [M] Concat

--- Original
+++ New
@@ @@
         $path = null;
         // ¿el usuario tiene avatar?
         if ($user->avatar != null) {
-            $path = storage_path('app/' . $user->avatar->file->route);
+            $path = storage_path($user->avatar->file->route . 'app/');
         } else {
             $path = storage_path('app/public/default.png');
         }

54) /var/www/app/Http/Controllers/AvatarController.php:27    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $path = null;
         // ¿el usuario tiene avatar?
         if ($user->avatar != null) {
-            $path = storage_path('app/' . $user->avatar->file->route);
+            $path = storage_path($user->avatar->file->route);
         } else {
             $path = storage_path('app/public/default.png');
         }

55) /var/www/app/Http/Controllers/AvatarController.php:27    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $path = null;
         // ¿el usuario tiene avatar?
         if ($user->avatar != null) {
-            $path = storage_path('app/' . $user->avatar->file->route);
+            $path = storage_path('app/');
         } else {
             $path = storage_path('app/public/default.png');
         }

56) /var/www/app/Http/Controllers/AvatarController.php:32    [M] LogicalNot

--- Original
+++ New
@@ @@
         } else {
             $path = storage_path('app/public/default.png');
         }
-        if (!File::exists($path)) {
+        if (File::exists($path)) {
             abort(404);
         }
         $file = File::get($path);

57) /var/www/app/Http/Controllers/AvatarController.php:33    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $path = storage_path('app/public/default.png');
         }
         if (!File::exists($path)) {
-            abort(404);
+            abort(403);
         }
         $file = File::get($path);
         $type = File::mimeType($path);

58) /var/www/app/Http/Controllers/AvatarController.php:33    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $path = storage_path('app/public/default.png');
         }
         if (!File::exists($path)) {
-            abort(404);
+            abort(405);
         }
         $file = File::get($path);
         $type = File::mimeType($path);

59) /var/www/app/Http/Controllers/AvatarController.php:33    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             $path = storage_path('app/public/default.png');
         }
         if (!File::exists($path)) {
-            abort(404);
+            
         }
         $file = File::get($path);
         $type = File::mimeType($path);

60) /var/www/app/Http/Controllers/AvatarController.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $file = File::get($path);
         $type = File::mimeType($path);
-        $response = Response::make($file, 200);
+        $response = Response::make($file, 199);
         $response->header("Content-Type", $type);
         // recorte de imagen
         list($width, $height, $type, $attr) = getimagesize($path);

61) /var/www/app/Http/Controllers/AvatarController.php:39    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $file = File::get($path);
         $type = File::mimeType($path);
-        $response = Response::make($file, 200);
+        $response = Response::make($file, 201);
         $response->header("Content-Type", $type);
         // recorte de imagen
         list($width, $height, $type, $attr) = getimagesize($path);

62) /var/www/app/Http/Controllers/AvatarController.php:40    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $file = File::get($path);
         $type = File::mimeType($path);
         $response = Response::make($file, 200);
-        $response->header("Content-Type", $type);
+        
         // recorte de imagen
         list($width, $height, $type, $attr) = getimagesize($path);
         $img = null;
