63) /var/www/app/Http/Controllers/AvatarController.php:48    [M] GreaterThan

--- Original
+++ New
@@ @@
         list($width, $height, $type, $attr) = getimagesize($path);
         $img = null;
         // ¿La imagen es más alta que ancha?
-        if ($height > $width) {
+        if ($height >= $width) {
             $new_width = $width;
             $new_height = $width;
             $img = Image::make($file)->crop($new_width, $new_height);

64) /var/www/app/Http/Controllers/AvatarController.php:48    [M] GreaterThanNegotiation

--- Original
+++ New
@@ @@
         list($width, $height, $type, $attr) = getimagesize($path);
         $img = null;
         // ¿La imagen es más alta que ancha?
-        if ($height > $width) {
+        if ($height <= $width) {
             $new_width = $width;
             $new_height = $width;
             $img = Image::make($file)->crop($new_width, $new_height);

65) /var/www/app/Http/Controllers/AvatarController.php:55    [M] LessThan

--- Original
+++ New
@@ @@
             $img = Image::make($file)->crop($new_width, $new_height);
         }
         // ¿La imagen es más ancha que alta?
-        if ($height < $width) {
+        if ($height <= $width) {
             $new_width = $height;
             $new_height = $height;
             $img = Image::make($file)->crop($new_width, $new_height);

66) /var/www/app/Http/Controllers/AvatarController.php:55    [M] LessThanNegotiation

--- Original
+++ New
@@ @@
             $img = Image::make($file)->crop($new_width, $new_height);
         }
         // ¿La imagen es más ancha que alta?
-        if ($height < $width) {
+        if ($height >= $width) {
             $new_width = $height;
             $new_height = $height;
             $img = Image::make($file)->crop($new_width, $new_height);

67) /var/www/app/Http/Controllers/AvatarController.php:62    [M] AssignmentEqual

--- Original
+++ New
@@ @@
             $img = Image::make($file)->crop($new_width, $new_height);
         }
         // ¿La imagen es cuadrada?
-        if ($height == $width) {
+        if ($height = $width) {
             $img = Image::make($file)->crop($width, $height);
         }
         // limpiar búfer de salida

68) /var/www/app/Http/Controllers/AvatarController.php:62    [M] Equal

--- Original
+++ New
@@ @@
             $img = Image::make($file)->crop($new_width, $new_height);
         }
         // ¿La imagen es cuadrada?
-        if ($height == $width) {
+        if ($height != $width) {
             $img = Image::make($file)->crop($width, $height);
         }
         // limpiar búfer de salida

69) /var/www/app/Http/Controllers/AvatarController.php:68    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         if ($height == $width) {
             $img = Image::make($file)->crop($width, $height);
         }
-        // limpiar búfer de salida
-        ob_end_clean();
+        
         return $img->response('jpg');
         return $response;
     }
 }

71) /var/www/app/Http/Controllers/BlockController.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
     }
-    public function block()
+    protected function block()
     {
         if (Auth::user()->block) {
             return view('block');

72) /var/www/app/Http/Controllers/BlockController.php:18    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function block()
     {
         if (Auth::user()->block) {
-            return view('block');
+            view('block');
+            return null;
         } else {
             return redirect()->route('home', \Instantiation::instance());
         }
     }
 }

74) /var/www/app/Http/Controllers/BonusSecretaryController.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('checkroles:SECRETARY');
+        
     }
     public function list()
     {

76) /var/www/app/Http/Controllers/BonusSecretaryController.php:25    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $bonus = Auth::user()->secretary->comittee->bonus()->get();
-        return view('bonus.list', ['instance' => $instance, 'bonus' => $bonus]);
+        view('bonus.list', ['instance' => $instance, 'bonus' => $bonus]);
+        return null;
     }
     public function create()
     {

77) /var/www/app/Http/Controllers/BonusSecretaryController.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $bonus = Auth::user()->secretary->comittee->bonus()->get();
-        return view('bonus.list', ['instance' => $instance, 'bonus' => $bonus]);
+        return view('bonus.list', ['bonus' => $bonus]);
     }
     public function create()
     {

79) /var/www/app/Http/Controllers/BonusSecretaryController.php:36    [M] FunctionCall

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $users = User::orderBy('surname')->get();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('bonus.createandedit', ['instance' => $instance, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.new', $instance)]);
+        view('bonus.createandedit', ['instance' => $instance, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.new', $instance)]);
+        return null;
     }
     public function new(Request $request)
     {

80) /var/www/app/Http/Controllers/BonusSecretaryController.php:37    [M] ArrayItem

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $users = User::orderBy('surname')->get();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('bonus.createandedit', ['instance' => $instance, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.new', $instance)]);
+        return view('bonus.createandedit', ['instance' => $instance, 'users' => $users, 'defaultlists' => $defaultlists, 'route' > route('secretary.bonus.new', $instance)]);
     }
     public function new(Request $request)
     {

81) /var/www/app/Http/Controllers/BonusSecretaryController.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $users = User::orderBy('surname')->get();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('bonus.createandedit', ['instance' => $instance, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.new', $instance)]);
+        return view('bonus.createandedit', ['users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.new', $instance)]);
     }
     public function new(Request $request)
     {

82) /var/www/app/Http/Controllers/BonusSecretaryController.php:40    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $defaultlists = Auth::user()->secretary->default_lists;
         return view('bonus.createandedit', ['instance' => $instance, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.new', $instance)]);
     }
-    public function new(Request $request)
+    protected function new(Request $request)
     {
         $instance = \Instantiation::instance();
         $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);

83) /var/www/app/Http/Controllers/BonusSecretaryController.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
+        $request->validate(['hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
         $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' => $request->input('hours')]);
         $bonus->comittee()->associate(Auth::user()->secretary->comittee);
         $bonus->save();

84) /var/www/app/Http/Controllers/BonusSecretaryController.php:45    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
+        
         $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' => $request->input('hours')]);
         $bonus->comittee()->associate(Auth::user()->secretary->comittee);
         $bonus->save();

85) /var/www/app/Http/Controllers/BonusSecretaryController.php:51    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
-        $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' => $request->input('hours')]);
+        $bonus = Bonus::create(['hours' => $request->input('hours')]);
         $bonus->comittee()->associate(Auth::user()->secretary->comittee);
         $bonus->save();
         // Asociamos los usuarios a la reunión

86) /var/www/app/Http/Controllers/BonusSecretaryController.php:52    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
-        $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' => $request->input('hours')]);
+        $bonus = Bonus::create(['reason' > $request->input('reason'), 'hours' => $request->input('hours')]);
         $bonus->comittee()->associate(Auth::user()->secretary->comittee);
         $bonus->save();
         // Asociamos los usuarios a la reunión

87) /var/www/app/Http/Controllers/BonusSecretaryController.php:53    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
-        $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' => $request->input('hours')]);
+        $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' > $request->input('hours')]);
         $bonus->comittee()->associate(Auth::user()->secretary->comittee);
         $bonus->save();
         // Asociamos los usuarios a la reunión

88) /var/www/app/Http/Controllers/BonusSecretaryController.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
         $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' => $request->input('hours')]);
-        $bonus->comittee()->associate(Auth::user()->secretary->comittee);
+        
         $bonus->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);

89) /var/www/app/Http/Controllers/BonusSecretaryController.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100', 'users' => 'required|array|min:1']);
         $bonus = Bonus::create(['reason' => $request->input('reason'), 'hours' => $request->input('hours')]);
         $bonus->comittee()->associate(Auth::user()->secretary->comittee);
-        $bonus->save();
+        
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);
         foreach ($users_ids as $user_id) {

90) /var/www/app/Http/Controllers/BonusSecretaryController.php:63    [M] Foreach_

--- Original
+++ New
@@ @@
         $bonus->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);
-        foreach ($users_ids as $user_id) {
+        foreach (array() as $user_id) {
             $user = User::find($user_id);
             $bonus->users()->attach($user);
         }

91) /var/www/app/Http/Controllers/BonusSecretaryController.php:67    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $users_ids = $request->input('users', []);
         foreach ($users_ids as $user_id) {
             $user = User::find($user_id);
-            $bonus->users()->attach($user);
+            
         }
         return redirect()->route('secretary.bonus.list', $instance)->with('success', 'Bono de horas creado con éxito.');
     }

92) /var/www/app/Http/Controllers/BonusSecretaryController.php:75    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('secretary.bonus.list', $instance)->with('success', 'Bono de horas creado con éxito.');
     }
-    public function edit($instance, $id)
+    protected function edit($instance, $id)
     {
         $bonus = Bonus::find($id);
         $users = User::orderBy('surname')->get();

93) /var/www/app/Http/Controllers/BonusSecretaryController.php:81    [M] FunctionCall

--- Original
+++ New
@@ @@
         $bonus = Bonus::find($id);
         $users = User::orderBy('surname')->get();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
+        view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
+        return null;
     }
     public function save(Request $request)
     {

94) /var/www/app/Http/Controllers/BonusSecretaryController.php:82    [M] TrueValue

--- Original
+++ New
@@ @@
         $bonus = Bonus::find($id);
         $users = User::orderBy('surname')->get();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
+        return view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => false, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
     }
     public function save(Request $request)
     {

95) /var/www/app/Http/Controllers/BonusSecretaryController.php:82    [M] ArrayItem

--- Original
+++ New
@@ @@
         $bonus = Bonus::find($id);
         $users = User::orderBy('surname')->get();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
+        return view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' > route('secretary.bonus.save', $instance)]);
     }
     public function save(Request $request)
     {

96) /var/www/app/Http/Controllers/BonusSecretaryController.php:82    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $bonus = Bonus::find($id);
         $users = User::orderBy('surname')->get();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
+        return view('bonus.createandedit', ['bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
     }
     public function save(Request $request)
     {

97) /var/www/app/Http/Controllers/BonusSecretaryController.php:85    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $defaultlists = Auth::user()->secretary->default_lists;
         return view('bonus.createandedit', ['instance' => $instance, 'bonus' => $bonus, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.bonus.save', $instance)]);
     }
-    public function save(Request $request)
+    protected function save(Request $request)
     {
         $instance = \Instantiation::instance();
         $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100']);

98) /var/www/app/Http/Controllers/BonusSecretaryController.php:90    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function save(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100']);
+        $request->validate(['hours' => 'required|numeric|between:0.5,99.99|max:100']);
         $bonus = Bonus::find($request->_id);
         $bonus->reason = $request->input('reason');
         $bonus->hours = $request->input('hours');

99) /var/www/app/Http/Controllers/BonusSecretaryController.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function save(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['reason' => 'required|min:5|max:255', 'hours' => 'required|numeric|between:0.5,99.99|max:100']);
+        
         $bonus = Bonus::find($request->_id);
         $bonus->reason = $request->input('reason');
         $bonus->hours = $request->input('hours');

100) /var/www/app/Http/Controllers/BonusSecretaryController.php:99    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $bonus = Bonus::find($request->_id);
         $bonus->reason = $request->input('reason');
         $bonus->hours = $request->input('hours');
-        $bonus->save();
+        
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);
         // eliminamos usuarios antiguos del bono

101) /var/www/app/Http/Controllers/BonusSecretaryController.php:105    [M] Foreach_

--- Original
+++ New
@@ @@
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);
         // eliminamos usuarios antiguos del bono
-        foreach ($bonus->users as $user) {
+        foreach (array() as $user) {
             $bonus->users()->detach($user);
         }
         // agregamos los usuarios nuevos del bono

102) /var/www/app/Http/Controllers/BonusSecretaryController.php:107    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $users_ids = $request->input('users', []);
         // eliminamos usuarios antiguos del bono
         foreach ($bonus->users as $user) {
-            $bonus->users()->detach($user);
+            
         }
         // agregamos los usuarios nuevos del bono
         foreach ($users_ids as $user_id) {

103) /var/www/app/Http/Controllers/BonusSecretaryController.php:111    [M] Foreach_

--- Original
+++ New
@@ @@
             $bonus->users()->detach($user);
         }
         // agregamos los usuarios nuevos del bono
-        foreach ($users_ids as $user_id) {
+        foreach (array() as $user_id) {
             $user = User::find($user_id);
             $bonus->users()->attach($user);
         }

105) /var/www/app/Http/Controllers/BonusSecretaryController.php:121    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('secretary.bonus.list', $instance)->with('success', 'Bono editado con éxito.');
     }
-    public function remove(Request $request)
+    protected function remove(Request $request)
     {
         $bonus = Bonus::find($request->_id);
         $instance = \Instantiation::instance();

106) /var/www/app/Http/Controllers/BonusSecretaryController.php:126    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $bonus = Bonus::find($request->_id);
         $instance = \Instantiation::instance();
-        $bonus->delete();
+        
         return redirect()->route('secretary.bonus.list', $instance)->with('success', 'Bono eliminado con éxito.');
     }
 }

108) /var/www/app/Http/Controllers/ConfigController.php:14    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('checkroles:LECTURE|PRESIDENT');
+        
     }
     public function config()
     {

109) /var/www/app/Http/Controllers/ConfigController.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->middleware('auth');
         $this->middleware('checkroles:LECTURE|PRESIDENT');
     }
-    public function config()
+    protected function config()
     {
         $instance = \Instantiation::instance();
         $route = null;

110) /var/www/app/Http/Controllers/ConfigController.php:28    [M] DecrementInteger

--- Original
+++ New
@@ @@
         } else {
             $route = route('president.config.save', $instance);
         }
-        $configuration = Configuration::find(1);
+        $configuration = Configuration::find(0);
         return view('config.config', ['instance' => $instance, 'route' => $route, 'configuration' => $configuration]);
     }
     public function config_save(Request $request)

111) /var/www/app/Http/Controllers/ConfigController.php:28    [M] IncrementInteger

--- Original
+++ New
@@ @@
         } else {
             $route = route('president.config.save', $instance);
         }
-        $configuration = Configuration::find(1);
+        $configuration = Configuration::find(2);
         return view('config.config', ['instance' => $instance, 'route' => $route, 'configuration' => $configuration]);
     }
     public function config_save(Request $request)

112) /var/www/app/Http/Controllers/ConfigController.php:30    [M] FunctionCall

--- Original
+++ New
@@ @@
             $route = route('president.config.save', $instance);
         }
         $configuration = Configuration::find(1);
-        return view('config.config', ['instance' => $instance, 'route' => $route, 'configuration' => $configuration]);
+        view('config.config', ['instance' => $instance, 'route' => $route, 'configuration' => $configuration]);
+        return null;
     }
     public function config_save(Request $request)
     {

113) /var/www/app/Http/Controllers/ConfigController.php:31    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $route = route('president.config.save', $instance);
         }
         $configuration = Configuration::find(1);
-        return view('config.config', ['instance' => $instance, 'route' => $route, 'configuration' => $configuration]);
+        return view('config.config', ['route' => $route, 'configuration' => $configuration]);
     }
     public function config_save(Request $request)
     {

114) /var/www/app/Http/Controllers/ConfigController.php:34    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         return view('config.config', ['instance' => $instance, 'route' => $route, 'configuration' => $configuration]);
     }
-    public function config_save(Request $request)
+    protected function config_save(Request $request)
     {
         $instance = \Instantiation::instance();

117) /var/www/app/Http/Controllers/ConfigController.php:46    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
-        $configuration = Configuration::find(1);
+        $configuration = Configuration::find(0);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');

118) /var/www/app/Http/Controllers/ConfigController.php:46    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
-        $configuration = Configuration::find(1);
+        $configuration = Configuration::find(2);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');

119) /var/www/app/Http/Controllers/ConfigController.php:48    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $configuration = Configuration::find(1);
-        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
+        $configuration->upload_evidences_timestamp = " " . $request->input('upload_evidences_date') . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');

120) /var/www/app/Http/Controllers/ConfigController.php:48    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $configuration = Configuration::find(1);
-        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
+        $configuration->upload_evidences_timestamp = " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');

121) /var/www/app/Http/Controllers/ConfigController.php:48    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $configuration = Configuration::find(1);
-        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
+        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');

122) /var/www/app/Http/Controllers/ConfigController.php:48    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $configuration = Configuration::find(1);
-        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
+        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . $request->input('upload_evidences_time') . " ";
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');

123) /var/www/app/Http/Controllers/ConfigController.php:48    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $configuration = Configuration::find(1);
-        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
+        $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " ";
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
