5) /var/www/app/Http/Controllers/Api/v1/AuthController.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
             return response()->json(['status' => false, 'error' => $validator->messages()], 200);
         }
         $attemptedUser = User::where('email', '=', $request['email'])->first();
-        if (!$attemptedUser || !Hash::check($request['password'], $attemptedUser->password)) {
+        if ($attemptedUser || !Hash::check($request['password'], $attemptedUser->password)) {
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
         if (!($token = auth('api')->login($attemptedUser))) {

6) /var/www/app/Http/Controllers/Api/v1/AuthController.php:29    [M] LogicalNot

--- Original
+++ New
@@ @@
             return response()->json(['status' => false, 'error' => $validator->messages()], 200);
         }
         $attemptedUser = User::where('email', '=', $request['email'])->first();
-        if (!$attemptedUser || !Hash::check($request['password'], $attemptedUser->password)) {
+        if (!$attemptedUser || Hash::check($request['password'], $attemptedUser->password)) {
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
         if (!($token = auth('api')->login($attemptedUser))) {

7) /var/www/app/Http/Controllers/Api/v1/AuthController.php:29    [M] LogicalOr

--- Original
+++ New
@@ @@
             return response()->json(['status' => false, 'error' => $validator->messages()], 200);
         }
         $attemptedUser = User::where('email', '=', $request['email'])->first();
-        if (!$attemptedUser || !Hash::check($request['password'], $attemptedUser->password)) {
+        if (!$attemptedUser && !Hash::check($request['password'], $attemptedUser->password)) {
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
         if (!($token = auth('api')->login($attemptedUser))) {

8) /var/www/app/Http/Controllers/Api/v1/AuthController.php:36    [M] LogicalNot

--- Original
+++ New
@@ @@
         if (!$attemptedUser || !Hash::check($request['password'], $attemptedUser->password)) {
             return response()->json(['status' => false, 'error' => 'Invalid credentials']);
         }
-        if (!($token = auth('api')->login($attemptedUser))) {
+        if ($token = auth('api')->login($attemptedUser)) {
             return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 401);
         }
         return response()->json(['token' => $token]);

9) /var/www/app/Http/Controllers/Api/v1/AuthController.php:43    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if (!($token = auth('api')->login($attemptedUser))) {
             return response()->json(['status' => false, 'error' => 'Could not login. Please try later'], 401);
         }
-        return response()->json(['token' => $token]);
+        return response()->json([]);
     }
     public function logout(Request $request)
     {


Not Covered mutants:
====================
