124) /var/www/app/Http/Controllers/ConfigController.php:49    [M] Concat

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
-        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
+        $configuration->validate_evidences_timestamp = " " . $request->input('validate_evidences_date') . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');

125) /var/www/app/Http/Controllers/ConfigController.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
-        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
+        $configuration->validate_evidences_timestamp = " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');

126) /var/www/app/Http/Controllers/ConfigController.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
-        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
+        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');

127) /var/www/app/Http/Controllers/ConfigController.php:49    [M] Concat

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
-        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
+        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . $request->input('validate_evidences_time') . " ";
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');

128) /var/www/app/Http/Controllers/ConfigController.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
-        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
+        $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " ";
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');

129) /var/www/app/Http/Controllers/ConfigController.php:50    [M] Concat

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
-        $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
+        $configuration->meetings_timestamp = " " . $request->input('meetings_date') . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();

130) /var/www/app/Http/Controllers/ConfigController.php:50    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
-        $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
+        $configuration->meetings_timestamp = " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();

131) /var/www/app/Http/Controllers/ConfigController.php:50    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
-        $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
+        $configuration->meetings_timestamp = $request->input('meetings_date') . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();

132) /var/www/app/Http/Controllers/ConfigController.php:50    [M] Concat

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
-        $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
+        $configuration->meetings_timestamp = $request->input('meetings_date') . $request->input('meetings_time') . " ";
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();

133) /var/www/app/Http/Controllers/ConfigController.php:50    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration = Configuration::find(1);
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
-        $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
+        $configuration->meetings_timestamp = $request->input('meetings_date') . " ";
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();

134) /var/www/app/Http/Controllers/ConfigController.php:51    [M] Concat

--- Original
+++ New
@@ @@
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
-        $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
+        $configuration->bonus_timestamp = " " . $request->input('bonus_date') . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {

135) /var/www/app/Http/Controllers/ConfigController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
-        $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
+        $configuration->bonus_timestamp = " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {

136) /var/www/app/Http/Controllers/ConfigController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
-        $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
+        $configuration->bonus_timestamp = $request->input('bonus_date') . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {

137) /var/www/app/Http/Controllers/ConfigController.php:51    [M] Concat

--- Original
+++ New
@@ @@
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
-        $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
+        $configuration->bonus_timestamp = $request->input('bonus_date') . $request->input('bonus_time') . " ";
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {

138) /var/www/app/Http/Controllers/ConfigController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration->upload_evidences_timestamp = $request->input('upload_evidences_date') . " " . $request->input('upload_evidences_time');
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
-        $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
+        $configuration->bonus_timestamp = $request->input('bonus_date') . " ";
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {

139) /var/www/app/Http/Controllers/ConfigController.php:52    [M] Concat

--- Original
+++ New
@@ @@
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
-        $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
+        $configuration->attendee_timestamp = " " . $request->input('attendees_date') . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {
             return redirect()->route('lecture.config', $instance)->with('success', 'Configuración guardada con éxito.');

140) /var/www/app/Http/Controllers/ConfigController.php:52    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
-        $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
+        $configuration->attendee_timestamp = " " . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {
             return redirect()->route('lecture.config', $instance)->with('success', 'Configuración guardada con éxito.');

141) /var/www/app/Http/Controllers/ConfigController.php:52    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
-        $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
+        $configuration->attendee_timestamp = $request->input('attendees_date') . $request->input('attendees_time');
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {
             return redirect()->route('lecture.config', $instance)->with('success', 'Configuración guardada con éxito.');

142) /var/www/app/Http/Controllers/ConfigController.php:52    [M] Concat

--- Original
+++ New
@@ @@
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
-        $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
+        $configuration->attendee_timestamp = $request->input('attendees_date') . $request->input('attendees_time') . " ";
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {
             return redirect()->route('lecture.config', $instance)->with('success', 'Configuración guardada con éxito.');

143) /var/www/app/Http/Controllers/ConfigController.php:52    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $configuration->validate_evidences_timestamp = $request->input('validate_evidences_date') . " " . $request->input('validate_evidences_time');
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
-        $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
+        $configuration->attendee_timestamp = $request->input('attendees_date') . " ";
         $configuration->save();
         if (Auth::user()->hasRole('LECTURE')) {
             return redirect()->route('lecture.config', $instance)->with('success', 'Configuración guardada con éxito.');

144) /var/www/app/Http/Controllers/ConfigController.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $configuration->meetings_timestamp = $request->input('meetings_date') . " " . $request->input('meetings_time');
         $configuration->bonus_timestamp = $request->input('bonus_date') . " " . $request->input('bonus_time');
         $configuration->attendee_timestamp = $request->input('attendees_date') . " " . $request->input('attendees_time');
-        $configuration->save();
+        
         if (Auth::user()->hasRole('LECTURE')) {
             return redirect()->route('lecture.config', $instance)->with('success', 'Configuración guardada con éxito.');
         } else {

148) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:25    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $defaultlists = Auth::user()->secretary->default_lists()->get();
-        return view('defaultlist.list', ['instance' => $instance, 'defaultlists' => $defaultlists]);
+        view('defaultlist.list', ['instance' => $instance, 'defaultlists' => $defaultlists]);
+        return null;
     }
     public function create()
     {

149) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:26    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $defaultlists = Auth::user()->secretary->default_lists()->get();
-        return view('defaultlist.list', ['instance' => $instance, 'defaultlists' => $defaultlists]);
+        return view('defaultlist.list', ['defaultlists' => $defaultlists]);
     }
     public function create()
     {

151) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:35    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $users = User::orderBy('surname')->get();
-        return view('defaultlist.createandedit', ['instance' => $instance, 'users' => $users, 'route' => route('secretary.defaultlist.new', $instance)]);
+        view('defaultlist.createandedit', ['instance' => $instance, 'users' => $users, 'route' => route('secretary.defaultlist.new', $instance)]);
+        return null;
     }
     public function new(Request $request)
     {

152) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:36    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $users = User::orderBy('surname')->get();
-        return view('defaultlist.createandedit', ['instance' => $instance, 'users' => $users, 'route' => route('secretary.defaultlist.new', $instance)]);
+        return view('defaultlist.createandedit', ['instance' => $instance, 'users' => $users, 'route' > route('secretary.defaultlist.new', $instance)]);
     }
     public function new(Request $request)
     {

153) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:36    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $users = User::orderBy('surname')->get();
-        return view('defaultlist.createandedit', ['instance' => $instance, 'users' => $users, 'route' => route('secretary.defaultlist.new', $instance)]);
+        return view('defaultlist.createandedit', ['users' => $users, 'route' => route('secretary.defaultlist.new', $instance)]);
     }
     public function new(Request $request)
     {

155) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $validatedData = $request->validate(['name' => 'required|max:255', 'users' => 'required|array|min:1']);
+        $validatedData = $request->validate(['users' => 'required|array|min:1']);
         $users_ids = $request->input('users', []);
         $secretary = Auth::user()->secretary;
         $defaultlist = DefaultList::create(['name' => $request->input('name'), 'secretary_id' => $secretary->id]);

156) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:53    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $validatedData = $request->validate(['name' => 'required|max:255', 'users' => 'required|array|min:1']);
         $users_ids = $request->input('users', []);
         $secretary = Auth::user()->secretary;
-        $defaultlist = DefaultList::create(['name' => $request->input('name'), 'secretary_id' => $secretary->id]);
+        $defaultlist = DefaultList::create(['secretary_id' => $secretary->id]);
         $defaultlist->save();
         foreach ($users_ids as $user_id) {
             $user = User::find($user_id);

157) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:54    [M] ArrayItem

--- Original
+++ New
@@ @@
         $validatedData = $request->validate(['name' => 'required|max:255', 'users' => 'required|array|min:1']);
         $users_ids = $request->input('users', []);
         $secretary = Auth::user()->secretary;
-        $defaultlist = DefaultList::create(['name' => $request->input('name'), 'secretary_id' => $secretary->id]);
+        $defaultlist = DefaultList::create(['name' > $request->input('name'), 'secretary_id' => $secretary->id]);
         $defaultlist->save();
         foreach ($users_ids as $user_id) {
             $user = User::find($user_id);

158) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:55    [M] ArrayItem

--- Original
+++ New
@@ @@
         $validatedData = $request->validate(['name' => 'required|max:255', 'users' => 'required|array|min:1']);
         $users_ids = $request->input('users', []);
         $secretary = Auth::user()->secretary;
-        $defaultlist = DefaultList::create(['name' => $request->input('name'), 'secretary_id' => $secretary->id]);
+        $defaultlist = DefaultList::create(['name' => $request->input('name'), 'secretary_id' > $secretary->id]);
         $defaultlist->save();
         foreach ($users_ids as $user_id) {
             $user = User::find($user_id);

159) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:59    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $users_ids = $request->input('users', []);
         $secretary = Auth::user()->secretary;
         $defaultlist = DefaultList::create(['name' => $request->input('name'), 'secretary_id' => $secretary->id]);
-        $defaultlist->save();
+        
         foreach ($users_ids as $user_id) {
             $user = User::find($user_id);
             $defaultlist->users()->attach($user);

160) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:61    [M] Foreach_

--- Original
+++ New
@@ @@
         $secretary = Auth::user()->secretary;
         $defaultlist = DefaultList::create(['name' => $request->input('name'), 'secretary_id' => $secretary->id]);
         $defaultlist->save();
-        foreach ($users_ids as $user_id) {
+        foreach (array() as $user_id) {
             $user = User::find($user_id);
             $defaultlist->users()->attach($user);
         }

161) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $defaultlist->save();
         foreach ($users_ids as $user_id) {
             $user = User::find($user_id);
-            $defaultlist->users()->attach($user);
+            
         }
         return redirect()->route('secretary.defaultlist.list', $instance)->with('success', 'Lista creada con éxito.');
     }

163) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:80    [M] FunctionCall

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $defaultlist = DefaultList::find($id);
         $users = User::orderBy('surname')->get();
-        return view('defaultlist.createandedit', ['instance' => $instance, 'defaultlist' => $defaultlist, 'users' => $users, 'route' => route('secretary.defaultlist.save', $instance), 'edit' => true]);
+        view('defaultlist.createandedit', ['instance' => $instance, 'defaultlist' => $defaultlist, 'users' => $users, 'route' => route('secretary.defaultlist.save', $instance), 'edit' => true]);
+        return null;
     }
     public function save(Request $request)
     {

164) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:81    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $defaultlist = DefaultList::find($id);
         $users = User::orderBy('surname')->get();
-        return view('defaultlist.createandedit', ['instance' => $instance, 'defaultlist' => $defaultlist, 'users' => $users, 'route' => route('secretary.defaultlist.save', $instance), 'edit' => true]);
+        return view('defaultlist.createandedit', ['defaultlist' => $defaultlist, 'users' => $users, 'route' => route('secretary.defaultlist.save', $instance), 'edit' => true]);
     }
     public function save(Request $request)
     {

165) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:82    [M] ArrayItem

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $defaultlist = DefaultList::find($id);
         $users = User::orderBy('surname')->get();
-        return view('defaultlist.createandedit', ['instance' => $instance, 'defaultlist' => $defaultlist, 'users' => $users, 'route' => route('secretary.defaultlist.save', $instance), 'edit' => true]);
+        return view('defaultlist.createandedit', ['instance' => $instance, 'defaultlist' => $defaultlist, 'users' => $users, 'route' > route('secretary.defaultlist.save', $instance), 'edit' => true]);
     }
     public function save(Request $request)
     {

166) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:82    [M] TrueValue

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $defaultlist = DefaultList::find($id);
         $users = User::orderBy('surname')->get();
-        return view('defaultlist.createandedit', ['instance' => $instance, 'defaultlist' => $defaultlist, 'users' => $users, 'route' => route('secretary.defaultlist.save', $instance), 'edit' => true]);
+        return view('defaultlist.createandedit', ['instance' => $instance, 'defaultlist' => $defaultlist, 'users' => $users, 'route' => route('secretary.defaultlist.save', $instance), 'edit' => false]);
     }
     public function save(Request $request)
     {

168) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function save(Request $request)
     {
         $instance = \Instantiation::instance();
-        $validatedData = $request->validate(['name' => 'required|max:255']);
+        $validatedData = $request->validate([]);
         $users_ids = $request->input('users', []);
         $defaultlist = DefaultList::find($request->_id);
         $defaultlist->name = $request->input('name');
