169) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:99    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $users_ids = $request->input('users', []);
         $defaultlist = DefaultList::find($request->_id);
         $defaultlist->name = $request->input('name');
-        $defaultlist->save();
+        
         // eliminamos usuarios antiguos
         foreach ($defaultlist->users as $user) {
             $defaultlist->users()->detach($user);

170) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:102    [M] Foreach_

--- Original
+++ New
@@ @@
         $defaultlist->name = $request->input('name');
         $defaultlist->save();
         // eliminamos usuarios antiguos
-        foreach ($defaultlist->users as $user) {
+        foreach (array() as $user) {
             $defaultlist->users()->detach($user);
         }
         // agregamos los usuarios nuevos

171) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:104    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $defaultlist->save();
         // eliminamos usuarios antiguos
         foreach ($defaultlist->users as $user) {
-            $defaultlist->users()->detach($user);
+            
         }
         // agregamos los usuarios nuevos
         foreach ($users_ids as $user_id) {

172) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:108    [M] Foreach_

--- Original
+++ New
@@ @@
             $defaultlist->users()->detach($user);
         }
         // agregamos los usuarios nuevos
-        foreach ($users_ids as $user_id) {
+        foreach (array() as $user_id) {
             $user = User::find($user_id);
             $defaultlist->users()->attach($user);
         }

175) /var/www/app/Http/Controllers/DefaultListSecretaryController.php:123    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $defaultlist = DefaultList::find($request->_id);
         $instance = \Instantiation::instance();
-        $defaultlist->delete();
+        
         return redirect()->route('secretary.defaultlist.list', $instance)->with('success', 'Lista eliminada con éxito.');
     }
 }

176) /var/www/app/Http/Controllers/DeployController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use App\Models\Instance;
 class DeployController extends Controller
 {
-    public function deploy(Request $request)
+    protected function deploy(Request $request)
     {
         $username = $request->input('username');
         $password = $request->input('password');

177) /var/www/app/Http/Controllers/DeployController.php:20    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $password = $request->input('password');
         $username_env = env('DB_USERNAME');
         $passsword_env = env('DB_PASSWORD');
-        $check_username = strcmp($username, $username_env) == 0;
+        $check_username = strcmp($username, $username_env) == -1;
         $check_password = strcmp($password, $passsword_env) == 0;
         if ($check_username && $check_password) {
             Artisan::call('evidentia:update');

178) /var/www/app/Http/Controllers/DeployController.php:20    [M] Equal

--- Original
+++ New
@@ @@
         $password = $request->input('password');
         $username_env = env('DB_USERNAME');
         $passsword_env = env('DB_PASSWORD');
-        $check_username = strcmp($username, $username_env) == 0;
+        $check_username = strcmp($username, $username_env) != 0;
         $check_password = strcmp($password, $passsword_env) == 0;
         if ($check_username && $check_password) {
             Artisan::call('evidentia:update');

179) /var/www/app/Http/Controllers/DeployController.php:21    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $username_env = env('DB_USERNAME');
         $passsword_env = env('DB_PASSWORD');
         $check_username = strcmp($username, $username_env) == 0;
-        $check_password = strcmp($password, $passsword_env) == 0;
+        $check_password = strcmp($password, $passsword_env) == -1;
         if ($check_username && $check_password) {
             Artisan::call('evidentia:update');
         }
     }
 }

180) /var/www/app/Http/Controllers/DeployController.php:21    [M] Equal

--- Original
+++ New
@@ @@
         $username_env = env('DB_USERNAME');
         $passsword_env = env('DB_PASSWORD');
         $check_username = strcmp($username, $username_env) == 0;
-        $check_password = strcmp($password, $passsword_env) == 0;
+        $check_password = strcmp($password, $passsword_env) != 0;
         if ($check_username && $check_password) {
             Artisan::call('evidentia:update');
         }
     }
 }

181) /var/www/app/Http/Controllers/DeployController.php:23    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $passsword_env = env('DB_PASSWORD');
         $check_username = strcmp($username, $username_env) == 0;
         $check_password = strcmp($password, $passsword_env) == 0;
-        if ($check_username && $check_password) {
+        if ($check_username || $check_password) {
             Artisan::call('evidentia:update');
         }
     }
 }

182) /var/www/app/Http/Controllers/DeployController.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $check_username = strcmp($username, $username_env) == 0;
         $check_password = strcmp($password, $passsword_env) == 0;
         if ($check_username && $check_password) {
-            Artisan::call('evidentia:update');
+            
         }
     }
 }

183) /var/www/app/Http/Controllers/DownloadController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Support\Facades\Storage;
 class DownloadController extends Controller
 {
-    public function request_download($instance, $id)
+    protected function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
         $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');

184) /var/www/app/Http/Controllers/DownloadController.php:16    [M] Concat

--- Original
+++ New
@@ @@
     public function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        $response = Storage::download('/meeting_requests/meeting_request_' . \Instantiation::instance() . $meeting_request->id . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;

185) /var/www/app/Http/Controllers/DownloadController.php:16    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        $response = Storage::download('/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;

186) /var/www/app/Http/Controllers/DownloadController.php:16    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . $meeting_request->id . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;

187) /var/www/app/Http/Controllers/DownloadController.php:16    [M] Concat

--- Original
+++ New
@@ @@
     public function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . $meeting_request->id . '/meeting_requests/meeting_request_' . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;

188) /var/www/app/Http/Controllers/DownloadController.php:16    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;

189) /var/www/app/Http/Controllers/DownloadController.php:16    [M] Concat

--- Original
+++ New
@@ @@
     public function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf' . $meeting_request->id);
         // limpiar búfer de salida
         ob_end_clean();
         return $response;

190) /var/www/app/Http/Controllers/DownloadController.php:16    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id);
         // limpiar búfer de salida
         ob_end_clean();
         return $response;

191) /var/www/app/Http/Controllers/DownloadController.php:19    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     {
         $meeting_request = MeetingRequest::findOrFail($id);
         $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
-        // limpiar búfer de salida
-        ob_end_clean();
+        
         return $response;
     }
     public function minutes_download($instance, $id)

192) /var/www/app/Http/Controllers/DownloadController.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
         ob_end_clean();
         return $response;
     }
-    public function minutes_download($instance, $id)
+    protected function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
         $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');

193) /var/www/app/Http/Controllers/DownloadController.php:28    [M] Concat

--- Original
+++ New
@@ @@
     public function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        $response = Storage::download('/meeting_minutes/meeting_minutes_' . \Instantiation::instance() . $meeting_minutes->id . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;
     }
 }

194) /var/www/app/Http/Controllers/DownloadController.php:28    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        $response = Storage::download('/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;
     }
 }

195) /var/www/app/Http/Controllers/DownloadController.php:28    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . $meeting_minutes->id . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;
     }
 }

196) /var/www/app/Http/Controllers/DownloadController.php:28    [M] Concat

--- Original
+++ New
@@ @@
     public function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . $meeting_minutes->id . '/meeting_minutes/meeting_minutes_' . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;
     }
 }

197) /var/www/app/Http/Controllers/DownloadController.php:28    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf');
         // limpiar búfer de salida
         ob_end_clean();
         return $response;
     }
 }

198) /var/www/app/Http/Controllers/DownloadController.php:28    [M] Concat

--- Original
+++ New
@@ @@
     public function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf' . $meeting_minutes->id);
         // limpiar búfer de salida
         ob_end_clean();
         return $response;
     }
 }

199) /var/www/app/Http/Controllers/DownloadController.php:28    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function minutes_download($instance, $id)
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
-        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id);
         // limpiar búfer de salida
         ob_end_clean();
         return $response;
     }
 }

200) /var/www/app/Http/Controllers/DownloadController.php:31    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     {
         $meeting_minutes = MeetingMinutes::findOrFail($id);
         $response = Storage::download(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
-        // limpiar búfer de salida
-        ob_end_clean();
+        
         return $response;
     }
 }

202) /var/www/app/Http/Controllers/EventbriteController.php:20    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('checkroles:REGISTER_COORDINATOR');
+        
     }
     public function token()
     {

203) /var/www/app/Http/Controllers/EventbriteController.php:23    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->middleware('auth');
         $this->middleware('checkroles:REGISTER_COORDINATOR');
     }
-    public function token()
+    protected function token()
     {
         $instance = \Instantiation::instance();
         $token = \Config::eventbrite_token();

204) /var/www/app/Http/Controllers/EventbriteController.php:29    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = \Config::eventbrite_token();
         $route = route('registercoordinator.token.save', $instance);
-        return view('eventbrite.token', ['instance' => $instance, 'token' => $token, 'route' => $route]);
+        return view('eventbrite.token', ['token' => $token, 'route' => $route]);
     }
     private static function validate_token($token)
     {

205) /var/www/app/Http/Controllers/EventbriteController.php:29    [M] FunctionCall

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = \Config::eventbrite_token();
         $route = route('registercoordinator.token.save', $instance);
-        return view('eventbrite.token', ['instance' => $instance, 'token' => $token, 'route' => $route]);
+        view('eventbrite.token', ['instance' => $instance, 'token' => $token, 'route' => $route]);
+        return null;
     }
     private static function validate_token($token)
     {

206) /var/www/app/Http/Controllers/EventbriteController.php:34    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private static function validate_token($token)
     {
-        $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
+        $client = new Client([]);
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
         return $response->getStatusCode() == 200 ? true : false;
     }

207) /var/www/app/Http/Controllers/EventbriteController.php:35    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     private static function validate_token($token)
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
-        $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
+        $response = $client->request('GET', 'users/me/', []);
         return $response->getStatusCode() == 200 ? true : false;
     }
     public function token_save(Request $request)

208) /var/www/app/Http/Controllers/EventbriteController.php:36    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     private static function validate_token($token)
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
-        $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
+        $response = $client->request('GET', 'users/me/', ['query' => []]);
         return $response->getStatusCode() == 200 ? true : false;
     }
     public function token_save(Request $request)

209) /var/www/app/Http/Controllers/EventbriteController.php:39    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
-        return $response->getStatusCode() == 200 ? true : false;
+        return $response->getStatusCode() == 199 ? true : false;
     }
     public function token_save(Request $request)
     {

210) /var/www/app/Http/Controllers/EventbriteController.php:39    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
-        return $response->getStatusCode() == 200 ? true : false;
+        return $response->getStatusCode() == 201 ? true : false;
     }
     public function token_save(Request $request)
     {

211) /var/www/app/Http/Controllers/EventbriteController.php:39    [M] Equal

--- Original
+++ New
@@ @@
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
-        return $response->getStatusCode() == 200 ? true : false;
+        return $response->getStatusCode() != 200 ? true : false;
     }
     public function token_save(Request $request)
     {

212) /var/www/app/Http/Controllers/EventbriteController.php:39    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
-        return $response->getStatusCode() == 200 ? true : false;
+        return $response->getStatusCode() == 200 ? false : false;
     }
     public function token_save(Request $request)
     {

213) /var/www/app/Http/Controllers/EventbriteController.php:39    [M] FalseValue

--- Original
+++ New
@@ @@
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
-        return $response->getStatusCode() == 200 ? true : false;
+        return $response->getStatusCode() == 200 ? true : true;
     }
     public function token_save(Request $request)
     {

214) /var/www/app/Http/Controllers/EventbriteController.php:39    [M] Ternary

--- Original
+++ New
@@ @@
     {
         $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
-        return $response->getStatusCode() == 200 ? true : false;
+        return $response->getStatusCode() == 200 ? false : true;
     }
     public function token_save(Request $request)
     {

215) /var/www/app/Http/Controllers/EventbriteController.php:43    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $response = $client->request('GET', 'users/me/', ['query' => ['token' => $token]]);
         return $response->getStatusCode() == 200 ? true : false;
     }
-    public function token_save(Request $request)
+    protected function token_save(Request $request)
     {
         $instance = \Instantiation::instance();
         $request->validate(['token' => 'required|max:255']);

216) /var/www/app/Http/Controllers/EventbriteController.php:47    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function token_save(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['token' => 'required|max:255']);
+        $request->validate([]);
         $token = $request->input('token');
         try {
             if (EventbriteController::validate_token($token)) {

217) /var/www/app/Http/Controllers/EventbriteController.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function token_save(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['token' => 'required|max:255']);
+        
         $token = $request->input('token');
         try {
             if (EventbriteController::validate_token($token)) {

218) /var/www/app/Http/Controllers/EventbriteController.php:55    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $token = $request->input('token');
         try {
             if (EventbriteController::validate_token($token)) {
-                $configuration = Configuration::find(1);
+                $configuration = Configuration::find(0);
                 $configuration->eventbrite_token = $token;
                 $configuration->save();
                 return redirect()->route('registercoordinator.token', $instance)->with('success', 'Token validado y guardado con éxito.');

219) /var/www/app/Http/Controllers/EventbriteController.php:55    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $token = $request->input('token');
         try {
             if (EventbriteController::validate_token($token)) {
-                $configuration = Configuration::find(1);
+                $configuration = Configuration::find(2);
                 $configuration->eventbrite_token = $token;
                 $configuration->save();
                 return redirect()->route('registercoordinator.token', $instance)->with('success', 'Token validado y guardado con éxito.');

220) /var/www/app/Http/Controllers/EventbriteController.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (EventbriteController::validate_token($token)) {
                 $configuration = Configuration::find(1);
                 $configuration->eventbrite_token = $token;
-                $configuration->save();
+                
                 return redirect()->route('registercoordinator.token', $instance)->with('success', 'Token validado y guardado con éxito.');
             }
         } catch (\Exception $e) {

221) /var/www/app/Http/Controllers/EventbriteController.php:67    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return back()->withInput()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido.');
         }
     }
-    public function event_load()
+    protected function event_load()
     {
         $instance = \Instantiation::instance();
         $token = \Config::eventbrite_token();

222) /var/www/app/Http/Controllers/EventbriteController.php:75    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = \Config::eventbrite_token();
         try {
-            $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
+            $client = new Client([]);
             // obtenemos las organizaciones
             $organizations = $client->request('GET', 'users/me/organizations', ['query' => ['token' => $token]]);
             $organizations = json_decode($organizations->getBody());

223) /var/www/app/Http/Controllers/EventbriteController.php:78    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             // obtenemos las organizaciones
-            $organizations = $client->request('GET', 'users/me/organizations', ['query' => ['token' => $token]]);
+            $organizations = $client->request('GET', 'users/me/organizations', []);
             $organizations = json_decode($organizations->getBody());
             $organizations = (array) $organizations->organizations;
             // se itera sobre todas las organizaciones, si hubiera más de una

224) /var/www/app/Http/Controllers/EventbriteController.php:79    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             // obtenemos las organizaciones
-            $organizations = $client->request('GET', 'users/me/organizations', ['query' => ['token' => $token]]);
+            $organizations = $client->request('GET', 'users/me/organizations', ['query' => []]);
             $organizations = json_decode($organizations->getBody());
             $organizations = (array) $organizations->organizations;
             // se itera sobre todas las organizaciones, si hubiera más de una

225) /var/www/app/Http/Controllers/EventbriteController.php:82    [M] CastArray

--- Original
+++ New
@@ @@
             // obtenemos las organizaciones
             $organizations = $client->request('GET', 'users/me/organizations', ['query' => ['token' => $token]]);
             $organizations = json_decode($organizations->getBody());
-            $organizations = (array) $organizations->organizations;
+            $organizations = $organizations->organizations;
             // se itera sobre todas las organizaciones, si hubiera más de una
             foreach ($organizations as $organization) {
                 // averiguamos el ID de la organizacion

226) /var/www/app/Http/Controllers/EventbriteController.php:85    [M] Foreach_

--- Original
+++ New
@@ @@
             $organizations = json_decode($organizations->getBody());
             $organizations = (array) $organizations->organizations;
             // se itera sobre todas las organizaciones, si hubiera más de una
-            foreach ($organizations as $organization) {
+            foreach (array() as $organization) {
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos

227) /var/www/app/Http/Controllers/EventbriteController.php:91    [M] Concat

--- Original
+++ New
@@ @@
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos
-                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
+                $events = $client->request('GET', $organization_id . 'organizations/' . '/events', ['query' => ['token' => $token]]);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
                 foreach ($events as $event) {
