228) /var/www/app/Http/Controllers/EventbriteController.php:91    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos
-                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
+                $events = $client->request('GET', $organization_id . '/events', ['query' => ['token' => $token]]);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
                 foreach ($events as $event) {

229) /var/www/app/Http/Controllers/EventbriteController.php:91    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos
-                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
+                $events = $client->request('GET', 'organizations/' . '/events', ['query' => ['token' => $token]]);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
                 foreach ($events as $event) {

230) /var/www/app/Http/Controllers/EventbriteController.php:91    [M] Concat

--- Original
+++ New
@@ @@
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos
-                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
+                $events = $client->request('GET', 'organizations/' . '/events' . $organization_id, ['query' => ['token' => $token]]);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
                 foreach ($events as $event) {

231) /var/www/app/Http/Controllers/EventbriteController.php:91    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos
-                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
+                $events = $client->request('GET', 'organizations/' . $organization_id, ['query' => ['token' => $token]]);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
                 foreach ($events as $event) {

232) /var/www/app/Http/Controllers/EventbriteController.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos
-                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
+                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', []);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
                 foreach ($events as $event) {

233) /var/www/app/Http/Controllers/EventbriteController.php:92    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 // averiguamos el ID de la organizacion
                 $organization_id = $organization->id;
                 // obtenemos los eventos
-                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
+                $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => []]);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
                 foreach ($events as $event) {

234) /var/www/app/Http/Controllers/EventbriteController.php:95    [M] CastArray

--- Original
+++ New
@@ @@
                 // obtenemos los eventos
                 $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
                 $events = json_decode($events->getBody());
-                $events = (array) $events->events;
+                $events = $events->events;
                 foreach ($events as $event) {
                     // ¿el evento ha sido ya creado?
                     $saved_event = Event::where('id_eventbrite', $event->id)->first();

235) /var/www/app/Http/Controllers/EventbriteController.php:97    [M] Foreach_

--- Original
+++ New
@@ @@
                 $events = $client->request('GET', 'organizations/' . $organization_id . '/events', ['query' => ['token' => $token]]);
                 $events = json_decode($events->getBody());
                 $events = (array) $events->events;
-                foreach ($events as $event) {
+                foreach (array() as $event) {
                     // ¿el evento ha sido ya creado?
                     $saved_event = Event::where('id_eventbrite', $event->id)->first();
                     if ($saved_event != null) {

236) /var/www/app/Http/Controllers/EventbriteController.php:101    [M] NotEqual

--- Original
+++ New
@@ @@
                 foreach ($events as $event) {
                     // ¿el evento ha sido ya creado?
                     $saved_event = Event::where('id_eventbrite', $event->id)->first();
-                    if ($saved_event != null) {
+                    if ($saved_event == null) {
                         $saved_event->name = $event->name->html;
                         $saved_event->description = $event->description->html;
                         $saved_event->start_datetime = $event->start->local;

237) /var/www/app/Http/Controllers/EventbriteController.php:113    [M] TrueValue

--- Original
+++ New
@@ @@
                         // Cálculo de las horas
                         $start = new Carbon($saved_event->start_datetime);
                         $end = new Carbon($saved_event->end_datetime);
-                        $hours = $end->diffInMinutes($start, true);
+                        $hours = $end->diffInMinutes($start, false);
                         $hours = $hours / 60;
                         $saved_event->hours = $hours;
                         $saved_event->save();

238) /var/www/app/Http/Controllers/EventbriteController.php:114    [M] DecrementInteger

--- Original
+++ New
@@ @@
                         $start = new Carbon($saved_event->start_datetime);
                         $end = new Carbon($saved_event->end_datetime);
                         $hours = $end->diffInMinutes($start, true);
-                        $hours = $hours / 60;
+                        $hours = $hours / 59;
                         $saved_event->hours = $hours;
                         $saved_event->save();
                     } else {

239) /var/www/app/Http/Controllers/EventbriteController.php:114    [M] IncrementInteger

--- Original
+++ New
@@ @@
                         $start = new Carbon($saved_event->start_datetime);
                         $end = new Carbon($saved_event->end_datetime);
                         $hours = $end->diffInMinutes($start, true);
-                        $hours = $hours / 60;
+                        $hours = $hours / 61;
                         $saved_event->hours = $hours;
                         $saved_event->save();
                     } else {

240) /var/www/app/Http/Controllers/EventbriteController.php:114    [M] Division

--- Original
+++ New
@@ @@
                         $start = new Carbon($saved_event->start_datetime);
                         $end = new Carbon($saved_event->end_datetime);
                         $hours = $end->diffInMinutes($start, true);
-                        $hours = $hours / 60;
+                        $hours = $hours * 60;
                         $saved_event->hours = $hours;
                         $saved_event->save();
                     } else {

241) /var/www/app/Http/Controllers/EventbriteController.php:117    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                         $hours = $end->diffInMinutes($start, true);
                         $hours = $hours / 60;
                         $saved_event->hours = $hours;
-                        $saved_event->save();
+                        
                     } else {
                         // Cálculo de las horas

251) /var/www/app/Http/Controllers/EventbriteController.php:133    [M] TrueValue

--- Original
+++ New
@@ @@
                         // Cálculo de las horas
                         $start = new Carbon($new_event->start_datetime);
                         $end = new Carbon($new_event->end_datetime);
-                        $hours = $end->diffInMinutes($start, true);
+                        $hours = $end->diffInMinutes($start, false);
                         $hours = $hours / 60;
                         $new_event->hours = $hours;
                         $new_event->save();

255) /var/www/app/Http/Controllers/EventbriteController.php:137    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                         $hours = $end->diffInMinutes($start, true);
                         $hours = $hours / 60;
                         $new_event->hours = $hours;
-                        $new_event->save();
+                        
                     }
                 }
             }

256) /var/www/app/Http/Controllers/EventbriteController.php:144    [M] DecrementInteger

--- Original
+++ New
@@ @@
                     }
                 }
             }
-            $config = Configuration::find(1);
+            $config = Configuration::find(0);
             $config->events_uploaded_timestamp = Carbon::now();
             $config->save();
             return redirect()->route('registercoordinator.event.list', $instance)->with('success', 'Eventos cargados con éxito.');

257) /var/www/app/Http/Controllers/EventbriteController.php:144    [M] IncrementInteger

--- Original
+++ New
@@ @@
                     }
                 }
             }
-            $config = Configuration::find(1);
+            $config = Configuration::find(2);
             $config->events_uploaded_timestamp = Carbon::now();
             $config->save();
             return redirect()->route('registercoordinator.event.list', $instance)->with('success', 'Eventos cargados con éxito.');

258) /var/www/app/Http/Controllers/EventbriteController.php:146    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $config = Configuration::find(1);
             $config->events_uploaded_timestamp = Carbon::now();
-            $config->save();
+            
             return redirect()->route('registercoordinator.event.list', $instance)->with('success', 'Eventos cargados con éxito.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido.' . $e->getMessage());

259) /var/www/app/Http/Controllers/EventbriteController.php:151    [M] Concat

--- Original
+++ New
@@ @@
             $config->save();
             return redirect()->route('registercoordinator.event.list', $instance)->with('success', 'Eventos cargados con éxito.');
         } catch (\Exception $e) {
-            return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido.' . $e->getMessage());
+            return back()->with('error', $e->getMessage() . 'Ups, parece que hay un problema con el token. Comprueba que es válido.');
         }
     }
     public function attendee_load()

260) /var/www/app/Http/Controllers/EventbriteController.php:151    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $config->save();
             return redirect()->route('registercoordinator.event.list', $instance)->with('success', 'Eventos cargados con éxito.');
         } catch (\Exception $e) {
-            return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido.' . $e->getMessage());
+            return back()->with('error', $e->getMessage());
         }
     }
     public function attendee_load()

261) /var/www/app/Http/Controllers/EventbriteController.php:151    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $config->save();
             return redirect()->route('registercoordinator.event.list', $instance)->with('success', 'Eventos cargados con éxito.');
         } catch (\Exception $e) {
-            return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido.' . $e->getMessage());
+            return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido.');
         }
     }
     public function attendee_load()

262) /var/www/app/Http/Controllers/EventbriteController.php:155    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido.' . $e->getMessage());
         }
     }
-    public function attendee_load()
+    protected function attendee_load()
     {
         $instance = \Instantiation::instance();
         $token = \Config::eventbrite_token();

263) /var/www/app/Http/Controllers/EventbriteController.php:164    [M] LogicalNot

--- Original
+++ New
@@ @@
         $token = \Config::eventbrite_token();
         $events = Event::all();
         // PRUEBA DE CONEXIÓN CON TOKEN
-        if (!EventbriteController::validate_token($token)) {
+        if (EventbriteController::validate_token($token)) {
             return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido...');
         }
         // antes de continuar, lo más fácil y rápido es borrar las asistencias previas

264) /var/www/app/Http/Controllers/EventbriteController.php:169    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (!EventbriteController::validate_token($token)) {
             return back()->with('error', 'Ups, parece que hay un problema con el token. Comprueba que es válido...');
         }
-        // antes de continuar, lo más fácil y rápido es borrar las asistencias previas
-        DB::table('attendee')->delete();
+        
         try {
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {

266) /var/www/app/Http/Controllers/EventbriteController.php:174    [M] Foreach_

--- Original
+++ New
@@ @@
         DB::table('attendee')->delete();
         try {
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
-            foreach ($events as $event) {
+            foreach (array() as $event) {
                 // obtenemos la paginación
                 $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
                 $attendees = json_decode($attendees->getBody());

267) /var/www/app/Http/Controllers/EventbriteController.php:177    [M] Concat

--- Original
+++ New
@@ @@
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {
                 // obtenemos la paginación
-                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
+                $attendees = $client->request('GET', $event->id_eventbrite . 'events/' . '/attendees', ['query' => ['token' => $token]]);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;

268) /var/www/app/Http/Controllers/EventbriteController.php:177    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {
                 // obtenemos la paginación
-                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
+                $attendees = $client->request('GET', $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;

269) /var/www/app/Http/Controllers/EventbriteController.php:177    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {
                 // obtenemos la paginación
-                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
+                $attendees = $client->request('GET', 'events/' . '/attendees', ['query' => ['token' => $token]]);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;

270) /var/www/app/Http/Controllers/EventbriteController.php:177    [M] Concat

--- Original
+++ New
@@ @@
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {
                 // obtenemos la paginación
-                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
+                $attendees = $client->request('GET', 'events/' . '/attendees' . $event->id_eventbrite, ['query' => ['token' => $token]]);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;

271) /var/www/app/Http/Controllers/EventbriteController.php:177    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {
                 // obtenemos la paginación
-                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
+                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite, ['query' => ['token' => $token]]);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;

272) /var/www/app/Http/Controllers/EventbriteController.php:177    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {
                 // obtenemos la paginación
-                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
+                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', []);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;

273) /var/www/app/Http/Controllers/EventbriteController.php:178    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $client = new Client(['base_uri' => 'https://www.eventbriteapi.com/v3/']);
             foreach ($events as $event) {
                 // obtenemos la paginación
-                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
+                $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => []]);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;

274) /var/www/app/Http/Controllers/EventbriteController.php:184    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 $attendees = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token]]);
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
-                $page_contador = 1;
+                $page_contador = 2;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
                     $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);

275) /var/www/app/Http/Controllers/EventbriteController.php:186    [M] LessThanOrEqualTo

--- Original
+++ New
@@ @@
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;
-                while ($page_contador <= $page_count) {
+                while ($page_contador < $page_count) {
                     // obtenemos las asistencias a cada evento
                     $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());

276) /var/www/app/Http/Controllers/EventbriteController.php:186    [M] LessThanOrEqualToNegotiation

--- Original
+++ New
@@ @@
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;
-                while ($page_contador <= $page_count) {
+                while ($page_contador > $page_count) {
                     // obtenemos las asistencias a cada evento
                     $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());

277) /var/www/app/Http/Controllers/EventbriteController.php:186    [M] While_

--- Original
+++ New
@@ @@
                 $attendees = json_decode($attendees->getBody());
                 $page_count = $attendees->pagination->page_count;
                 $page_contador = 1;
-                while ($page_contador <= $page_count) {
+                while (false) {
                     // obtenemos las asistencias a cada evento
                     $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());

278) /var/www/app/Http/Controllers/EventbriteController.php:189    [M] Concat

--- Original
+++ New
@@ @@
                 $page_contador = 1;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
-                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
+                    $attendees_page = $client->request('GET', $event->id_eventbrite . 'events/' . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {

279) /var/www/app/Http/Controllers/EventbriteController.php:189    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $page_contador = 1;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
-                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
+                    $attendees_page = $client->request('GET', $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {

280) /var/www/app/Http/Controllers/EventbriteController.php:189    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $page_contador = 1;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
-                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
+                    $attendees_page = $client->request('GET', 'events/' . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {

281) /var/www/app/Http/Controllers/EventbriteController.php:189    [M] Concat

--- Original
+++ New
@@ @@
                 $page_contador = 1;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
-                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
+                    $attendees_page = $client->request('GET', 'events/' . '/attendees' . $event->id_eventbrite, ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {

282) /var/www/app/Http/Controllers/EventbriteController.php:189    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 $page_contador = 1;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
-                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
+                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite, ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {

283) /var/www/app/Http/Controllers/EventbriteController.php:189    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $page_contador = 1;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
-                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
+                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', []);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {

284) /var/www/app/Http/Controllers/EventbriteController.php:190    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $page_contador = 1;
                 while ($page_contador <= $page_count) {
                     // obtenemos las asistencias a cada evento
-                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
+                    $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {

285) /var/www/app/Http/Controllers/EventbriteController.php:194    [M] CastArray

--- Original
+++ New
@@ @@
                     // obtenemos las asistencias a cada evento
                     $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
-                    $attendees_page = (array) $attendees_page->attendees;
+                    $attendees_page = $attendees_page->attendees;
                     foreach ($attendees_page as $attendee) {
                         // limpiamos el nombre de caracteres problemáticos
                         $first_name = $attendee->profile->first_name;
