286) /var/www/app/Http/Controllers/EventbriteController.php:196    [M] Foreach_

--- Original
+++ New
@@ @@
                     $attendees_page = $client->request('GET', 'events/' . $event->id_eventbrite . '/attendees', ['query' => ['token' => $token, 'page' => $page_contador]]);
                     $attendees_page = json_decode($attendees_page->getBody());
                     $attendees_page = (array) $attendees_page->attendees;
-                    foreach ($attendees_page as $attendee) {
+                    foreach (array() as $attendee) {
                         // limpiamos el nombre de caracteres problemáticos
                         $first_name = $attendee->profile->first_name;
                         $first_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($first_name, ENT_QUOTES, 'UTF-8'))), ' '));

287) /var/www/app/Http/Controllers/EventbriteController.php:200    [M] UnwrapTrim

--- Original
+++ New
@@ @@
                     foreach ($attendees_page as $attendee) {
                         // limpiamos el nombre de caracteres problemáticos
                         $first_name = $attendee->profile->first_name;
-                        $first_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($first_name, ENT_QUOTES, 'UTF-8'))), ' '));
+                        $first_name = strtoupper(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($first_name, ENT_QUOTES, 'UTF-8'))));
                         // limpiamos los apellidos de caracteres problemáticos
                         $last_name = $attendee->profile->last_name;
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));

288) /var/www/app/Http/Controllers/EventbriteController.php:200    [M] UnwrapStrToUpper

--- Original
+++ New
@@ @@
                     foreach ($attendees_page as $attendee) {
                         // limpiamos el nombre de caracteres problemáticos
                         $first_name = $attendee->profile->first_name;
-                        $first_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($first_name, ENT_QUOTES, 'UTF-8'))), ' '));
+                        $first_name = trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($first_name, ENT_QUOTES, 'UTF-8'))), ' ');
                         // limpiamos los apellidos de caracteres problemáticos
                         $last_name = $attendee->profile->last_name;
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));

289) /var/www/app/Http/Controllers/EventbriteController.php:204    [M] UnwrapTrim

--- Original
+++ New
@@ @@
                         $first_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($first_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         // limpiamos los apellidos de caracteres problemáticos
                         $last_name = $attendee->profile->last_name;
-                        $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
+                        $last_name = strtoupper(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();

290) /var/www/app/Http/Controllers/EventbriteController.php:204    [M] UnwrapStrToUpper

--- Original
+++ New
@@ @@
                         $first_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($first_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         // limpiamos los apellidos de caracteres problemáticos
                         $last_name = $attendee->profile->last_name;
-                        $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
+                        $last_name = trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' ');
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();

291) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] Concat

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', $first_name . '%' . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

292) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

293) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

294) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] Concat

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . '%' . $first_name)->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

295) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name)->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

296) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] Concat

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', $last_name . '%' . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

297) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

298) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

299) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] Concat

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . '%' . $last_name)->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

300) /var/www/app/Http/Controllers/EventbriteController.php:209    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $last_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($last_name, ENT_QUOTES, 'UTF-8'))), ' '));
                         $status = $attendee->status;
                         $email = $attendee->profile->email;
-                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
+                        $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name)->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();

301) /var/www/app/Http/Controllers/EventbriteController.php:212    [M] AssignmentEqual

--- Original
+++ New
@@ @@
                         $email = $attendee->profile->email;
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
-                        if ($user == null) {
+                        if ($user = null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
                         }
                         // usuario encontrado

302) /var/www/app/Http/Controllers/EventbriteController.php:212    [M] Equal

--- Original
+++ New
@@ @@
                         $email = $attendee->profile->email;
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
-                        if ($user == null) {
+                        if ($user != null) {
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
                         }
                         // usuario encontrado

303) /var/www/app/Http/Controllers/EventbriteController.php:213    [M] Concat

--- Original
+++ New
@@ @@
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
-                            $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
+                            $user = DB::table('users')->where('email', 'like', $email . '%' . '%')->first();
                         }
                         // usuario encontrado
                         if ($user != null) {

304) /var/www/app/Http/Controllers/EventbriteController.php:213    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
-                            $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
+                            $user = DB::table('users')->where('email', 'like', $email . '%')->first();
                         }
                         // usuario encontrado
                         if ($user != null) {

305) /var/www/app/Http/Controllers/EventbriteController.php:213    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
-                            $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
+                            $user = DB::table('users')->where('email', 'like', '%' . '%')->first();
                         }
                         // usuario encontrado
                         if ($user != null) {

306) /var/www/app/Http/Controllers/EventbriteController.php:213    [M] Concat

--- Original
+++ New
@@ @@
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
-                            $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
+                            $user = DB::table('users')->where('email', 'like', '%' . '%' . $email)->first();
                         }
                         // usuario encontrado
                         if ($user != null) {

307) /var/www/app/Http/Controllers/EventbriteController.php:213    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                         $user = DB::table('users')->where('clean_name', 'like', '%' . $first_name . '%')->where('clean_surname', 'like', '%' . $last_name . '%')->first();
                         // si no hemos encontrado al usuario por nombres y apellidos, lo intentamos por el email
                         if ($user == null) {
-                            $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
+                            $user = DB::table('users')->where('email', 'like', '%' . $email)->first();
                         }
                         // usuario encontrado
                         if ($user != null) {

308) /var/www/app/Http/Controllers/EventbriteController.php:217    [M] NotEqual

--- Original
+++ New
@@ @@
                             $user = DB::table('users')->where('email', 'like', '%' . $email . '%')->first();
                         }
                         // usuario encontrado
-                        if ($user != null) {
+                        if ($user == null) {
                             $exits = Attendee::where("event_id", $event->id)->where("user_id", $user->id)->first();
                             if ($exits == null) {
                                 try {

309) /var/www/app/Http/Controllers/EventbriteController.php:221    [M] AssignmentEqual

--- Original
+++ New
@@ @@
                         // usuario encontrado
                         if ($user != null) {
                             $exits = Attendee::where("event_id", $event->id)->where("user_id", $user->id)->first();
-                            if ($exits == null) {
+                            if ($exits = null) {
                                 try {
                                     $new_attendee = Attendee::create(['event_id' => $event->id, 'user_id' => $user->id, 'status' => $status]);
                                     $new_attendee->save();

310) /var/www/app/Http/Controllers/EventbriteController.php:221    [M] Equal

--- Original
+++ New
@@ @@
                         // usuario encontrado
                         if ($user != null) {
                             $exits = Attendee::where("event_id", $event->id)->where("user_id", $user->id)->first();
-                            if ($exits == null) {
+                            if ($exits != null) {
                                 try {
                                     $new_attendee = Attendee::create(['event_id' => $event->id, 'user_id' => $user->id, 'status' => $status]);
                                     $new_attendee->save();

311) /var/www/app/Http/Controllers/EventbriteController.php:224    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                             $exits = Attendee::where("event_id", $event->id)->where("user_id", $user->id)->first();
                             if ($exits == null) {
                                 try {
-                                    $new_attendee = Attendee::create(['event_id' => $event->id, 'user_id' => $user->id, 'status' => $status]);
+                                    $new_attendee = Attendee::create(['user_id' => $user->id, 'status' => $status]);
                                     $new_attendee->save();
                                 } catch (\Exception $e) {
                                     echo $e;

312) /var/www/app/Http/Controllers/EventbriteController.php:225    [M] ArrayItem

--- Original
+++ New
@@ @@
                             $exits = Attendee::where("event_id", $event->id)->where("user_id", $user->id)->first();
                             if ($exits == null) {
                                 try {
-                                    $new_attendee = Attendee::create(['event_id' => $event->id, 'user_id' => $user->id, 'status' => $status]);
+                                    $new_attendee = Attendee::create(['event_id' > $event->id, 'user_id' => $user->id, 'status' => $status]);
                                     $new_attendee->save();
                                 } catch (\Exception $e) {
                                     echo $e;

313) /var/www/app/Http/Controllers/EventbriteController.php:226    [M] ArrayItem

--- Original
+++ New
@@ @@
                             $exits = Attendee::where("event_id", $event->id)->where("user_id", $user->id)->first();
                             if ($exits == null) {
                                 try {
-                                    $new_attendee = Attendee::create(['event_id' => $event->id, 'user_id' => $user->id, 'status' => $status]);
+                                    $new_attendee = Attendee::create(['event_id' => $event->id, 'user_id' > $user->id, 'status' => $status]);
                                     $new_attendee->save();
                                 } catch (\Exception $e) {
                                     echo $e;

314) /var/www/app/Http/Controllers/EventbriteController.php:229    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                             if ($exits == null) {
                                 try {
                                     $new_attendee = Attendee::create(['event_id' => $event->id, 'user_id' => $user->id, 'status' => $status]);
-                                    $new_attendee->save();
+                                    
                                 } catch (\Exception $e) {
                                     echo $e;
                                 }

315) /var/www/app/Http/Controllers/EventbriteController.php:240    [M] DecrementInteger

--- Original
+++ New
@@ @@
                             }
                         }
                     }
-                    $page_contador = $page_contador + 1;
+                    $page_contador = $page_contador + 0;
                 }
             }
             $config = Configuration::find(1);

316) /var/www/app/Http/Controllers/EventbriteController.php:240    [M] IncrementInteger

--- Original
+++ New
@@ @@
                             }
                         }
                     }
-                    $page_contador = $page_contador + 1;
+                    $page_contador = $page_contador + 2;
                 }
             }
             $config = Configuration::find(1);

317) /var/www/app/Http/Controllers/EventbriteController.php:240    [M] Plus

--- Original
+++ New
@@ @@
                             }
                         }
                     }
-                    $page_contador = $page_contador + 1;
+                    $page_contador = $page_contador - 1;
                 }
             }
             $config = Configuration::find(1);

320) /var/www/app/Http/Controllers/EventbriteController.php:248    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             $config = Configuration::find(1);
             $config->attendees_uploaded_timestamp = Carbon::now();
-            $config->save();
+            
             return redirect()->route('registercoordinator.attendee.list', $instance)->with('success', 'Asistencias actualizadas con éxito.');
         } catch (\Exception $e) {
             return back()->with('error', $e);

321) /var/www/app/Http/Controllers/EventbriteController.php:257    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return back()->with('error', $e);
         }
     }
-    public function event_list()
+    protected function event_list()
     {
         $instance = \Instantiation::instance();
         $events = Event::all();

322) /var/www/app/Http/Controllers/EventbriteController.php:263    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $events = Event::all();
-        return view('eventbrite.event_list', ['instance' => $instance, 'events' => $events]);
+        view('eventbrite.event_list', ['instance' => $instance, 'events' => $events]);
+        return null;
     }
     public function attendee_list()
     {

323) /var/www/app/Http/Controllers/EventbriteController.php:264    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $events = Event::all();
-        return view('eventbrite.event_list', ['instance' => $instance, 'events' => $events]);
+        return view('eventbrite.event_list', ['events' => $events]);
     }
     public function attendee_list()
     {
