324) /var/www/app/Http/Controllers/EventbriteController.php:267    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $events = Event::all();
         return view('eventbrite.event_list', ['instance' => $instance, 'events' => $events]);
     }
-    public function attendee_list()
+    protected function attendee_list()
     {
         $instance = \Instantiation::instance();
         $attendees = Attendee::all();

325) /var/www/app/Http/Controllers/EventbriteController.php:273    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $attendees = Attendee::all();
-        return view('eventbrite.attendee_list', ['instance' => $instance, 'attendees' => $attendees]);
+        view('eventbrite.attendee_list', ['instance' => $instance, 'attendees' => $attendees]);
+        return null;
     }
     public function attendee_export()
     {

326) /var/www/app/Http/Controllers/EventbriteController.php:274    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $attendees = Attendee::all();
-        return view('eventbrite.attendee_list', ['instance' => $instance, 'attendees' => $attendees]);
+        return view('eventbrite.attendee_list', ['attendees' => $attendees]);
     }
     public function attendee_export()
     {

327) /var/www/app/Http/Controllers/EventbriteController.php:277    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $attendees = Attendee::all();
         return view('eventbrite.attendee_list', ['instance' => $instance, 'attendees' => $attendees]);
     }
-    public function attendee_export()
+    protected function attendee_export()
     {
         try {
             // limpiar búfer de salida

328) /var/www/app/Http/Controllers/EventbriteController.php:281    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     public function attendee_export()
     {
         try {
-            // limpiar búfer de salida
-            ob_end_clean();
+            
             return Excel::download(new AttendeesExport(), 'asistencias' . \Illuminate\Support\Carbon::now() . '.xlsx');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());

329) /var/www/app/Http/Controllers/EventbriteController.php:282    [M] Concat

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new AttendeesExport(), 'asistencias' . \Illuminate\Support\Carbon::now() . '.xlsx');
+            return Excel::download(new AttendeesExport(), \Illuminate\Support\Carbon::now() . 'asistencias' . '.xlsx');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

330) /var/www/app/Http/Controllers/EventbriteController.php:282    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new AttendeesExport(), 'asistencias' . \Illuminate\Support\Carbon::now() . '.xlsx');
+            return Excel::download(new AttendeesExport(), \Illuminate\Support\Carbon::now() . '.xlsx');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

331) /var/www/app/Http/Controllers/EventbriteController.php:282    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new AttendeesExport(), 'asistencias' . \Illuminate\Support\Carbon::now() . '.xlsx');
+            return Excel::download(new AttendeesExport(), 'asistencias' . '.xlsx');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

332) /var/www/app/Http/Controllers/EventbriteController.php:282    [M] Concat

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new AttendeesExport(), 'asistencias' . \Illuminate\Support\Carbon::now() . '.xlsx');
+            return Excel::download(new AttendeesExport(), 'asistencias' . '.xlsx' . \Illuminate\Support\Carbon::now());
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

333) /var/www/app/Http/Controllers/EventbriteController.php:282    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new AttendeesExport(), 'asistencias' . \Illuminate\Support\Carbon::now() . '.xlsx');
+            return Excel::download(new AttendeesExport(), 'asistencias' . \Illuminate\Support\Carbon::now());
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

337) /var/www/app/Http/Controllers/EventbriteController.php:288    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
-    public function events_export($instance, $ext)
+    protected function events_export($instance, $ext)
     {
         try {
             ob_end_clean();

341) /var/www/app/Http/Controllers/EventbriteController.php:295    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new EventsExport(), \Illuminate\Support\Carbon::now() . 'eventos-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

342) /var/www/app/Http/Controllers/EventbriteController.php:295    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new EventsExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

343) /var/www/app/Http/Controllers/EventbriteController.php:295    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new EventsExport(), 'eventos-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

344) /var/www/app/Http/Controllers/EventbriteController.php:295    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new EventsExport(), 'eventos-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

345) /var/www/app/Http/Controllers/EventbriteController.php:295    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

346) /var/www/app/Http/Controllers/EventbriteController.php:295    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

347) /var/www/app/Http/Controllers/EventbriteController.php:295    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new EventsExport(), 'eventos-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

352) /var/www/app/Http/Controllers/EvidenceController.php:27    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('checkroles:PRESIDENT|COORDINATOR|REGISTER_COORDINATOR|SECRETARY|STUDENT');
+        
     }
     public function view($instance, $id)
     {

353) /var/www/app/Http/Controllers/EvidenceController.php:30    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->middleware('auth');
         $this->middleware('checkroles:PRESIDENT|COORDINATOR|REGISTER_COORDINATOR|SECRETARY|STUDENT');
     }
-    public function view($instance, $id)
+    protected function view($instance, $id)
     {
         $instance = \Instantiation::instance();
         $evidence = Evidence::find($id);

354) /var/www/app/Http/Controllers/EvidenceController.php:35    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $evidence = Evidence::find($id);
-        return view('evidence.view', ['instance' => $instance, 'evidence' => $evidence]);
+        view('evidence.view', ['instance' => $instance, 'evidence' => $evidence]);
+        return null;
     }
     public function list()
     {

355) /var/www/app/Http/Controllers/EvidenceController.php:36    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $evidence = Evidence::find($id);
-        return view('evidence.view', ['instance' => $instance, 'evidence' => $evidence]);
+        return view('evidence.view', ['evidence' => $evidence]);
     }
     public function list()
     {

357) /var/www/app/Http/Controllers/EvidenceController.php:41    [M] TrueValue

--- Original
+++ New
@@ @@
     }
     public function list()
     {
-        $evidences = Evidence::where(['user_id' => Auth::id(), 'last' => true])->get();
+        $evidences = Evidence::where(['user_id' => Auth::id(), 'last' => false])->get();
         $instance = \Instantiation::instance();
         $evidences = $evidences->reverse();
         return view('evidence.list', ['instance' => $instance, 'evidences' => $evidences]);

358) /var/www/app/Http/Controllers/EvidenceController.php:41    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function list()
     {
-        $evidences = Evidence::where(['user_id' => Auth::id(), 'last' => true])->get();
+        $evidences = Evidence::where(['last' => true])->get();
         $instance = \Instantiation::instance();
         $evidences = $evidences->reverse();
         return view('evidence.list', ['instance' => $instance, 'evidences' => $evidences]);

359) /var/www/app/Http/Controllers/EvidenceController.php:46    [M] FunctionCall

--- Original
+++ New
@@ @@
         $evidences = Evidence::where(['user_id' => Auth::id(), 'last' => true])->get();
         $instance = \Instantiation::instance();
         $evidences = $evidences->reverse();
-        return view('evidence.list', ['instance' => $instance, 'evidences' => $evidences]);
+        view('evidence.list', ['instance' => $instance, 'evidences' => $evidences]);
+        return null;
     }
     /****************************************************************************
      * CREATE AN EVIDENCE

360) /var/www/app/Http/Controllers/EvidenceController.php:47    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $evidences = Evidence::where(['user_id' => Auth::id(), 'last' => true])->get();
         $instance = \Instantiation::instance();
         $evidences = $evidences->reverse();
-        return view('evidence.list', ['instance' => $instance, 'evidences' => $evidences]);
+        return view('evidence.list', ['evidences' => $evidences]);
     }
     /****************************************************************************
      * CREATE AN EVIDENCE

361) /var/www/app/Http/Controllers/EvidenceController.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /****************************************************************************
      * CREATE AN EVIDENCE
      ****************************************************************************/
-    public function create()
+    protected function create()
     {
         $instance = \Instantiation::instance();
         $comittees = Comittee::all();

362) /var/www/app/Http/Controllers/EvidenceController.php:59    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $comittees = Comittee::all();
-        return view('evidence.createandedit', ['route_draft' => route('evidence.draft', $instance), 'route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
+        return view('evidence.createandedit', ['route_draft' > route('evidence.draft', $instance), 'route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
     }
     public function draft(Request $request)
     {

363) /var/www/app/Http/Controllers/EvidenceController.php:59    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $comittees = Comittee::all();
-        return view('evidence.createandedit', ['route_draft' => route('evidence.draft', $instance), 'route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
+        return view('evidence.createandedit', ['route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
     }
     public function draft(Request $request)
     {

364) /var/www/app/Http/Controllers/EvidenceController.php:59    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $comittees = Comittee::all();
-        return view('evidence.createandedit', ['route_draft' => route('evidence.draft', $instance), 'route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
+        view('evidence.createandedit', ['route_draft' => route('evidence.draft', $instance), 'route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
+        return null;
     }
     public function draft(Request $request)
     {

365) /var/www/app/Http/Controllers/EvidenceController.php:60    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $comittees = Comittee::all();
-        return view('evidence.createandedit', ['route_draft' => route('evidence.draft', $instance), 'route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
+        return view('evidence.createandedit', ['route_draft' => route('evidence.draft', $instance), 'route_publish' > route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
     }
     public function draft(Request $request)
     {

366) /var/www/app/Http/Controllers/EvidenceController.php:65    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $comittees = Comittee::all();
         return view('evidence.createandedit', ['route_draft' => route('evidence.draft', $instance), 'route_publish' => route('evidence.publish', $instance), 'instance' => $instance, 'comittees' => $comittees]);
     }
-    public function draft(Request $request)
+    protected function draft(Request $request)
     {
         return $this->new($request, "DRAFT");
     }

367) /var/www/app/Http/Controllers/EvidenceController.php:70    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->new($request, "DRAFT");
     }
-    public function publish(Request $request)
+    protected function publish(Request $request)
     {
         return $this->new($request, "PENDING");
     }

368) /var/www/app/Http/Controllers/EvidenceController.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $evidence = $this->new_evidence($request, $status);
-        $this->save_files($request, $evidence);
+        
         return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia creada con éxito.');
     }
     private function new_evidence($request, $status)

378) /var/www/app/Http/Controllers/EvidenceController.php:103    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

379) /var/www/app/Http/Controllers/EvidenceController.php:104    [M] ArrayItem

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' > $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

380) /var/www/app/Http/Controllers/EvidenceController.php:105    [M] ArrayItem

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' > $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

381) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 99 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

382) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 101 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

383) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] Multiplication

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes / 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

384) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 59) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

385) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 61) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

386) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] Division

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 * 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

387) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] RoundingFamily

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + ceil($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

388) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] RoundingFamily

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + round($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

389) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 99, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();
