390) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 101, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

391) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] Division

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) * 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

392) /var/www/app/Http/Controllers/EvidenceController.php:106    [M] Plus

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') - floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

393) /var/www/app/Http/Controllers/EvidenceController.php:108    [M] ArrayItem

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' > $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

394) /var/www/app/Http/Controllers/EvidenceController.php:109    [M] ArrayItem

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $minutes = $request->input('minutes');
         // creación de una nueva evidencia
-        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
+        $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' > $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
         $evidence->save();

395) /var/www/app/Http/Controllers/EvidenceController.php:114    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $evidence = Evidence::create(['title' => $request->input('title'), 'description' => $request->input('description'), 'hours' => $request->input('hours') + floor($minutes * 100 / 60) / 100, 'status' => $status, 'user_id' => $user->id, 'comittee_id' => $request->input('comittee')]);
         // cómputo del sello
         $evidence = \Stamp::compute_evidence($evidence);
-        $evidence->save();
+        
         return $evidence;
     }
     private function save_files($request, $evidence)

396) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = '/tmp/' . $instance . $user->username . '/' . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

397) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = '/tmp/' . $user->username . '/' . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

398) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . $user->username . '/' . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

399) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . $user->username . '/tmp/' . '/' . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

400) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . '/' . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

401) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . '/' . $user->username . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

402) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

403) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . $token . '/' . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

404) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

405) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . '/' . $token;
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

406) /var/www/app/Http/Controllers/EvidenceController.php:124    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));

407) /var/www/app/Http/Controllers/EvidenceController.php:126    [M] Foreach_

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
-        foreach (Storage::files($tmp) as $filename) {
+        foreach (array() as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);

408) /var/www/app/Http/Controllers/EvidenceController.php:129    [M] UnwrapStrToLower

--- Original
+++ New
@@ @@
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
         foreach (Storage::files($tmp) as $filename) {
             $name = pathinfo($filename, PATHINFO_FILENAME);
-            $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
+            $type = pathinfo($filename, PATHINFO_EXTENSION);
             $size = Storage::size($filename);
             $old_directory = $filename;
             $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;

409) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = '/proofs/' . $instance . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

410) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

411) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

412) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . $user->username . '/proofs/' . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

413) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

414) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . '/evidence_' . $user->username . $evidence->id . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

415) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . $evidence->id . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

416) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . $evidence->id . '/evidence_' . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

417) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . '/' . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

418) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . '/' . $evidence->id . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

419) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . $name . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

420) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . $name . '/' . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

421) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . '.' . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

422) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . '.' . $name . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

423) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . $type;
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

424) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] Concat

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . $type . '.';
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

425) /var/www/app/Http/Controllers/EvidenceController.php:132    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
             $size = Storage::size($filename);
             $old_directory = $filename;
-            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
+            $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.';
             try {
                 // movemos
                 Storage::move($old_directory, $new_directory);

426) /var/www/app/Http/Controllers/EvidenceController.php:136    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $old_directory = $filename;
             $new_directory = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '/' . $name . '.' . $type;
             try {
-                // movemos
-                Storage::move($old_directory, $new_directory);
+                
                 // almacenamos en la BBDD la información del archivo
                 $file_entity = File::create(['name' => $name, 'type' => $type, 'route' => $new_directory, 'size' => $size]);
                 // cómputo del sello

427) /var/www/app/Http/Controllers/EvidenceController.php:139    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 // movemos
                 Storage::move($old_directory, $new_directory);
                 // almacenamos en la BBDD la información del archivo
-                $file_entity = File::create(['name' => $name, 'type' => $type, 'route' => $new_directory, 'size' => $size]);
+                $file_entity = File::create(['type' => $type, 'route' => $new_directory, 'size' => $size]);
                 // cómputo del sello
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();

428) /var/www/app/Http/Controllers/EvidenceController.php:148    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $file_entity = File::create(['name' => $name, 'type' => $type, 'route' => $new_directory, 'size' => $size]);
                 // cómputo del sello
                 $file_entity = \Stamp::compute_file($file_entity);
-                $file_entity->save();
+                
                 // almacenamos en la BBDD la información de la prueba de la evidencia
                 $proof = Proof::create(['evidence_id' => $evidence->id, 'file_id' => $file_entity->id]);
             } catch (\Exception $e) {

429) /var/www/app/Http/Controllers/EvidenceController.php:151    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();
                 // almacenamos en la BBDD la información de la prueba de la evidencia
-                $proof = Proof::create(['evidence_id' => $evidence->id, 'file_id' => $file_entity->id]);
+                $proof = Proof::create(['file_id' => $file_entity->id]);
             } catch (\Exception $e) {
             }
         }

430) /var/www/app/Http/Controllers/EvidenceController.php:152    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();
                 // almacenamos en la BBDD la información de la prueba de la evidencia
-                $proof = Proof::create(['evidence_id' => $evidence->id, 'file_id' => $file_entity->id]);
+                $proof = Proof::create(['evidence_id' > $evidence->id, 'file_id' => $file_entity->id]);
             } catch (\Exception $e) {
             }
         }

431) /var/www/app/Http/Controllers/EvidenceController.php:153    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();
                 // almacenamos en la BBDD la información de la prueba de la evidencia
-                $proof = Proof::create(['evidence_id' => $evidence->id, 'file_id' => $file_entity->id]);
+                $proof = Proof::create(['evidence_id' => $evidence->id, 'file_id' > $file_entity->id]);
             } catch (\Exception $e) {
             }
         }

432) /var/www/app/Http/Controllers/EvidenceController.php:162    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             } catch (\Exception $e) {
             }
         }
-        // ya no necesitamos la carpeta temporal, la eliminamos
-        Storage::deleteDirectory($tmp);
+        
     }
     private function copy_files_into_temporary_folder($evidence)
     {

433) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = '/proofs/' . $instance . $user->username . '/evidence_' . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

434) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = '/proofs/' . $user->username . '/evidence_' . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

435) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = $instance . $user->username . '/evidence_' . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
