436) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = $instance . $user->username . '/proofs/' . '/evidence_' . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

437) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = $instance . '/proofs/' . '/evidence_' . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

438) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = $instance . '/proofs/' . '/evidence_' . $user->username . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

439) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = $instance . '/proofs/' . $user->username . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

440) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = $instance . '/proofs/' . $user->username . $evidence->id . '/evidence_';
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

441) /var/www/app/Http/Controllers/EvidenceController.php:173    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
+        $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_';
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);

442) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = '/tmp/' . $instance . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

443) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

444) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = $instance . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

445) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = $instance . $user->username . '/tmp/' . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

446) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = $instance . '/tmp/' . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

447) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = $instance . '/tmp/' . '/' . $user->username . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

448) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = $instance . '/tmp/' . $user->username . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

449) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = $instance . '/tmp/' . $user->username . $token . '/';
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

450) /var/www/app/Http/Controllers/EvidenceController.php:174    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
+        $tmp = $instance . '/tmp/' . $user->username . '/';
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;

451) /var/www/app/Http/Controllers/EvidenceController.php:176    [M] Foreach_

--- Original
+++ New
@@ @@
         $token = session()->token();
         $proofs_folder = $instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id;
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
-        foreach (Storage::files($proofs_folder) as $filename) {
+        foreach (array() as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;
             $new_directory = $tmp . '/' . $filename_basename;

452) /var/www/app/Http/Controllers/EvidenceController.php:180    [M] Concat

--- Original
+++ New
@@ @@
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
-            $old_directory = $proofs_folder . '/' . $filename_basename;
+            $old_directory = '/' . $proofs_folder . $filename_basename;
             $new_directory = $tmp . '/' . $filename_basename;
             try {
                 // copiamos

453) /var/www/app/Http/Controllers/EvidenceController.php:180    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
-            $old_directory = $proofs_folder . '/' . $filename_basename;
+            $old_directory = '/' . $filename_basename;
             $new_directory = $tmp . '/' . $filename_basename;
             try {
                 // copiamos

454) /var/www/app/Http/Controllers/EvidenceController.php:180    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
-            $old_directory = $proofs_folder . '/' . $filename_basename;
+            $old_directory = $proofs_folder . $filename_basename;
             $new_directory = $tmp . '/' . $filename_basename;
             try {
                 // copiamos

455) /var/www/app/Http/Controllers/EvidenceController.php:180    [M] Concat

--- Original
+++ New
@@ @@
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
-            $old_directory = $proofs_folder . '/' . $filename_basename;
+            $old_directory = $proofs_folder . $filename_basename . '/';
             $new_directory = $tmp . '/' . $filename_basename;
             try {
                 // copiamos

456) /var/www/app/Http/Controllers/EvidenceController.php:180    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
-            $old_directory = $proofs_folder . '/' . $filename_basename;
+            $old_directory = $proofs_folder . '/';
             $new_directory = $tmp . '/' . $filename_basename;
             try {
                 // copiamos

457) /var/www/app/Http/Controllers/EvidenceController.php:181    [M] Concat

--- Original
+++ New
@@ @@
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;
-            $new_directory = $tmp . '/' . $filename_basename;
+            $new_directory = '/' . $tmp . $filename_basename;
             try {
                 // copiamos
                 Storage::copy($old_directory, $new_directory);

458) /var/www/app/Http/Controllers/EvidenceController.php:181    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;
-            $new_directory = $tmp . '/' . $filename_basename;
+            $new_directory = '/' . $filename_basename;
             try {
                 // copiamos
                 Storage::copy($old_directory, $new_directory);

459) /var/www/app/Http/Controllers/EvidenceController.php:181    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;
-            $new_directory = $tmp . '/' . $filename_basename;
+            $new_directory = $tmp . $filename_basename;
             try {
                 // copiamos
                 Storage::copy($old_directory, $new_directory);

460) /var/www/app/Http/Controllers/EvidenceController.php:181    [M] Concat

--- Original
+++ New
@@ @@
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;
-            $new_directory = $tmp . '/' . $filename_basename;
+            $new_directory = $tmp . $filename_basename . '/';
             try {
                 // copiamos
                 Storage::copy($old_directory, $new_directory);

461) /var/www/app/Http/Controllers/EvidenceController.php:181    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         foreach (Storage::files($proofs_folder) as $filename) {
             $filename_basename = pathinfo($filename, PATHINFO_BASENAME);
             $old_directory = $proofs_folder . '/' . $filename_basename;
-            $new_directory = $tmp . '/' . $filename_basename;
+            $new_directory = $tmp . '/';
             try {
                 // copiamos
                 Storage::copy($old_directory, $new_directory);

462) /var/www/app/Http/Controllers/EvidenceController.php:185    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $old_directory = $proofs_folder . '/' . $filename_basename;
             $new_directory = $tmp . '/' . $filename_basename;
             try {
-                // copiamos
-                Storage::copy($old_directory, $new_directory);
+                
             } catch (\Exception $e) {
             }
         }

463) /var/www/app/Http/Controllers/EvidenceController.php:198    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /****************************************************************************
      * EDIT AN EVIDENCE
      ****************************************************************************/
-    public function edit($instance, $id)
+    protected function edit($instance, $id)
     {
         $user = Auth::user();
         $instance = \Instantiation::instance();

464) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] Concat

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = '/tmp/' . $instance . $user->username . '/' . $token . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

465) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = '/tmp/' . $user->username . '/' . $token . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

466) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . $user->username . '/' . $token . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

467) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] Concat

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . $user->username . '/tmp/' . '/' . $token . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

468) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . '/' . $token . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

469) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] Concat

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . '/' . $user->username . $token . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

470) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . $token . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

471) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] Concat

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . $token . '/' . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

472) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . '/';
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

473) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] Concat

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . '/' . $token;
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

474) /var/www/app/Http/Controllers/EvidenceController.php:208    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();

475) /var/www/app/Http/Controllers/EvidenceController.php:210    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $evidence = Evidence::find($id);
         $comittees = Comittee::all();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
-        Storage::deleteDirectory($tmp);
+        
         // generamos un nuevo token
         session()->regenerate();
         // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos

476) /var/www/app/Http/Controllers/EvidenceController.php:213    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $comittees = Comittee::all();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
         Storage::deleteDirectory($tmp);
-        // generamos un nuevo token
-        session()->regenerate();
+        
         // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos
         $this->copy_files_into_temporary_folder($evidence);
         return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);

477) /var/www/app/Http/Controllers/EvidenceController.php:216    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Storage::deleteDirectory($tmp);
         // generamos un nuevo token
         session()->regenerate();
-        // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos
-        $this->copy_files_into_temporary_folder($evidence);
+        
         return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
     }
     public function draft_edit(Request $request)

478) /var/www/app/Http/Controllers/EvidenceController.php:218    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         session()->regenerate();
         // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos
         $this->copy_files_into_temporary_folder($evidence);
-        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
+        return view('evidence.createandedit', ['instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
     }
     public function draft_edit(Request $request)
     {

479) /var/www/app/Http/Controllers/EvidenceController.php:218    [M] FunctionCall

--- Original
+++ New
@@ @@
         session()->regenerate();
         // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos
         $this->copy_files_into_temporary_folder($evidence);
-        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
+        view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
+        return null;
     }
     public function draft_edit(Request $request)
     {

480) /var/www/app/Http/Controllers/EvidenceController.php:220    [M] TrueValue

--- Original
+++ New
@@ @@
         session()->regenerate();
         // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos
         $this->copy_files_into_temporary_folder($evidence);
-        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
+        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => false, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
     }
     public function draft_edit(Request $request)
     {

481) /var/www/app/Http/Controllers/EvidenceController.php:221    [M] ArrayItem

--- Original
+++ New
@@ @@
         session()->regenerate();
         // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos
         $this->copy_files_into_temporary_folder($evidence);
-        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
+        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' > route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
     }
     public function draft_edit(Request $request)
     {

482) /var/www/app/Http/Controllers/EvidenceController.php:222    [M] ArrayItem

--- Original
+++ New
@@ @@
         session()->regenerate();
         // copiamos las pruebas a una carpeta temporal para poder trabajar con los mismos
         $this->copy_files_into_temporary_folder($evidence);
-        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
+        return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' > route('evidence.publish.edit', $instance)]);
     }
     public function draft_edit(Request $request)
     {

483) /var/www/app/Http/Controllers/EvidenceController.php:225    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->copy_files_into_temporary_folder($evidence);
         return view('evidence.createandedit', ['evidence' => $evidence, 'instance' => $instance, 'comittees' => $comittees, 'edit' => true, 'route_draft' => route('evidence.draft.edit', $instance), 'route_publish' => route('evidence.publish.edit', $instance)]);
     }
-    public function draft_edit(Request $request)
+    protected function draft_edit(Request $request)
     {
         return $this->save($request, "DRAFT");
     }

484) /var/www/app/Http/Controllers/EvidenceController.php:230    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         return $this->save($request, "DRAFT");
     }
-    public function publish_edit(Request $request)
+    protected function publish_edit(Request $request)
     {
         return $this->save($request, "PENDING");
     }
