485) /var/www/app/Http/Controllers/EvidenceController.php:247    [M] FalseValue

--- Original
+++ New
@@ @@
         $evidence_new = $this->new_evidence($request, $status);
         // evidencia cabecera en el flujo de ediciones (la última)
         $evidence_header = $evidence_previous->find_header_evidence();
-        $evidence_header->last = false;
+        $evidence_header->last = true;
         $evidence_header->save();
         // apuntamos al final del flujo de ediciones
         $evidence_new->points_to = $evidence_header->id;

486) /var/www/app/Http/Controllers/EvidenceController.php:248    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // evidencia cabecera en el flujo de ediciones (la última)
         $evidence_header = $evidence_previous->find_header_evidence();
         $evidence_header->last = false;
-        $evidence_header->save();
+        
         // apuntamos al final del flujo de ediciones
         $evidence_new->points_to = $evidence_header->id;
         $evidence_new->save();

487) /var/www/app/Http/Controllers/EvidenceController.php:252    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $evidence_header->save();
         // apuntamos al final del flujo de ediciones
         $evidence_new->points_to = $evidence_header->id;
-        $evidence_new->save();
+        
         // copiamos ahora los archivos de la carpeta temporal a la nueva evidencia
         $this->save_files($request, $evidence_new);
         if ($status == "DRAFT") {

488) /var/www/app/Http/Controllers/EvidenceController.php:255    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // apuntamos al final del flujo de ediciones
         $evidence_new->points_to = $evidence_header->id;
         $evidence_new->save();
-        // copiamos ahora los archivos de la carpeta temporal a la nueva evidencia
-        $this->save_files($request, $evidence_new);
+        
         if ($status == "DRAFT") {
             return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia editada con éxito.');
         } else {

489) /var/www/app/Http/Controllers/EvidenceController.php:257    [M] AssignmentEqual

--- Original
+++ New
@@ @@
         $evidence_new->save();
         // copiamos ahora los archivos de la carpeta temporal a la nueva evidencia
         $this->save_files($request, $evidence_new);
-        if ($status == "DRAFT") {
+        if ($status = "DRAFT") {
             return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia editada con éxito.');
         } else {
             return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia publicada con éxito.');

490) /var/www/app/Http/Controllers/EvidenceController.php:257    [M] Equal

--- Original
+++ New
@@ @@
         $evidence_new->save();
         // copiamos ahora los archivos de la carpeta temporal a la nueva evidencia
         $this->save_files($request, $evidence_new);
-        if ($status == "DRAFT") {
+        if ($status != "DRAFT") {
             return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia editada con éxito.');
         } else {
             return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia publicada con éxito.');

491) /var/www/app/Http/Controllers/EvidenceController.php:269    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /****************************************************************************
      * REMOVE AN EVIDENCE
      ****************************************************************************/
-    public function remove(Request $request)
+    protected function remove(Request $request)
     {
         $id = $request->_id;
         $evidence = Evidence::find($id);

492) /var/www/app/Http/Controllers/EvidenceController.php:276    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $id = $request->_id;
         $evidence = Evidence::find($id);
         $instance = \Instantiation::instance();
-        // eliminamos recursivamente la evidencia y todas las versiones anteriores, incluyendo archivos
-        $this->delete_evidence($evidence);
+        
         return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia borrada con éxito.');
     }
     private function delete_evidence($evidence)

493) /var/www/app/Http/Controllers/EvidenceController.php:290    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         // por si la evidencia apunta a otra anterior
         $evidence_previous = Evidence::find($evidence->points_to);
-        // eliminamos los archivos almacenados
-        $this->delete_files($evidence);
+        
         Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {

494) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] Concat

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory('/proofs/' . $instance . $user->username . '/evidence_' . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

495) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory('/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

496) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . $user->username . '/evidence_' . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

497) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] Concat

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . $user->username . '/proofs/' . '/evidence_' . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

498) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . '/proofs/' . '/evidence_' . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

499) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] Concat

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . '/proofs/' . '/evidence_' . $user->username . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

500) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . '/proofs/' . $user->username . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

501) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] Concat

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . '/proofs/' . $user->username . $evidence->id . '/evidence_' . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

502) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . '');
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

503) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] Concat

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . '' . $evidence->id);
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

504) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id);
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

505) /var/www/app/Http/Controllers/EvidenceController.php:291    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $evidence_previous = Evidence::find($evidence->points_to);
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
-        Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
+        
         $evidence->delete();
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);

506) /var/www/app/Http/Controllers/EvidenceController.php:292    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // eliminamos los archivos almacenados
         $this->delete_files($evidence);
         Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
-        $evidence->delete();
+        
         if ($evidence_previous != null) {
             $this->delete_evidence($evidence_previous);
         }

507) /var/www/app/Http/Controllers/EvidenceController.php:294    [M] NotEqual

--- Original
+++ New
@@ @@
         $this->delete_files($evidence);
         Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
         $evidence->delete();
-        if ($evidence_previous != null) {
+        if ($evidence_previous == null) {
             $this->delete_evidence($evidence_previous);
         }
     }

508) /var/www/app/Http/Controllers/EvidenceController.php:296    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Storage::deleteDirectory($instance . '/proofs/' . $user->username . '/evidence_' . $evidence->id . '');
         $evidence->delete();
         if ($evidence_previous != null) {
-            $this->delete_evidence($evidence_previous);
+            
         }
     }
     private function delete_files($evidence)

509) /var/www/app/Http/Controllers/EvidenceController.php:302    [M] Foreach_

--- Original
+++ New
@@ @@
     }
     private function delete_files($evidence)
     {
-        foreach ($evidence->proofs as $proof) {
+        foreach (array() as $proof) {
             $proof->file->delete();
         }
     }

510) /var/www/app/Http/Controllers/EvidenceController.php:304    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function delete_files($evidence)
     {
         foreach ($evidence->proofs as $proof) {
-            $proof->file->delete();
+            
         }
     }
     /****************************************************************************

511) /var/www/app/Http/Controllers/EvidenceController.php:312    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /****************************************************************************
      * REEDIT AN EVIDENCE
      ****************************************************************************/
-    public function reedit(Request $request)
+    protected function reedit(Request $request)
     {
         $id = $request->_id;
         $evidence = Evidence::find($id);

512) /var/www/app/Http/Controllers/EvidenceController.php:320    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $evidence = Evidence::find($id);
         $instance = \Instantiation::instance();
         $evidence->status = "DRAFT";
-        $evidence->save();
+        
         return redirect()->route('evidence.list', $instance)->with('success', 'Evidencia reasignada como borrador con éxito.');
     }
     public function export($instance, $ext)

517) /var/www/app/Http/Controllers/EvidenceController.php:333    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyEvidencesExport(), \Illuminate\Support\Carbon::now() . 'misevidencias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

518) /var/www/app/Http/Controllers/EvidenceController.php:333    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyEvidencesExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

519) /var/www/app/Http/Controllers/EvidenceController.php:333    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

520) /var/www/app/Http/Controllers/EvidenceController.php:333    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

521) /var/www/app/Http/Controllers/EvidenceController.php:333    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

522) /var/www/app/Http/Controllers/EvidenceController.php:333    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

523) /var/www/app/Http/Controllers/EvidenceController.php:333    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyEvidencesExport(), 'misevidencias-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

528) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:18    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('checkroles:COORDINATOR|SECRETARY');
+        
     }
     /****************************************************************************
      * MANAGE EVIDENCES

529) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /****************************************************************************
      * MANAGE EVIDENCES
      ****************************************************************************/
-    public function all()
+    protected function all()
     {
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;

530) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:31    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_not_draft()->paginate(10);
+        $evidences = $comittee->evidences_not_draft()->paginate(9);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'all']);
     }
     public function pending()

531) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:31    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_not_draft()->paginate(10);
+        $evidences = $comittee->evidences_not_draft()->paginate(11);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'all']);
     }
     public function pending()

532) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:33    [M] FunctionCall

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_not_draft()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'all']);
+        view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'all']);
+        return null;
     }
     public function pending()
     {

533) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:34    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_not_draft()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'all']);
+        return view('evidence.coordinator.list', ['evidences' => $evidences, 'type' => 'all']);
     }
     public function pending()
     {

534) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:37    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $evidences = $comittee->evidences_not_draft()->paginate(10);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'all']);
     }
-    public function pending()
+    protected function pending()
     {
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;

535) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:43    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_pending()->paginate(10);
+        $evidences = $comittee->evidences_pending()->paginate(9);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'pending']);
     }
     public function accepted()

536) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:43    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_pending()->paginate(10);
+        $evidences = $comittee->evidences_pending()->paginate(11);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'pending']);
     }
     public function accepted()

537) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:45    [M] FunctionCall

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_pending()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'pending']);
+        view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'pending']);
+        return null;
     }
     public function accepted()
     {

538) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:46    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_pending()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'pending']);
+        return view('evidence.coordinator.list', ['evidences' => $evidences, 'type' => 'pending']);
     }
     public function accepted()
     {

539) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:49    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $evidences = $comittee->evidences_pending()->paginate(10);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'pending']);
     }
-    public function accepted()
+    protected function accepted()
     {
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;

540) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:55    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_accepted()->paginate(10);
+        $evidences = $comittee->evidences_accepted()->paginate(9);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'accepted']);
     }
     public function rejected()

541) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:55    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_accepted()->paginate(10);
+        $evidences = $comittee->evidences_accepted()->paginate(11);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'accepted']);
     }
     public function rejected()

542) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:57    [M] FunctionCall

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_accepted()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'accepted']);
+        view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'accepted']);
+        return null;
     }
     public function rejected()
     {

543) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_accepted()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'accepted']);
+        return view('evidence.coordinator.list', ['evidences' => $evidences, 'type' => 'accepted']);
     }
     public function rejected()
     {

544) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $evidences = $comittee->evidences_accepted()->paginate(10);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'accepted']);
     }
-    public function rejected()
+    protected function rejected()
     {
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;

545) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:67    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_rejected()->paginate(10);
+        $evidences = $comittee->evidences_rejected()->paginate(9);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'rejected']);
     }
     public function accept($instance, $id)
