546) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:67    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
-        $evidences = $comittee->evidences_rejected()->paginate(10);
+        $evidences = $comittee->evidences_rejected()->paginate(11);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'rejected']);
     }
     public function accept($instance, $id)

547) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:69    [M] FunctionCall

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_rejected()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'rejected']);
+        view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'rejected']);
+        return null;
     }
     public function accept($instance, $id)
     {

548) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:70    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $coordinator = Auth::user()->coordinator;
         $comittee = $coordinator->comittee;
         $evidences = $comittee->evidences_rejected()->paginate(10);
-        return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'rejected']);
+        return view('evidence.coordinator.list', ['evidences' => $evidences, 'type' => 'rejected']);
     }
     public function accept($instance, $id)
     {

549) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:73    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $evidences = $comittee->evidences_rejected()->paginate(10);
         return view('evidence.coordinator.list', ['instance' => $instance, 'evidences' => $evidences, 'type' => 'rejected']);
     }
-    public function accept($instance, $id)
+    protected function accept($instance, $id)
     {
         $instance = \Instantiation::instance();
         $evidence = Evidence::find($id);

550) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:79    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $evidence = Evidence::find($id);
         $evidence->status = 'ACCEPTED';
-        $evidence->save();
+        
         return redirect()->route('coordinator.evidence.list.accepted', $instance)->with('success', 'Evidencia aceptada con éxito.');
     }
     public function reject(Request $request)

551) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:84    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $evidence->save();
         return redirect()->route('coordinator.evidence.list.accepted', $instance)->with('success', 'Evidencia aceptada con éxito.');
     }
-    public function reject(Request $request)
+    protected function reject(Request $request)
     {
         $instance = \Instantiation::instance();
         $evidence = Evidence::find($request->_id);

552) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $evidence = Evidence::find($request->_id);
         $evidence->status = 'REJECTED';
-        $evidence->save();
+        
         $reasonrejection = ReasonRejection::create(['reason' => $request->input('reasonrejection'), 'evidence_id' => $evidence->id]);
         $reasonrejection->save();
         return redirect()->route('coordinator.evidence.list.rejected', $instance)->with('success', 'Evidencia rechazada con éxito.');

553) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:92    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $evidence = Evidence::find($request->_id);
         $evidence->status = 'REJECTED';
         $evidence->save();
-        $reasonrejection = ReasonRejection::create(['reason' => $request->input('reasonrejection'), 'evidence_id' => $evidence->id]);
+        $reasonrejection = ReasonRejection::create(['evidence_id' => $evidence->id]);
         $reasonrejection->save();
         return redirect()->route('coordinator.evidence.list.rejected', $instance)->with('success', 'Evidencia rechazada con éxito.');
     }

554) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:93    [M] ArrayItem

--- Original
+++ New
@@ @@
         $evidence = Evidence::find($request->_id);
         $evidence->status = 'REJECTED';
         $evidence->save();
-        $reasonrejection = ReasonRejection::create(['reason' => $request->input('reasonrejection'), 'evidence_id' => $evidence->id]);
+        $reasonrejection = ReasonRejection::create(['reason' > $request->input('reasonrejection'), 'evidence_id' => $evidence->id]);
         $reasonrejection->save();
         return redirect()->route('coordinator.evidence.list.rejected', $instance)->with('success', 'Evidencia rechazada con éxito.');
     }

555) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:94    [M] ArrayItem

--- Original
+++ New
@@ @@
         $evidence = Evidence::find($request->_id);
         $evidence->status = 'REJECTED';
         $evidence->save();
-        $reasonrejection = ReasonRejection::create(['reason' => $request->input('reasonrejection'), 'evidence_id' => $evidence->id]);
+        $reasonrejection = ReasonRejection::create(['reason' => $request->input('reasonrejection'), 'evidence_id' > $evidence->id]);
         $reasonrejection->save();
         return redirect()->route('coordinator.evidence.list.rejected', $instance)->with('success', 'Evidencia rechazada con éxito.');
     }

556) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:96    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $evidence->status = 'REJECTED';
         $evidence->save();
         $reasonrejection = ReasonRejection::create(['reason' => $request->input('reasonrejection'), 'evidence_id' => $evidence->id]);
-        $reasonrejection->save();
+        
         return redirect()->route('coordinator.evidence.list.rejected', $instance)->with('success', 'Evidencia rechazada con éxito.');
     }
     public function evidences_export($instance, $type, $ext)

557) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:101    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $reasonrejection->save();
         return redirect()->route('coordinator.evidence.list.rejected', $instance)->with('success', 'Evidencia rechazada con éxito.');
     }
-    public function evidences_export($instance, $type, $ext)
+    protected function evidences_export($instance, $type, $ext)
     {
         try {
             ob_end_clean();

561) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:108    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new CoordinatorEvidencesExport($type), \Illuminate\Support\Carbon::now() . 'eventos-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

562) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:108    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new CoordinatorEvidencesExport($type), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

563) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:108    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

564) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:108    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

565) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:108    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

566) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:108    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

567) /var/www/app/Http/Controllers/EvidenceCoordinatorController.php:108    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new CoordinatorEvidencesExport($type), 'eventos-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

571) /var/www/app/Http/Controllers/FileController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Support\Facades\Storage;
 class FileController extends Controller
 {
-    public function remove(Request $request)
+    protected function remove(Request $request)
     {
         $id = $request->_id;
         $file = File::find($id);

572) /var/www/app/Http/Controllers/FileController.php:16    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $id = $request->_id;
         $file = File::find($id);
-        Storage::delete($file->route);
+        
         $file->delete();
     }
 }

573) /var/www/app/Http/Controllers/FileController.php:17    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $id = $request->_id;
         $file = File::find($id);
         Storage::delete($file->route);
-        $file->delete();
+        
     }
 }

575) /var/www/app/Http/Controllers/GeneralPurposeController.php:16    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
     }
-    public function users_all()
+    protected function users_all()
     {
         return User::all();
     }
 }

576) /var/www/app/Http/Controllers/GitController.php:10    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use GuzzleHttp\Client;
 class GitController extends Controller
 {
-    public function list()
+    protected function list()
     {
         try {
             $token = 222;

577) /var/www/app/Http/Controllers/GitController.php:15    [M] DecrementInteger

--- Original
+++ New
@@ @@
     public function list()
     {
         try {
-            $token = 222;
+            $token = 221;
             $headers = ['Accept' => 'application/vnd.github.v3+json'];
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES

578) /var/www/app/Http/Controllers/GitController.php:15    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function list()
     {
         try {
-            $token = 222;
+            $token = 223;
             $headers = ['Accept' => 'application/vnd.github.v3+json'];
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES

579) /var/www/app/Http/Controllers/GitController.php:17    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         try {
             $token = 222;
-            $headers = ['Accept' => 'application/vnd.github.v3+json'];
+            $headers = [];
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES
             $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);

580) /var/www/app/Http/Controllers/GitController.php:21    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             $token = 222;
             $headers = ['Accept' => 'application/vnd.github.v3+json'];
-            $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
+            $client = new Client(['base_uri' => 'https://api.github.com/']);
             // RELEASES
             $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
             if ($releases->getStatusCode() == 403) {

581) /var/www/app/Http/Controllers/GitController.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $headers = ['Accept' => 'application/vnd.github.v3+json'];
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES
-            $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
+            $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', []);
             if ($releases->getStatusCode() == 403) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }

582) /var/www/app/Http/Controllers/GitController.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $headers = ['Accept' => 'application/vnd.github.v3+json'];
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES
-            $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
+            $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => []]);
             if ($releases->getStatusCode() == 403) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }

583) /var/www/app/Http/Controllers/GitController.php:31    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES
             $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
-            if ($releases->getStatusCode() == 403) {
+            if ($releases->getStatusCode() == 402) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $releases = json_decode($releases->getBody());

584) /var/www/app/Http/Controllers/GitController.php:31    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES
             $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
-            if ($releases->getStatusCode() == 403) {
+            if ($releases->getStatusCode() == 404) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $releases = json_decode($releases->getBody());

585) /var/www/app/Http/Controllers/GitController.php:31    [M] Equal

--- Original
+++ New
@@ @@
             $client = new Client(['headers' => $headers, 'base_uri' => 'https://api.github.com/']);
             // RELEASES
             $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
-            if ($releases->getStatusCode() == 403) {
+            if ($releases->getStatusCode() != 403) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $releases = json_decode($releases->getBody());

586) /var/www/app/Http/Controllers/GitController.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             // RELEASES
             $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
             if ($releases->getStatusCode() == 403) {
-                return view('updates.list_error', ['instance' => \Instantiation::instance()]);
+                return view('updates.list_error', []);
             }
             $releases = json_decode($releases->getBody());
             $releases = (array) $releases;

587) /var/www/app/Http/Controllers/GitController.php:32    [M] FunctionCall

--- Original
+++ New
@@ @@
             // RELEASES
             $releases = $client->request('GET', 'repos/drorganvidez/evidentia/releases', ['query' => ['token' => $token]]);
             if ($releases->getStatusCode() == 403) {
-                return view('updates.list_error', ['instance' => \Instantiation::instance()]);
+                view('updates.list_error', ['instance' => \Instantiation::instance()]);
+                return null;
             }
             $releases = json_decode($releases->getBody());
             $releases = (array) $releases;

588) /var/www/app/Http/Controllers/GitController.php:36    [M] CastArray

--- Original
+++ New
@@ @@
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $releases = json_decode($releases->getBody());
-            $releases = (array) $releases;
+            $releases = $releases;
             //  ISSUES
             $issues = $client->request('GET', 'repos/drorganvidez/evidentia/issues');
             if ($issues->getStatusCode() == 403) {

589) /var/www/app/Http/Controllers/GitController.php:41    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $releases = (array) $releases;
             //  ISSUES
             $issues = $client->request('GET', 'repos/drorganvidez/evidentia/issues');
-            if ($issues->getStatusCode() == 403) {
+            if ($issues->getStatusCode() == 402) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $issues = json_decode($issues->getBody());

590) /var/www/app/Http/Controllers/GitController.php:41    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $releases = (array) $releases;
             //  ISSUES
             $issues = $client->request('GET', 'repos/drorganvidez/evidentia/issues');
-            if ($issues->getStatusCode() == 403) {
+            if ($issues->getStatusCode() == 404) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $issues = json_decode($issues->getBody());

591) /var/www/app/Http/Controllers/GitController.php:41    [M] Equal

--- Original
+++ New
@@ @@
             $releases = (array) $releases;
             //  ISSUES
             $issues = $client->request('GET', 'repos/drorganvidez/evidentia/issues');
-            if ($issues->getStatusCode() == 403) {
+            if ($issues->getStatusCode() != 403) {
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $issues = json_decode($issues->getBody());

592) /var/www/app/Http/Controllers/GitController.php:42    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             //  ISSUES
             $issues = $client->request('GET', 'repos/drorganvidez/evidentia/issues');
             if ($issues->getStatusCode() == 403) {
-                return view('updates.list_error', ['instance' => \Instantiation::instance()]);
+                return view('updates.list_error', []);
             }
             $issues = json_decode($issues->getBody());
             $issues = (array) $issues;

593) /var/www/app/Http/Controllers/GitController.php:42    [M] FunctionCall

--- Original
+++ New
@@ @@
             //  ISSUES
             $issues = $client->request('GET', 'repos/drorganvidez/evidentia/issues');
             if ($issues->getStatusCode() == 403) {
-                return view('updates.list_error', ['instance' => \Instantiation::instance()]);
+                view('updates.list_error', ['instance' => \Instantiation::instance()]);
+                return null;
             }
             $issues = json_decode($issues->getBody());
             $issues = (array) $issues;

594) /var/www/app/Http/Controllers/GitController.php:46    [M] CastArray

--- Original
+++ New
@@ @@
                 return view('updates.list_error', ['instance' => \Instantiation::instance()]);
             }
             $issues = json_decode($issues->getBody());
-            $issues = (array) $issues;
+            $issues = $issues;
             return view('updates.list', ['instance' => \Instantiation::instance(), 'releases' => $releases, 'issues' => $issues]);
         } catch (\Exception $e) {
             return view('updates.list_error', ['instance' => \Instantiation::instance()]);

595) /var/www/app/Http/Controllers/GitController.php:48    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             $issues = json_decode($issues->getBody());
             $issues = (array) $issues;
-            return view('updates.list', ['instance' => \Instantiation::instance(), 'releases' => $releases, 'issues' => $issues]);
+            return view('updates.list', ['releases' => $releases, 'issues' => $issues]);
         } catch (\Exception $e) {
             return view('updates.list_error', ['instance' => \Instantiation::instance()]);
         }
     }
 }

596) /var/www/app/Http/Controllers/GitController.php:48    [M] FunctionCall

--- Original
+++ New
@@ @@
             }
             $issues = json_decode($issues->getBody());
             $issues = (array) $issues;
-            return view('updates.list', ['instance' => \Instantiation::instance(), 'releases' => $releases, 'issues' => $issues]);
+            view('updates.list', ['instance' => \Instantiation::instance(), 'releases' => $releases, 'issues' => $issues]);
+            return null;
         } catch (\Exception $e) {
             return view('updates.list_error', ['instance' => \Instantiation::instance()]);
         }
     }
 }

597) /var/www/app/Http/Controllers/GitController.php:52    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $issues = (array) $issues;
             return view('updates.list', ['instance' => \Instantiation::instance(), 'releases' => $releases, 'issues' => $issues]);
         } catch (\Exception $e) {
-            return view('updates.list_error', ['instance' => \Instantiation::instance()]);
+            return view('updates.list_error', []);
         }
     }
 }

598) /var/www/app/Http/Controllers/GitController.php:52    [M] FunctionCall

--- Original
+++ New
@@ @@
             $issues = (array) $issues;
             return view('updates.list', ['instance' => \Instantiation::instance(), 'releases' => $releases, 'issues' => $issues]);
         } catch (\Exception $e) {
-            return view('updates.list_error', ['instance' => \Instantiation::instance()]);
+            view('updates.list_error', ['instance' => \Instantiation::instance()]);
+            return null;
         }
     }
 }

601) /var/www/app/Http/Controllers/HomeController.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function index()
     {
         $instance = \Instantiation::instance();
-        return view('home', ['instance' => $instance]);
+        return view('home', []);
     }
 }

602) /var/www/app/Http/Controllers/HomeController.php:28    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function index()
     {
         $instance = \Instantiation::instance();
-        return view('home', ['instance' => $instance]);
+        view('home', ['instance' => $instance]);
+        return null;
     }
 }

605) /var/www/app/Http/Controllers/ImportExportController.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->middleware('auth');
         $this->middleware('checkroles:LECTURE|PRESIDENT');
     }
-    public function import()
+    protected function import()
     {
         $instance = \Instantiation::instance();
         $route = route('lecture.import.save', $instance);

606) /var/www/app/Http/Controllers/ImportExportController.php:29    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('lecture.import.save', $instance);
-        return view('importexport.import', ['instance' => $instance, 'route' => $route]);
+        view('importexport.import', ['instance' => $instance, 'route' => $route]);
+        return null;
     }
     public function import_save(Request $request)
     {

607) /var/www/app/Http/Controllers/ImportExportController.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('lecture.import.save', $instance);
-        return view('importexport.import', ['instance' => $instance, 'route' => $route]);
+        return view('importexport.import', ['route' => $route]);
     }
     public function import_save(Request $request)
     {

608) /var/www/app/Http/Controllers/ImportExportController.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $route = route('lecture.import.save', $instance);
         return view('importexport.import', ['instance' => $instance, 'route' => $route]);
     }
-    public function import_save(Request $request)
+    protected function import_save(Request $request)
     {
         $user = Auth::user();
         $instance = \Instantiation::instance();

620) /var/www/app/Http/Controllers/ImportExportController.php:41    [M] Foreach_

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
         try {
-            foreach (Storage::files($tmp) as $filename) {
+            foreach (array() as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
                 $path = $tmp . $name . "." . $type;

622) /var/www/app/Http/Controllers/ImportExportController.php:44    [M] Concat

--- Original
+++ New
@@ @@
             foreach (Storage::files($tmp) as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
-                $path = $tmp . $name . "." . $type;
+                $path = $name . $tmp . "." . $type;
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);
