623) /var/www/app/Http/Controllers/ImportExportController.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             foreach (Storage::files($tmp) as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
-                $path = $tmp . $name . "." . $type;
+                $path = $name . "." . $type;
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);

624) /var/www/app/Http/Controllers/ImportExportController.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             foreach (Storage::files($tmp) as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
-                $path = $tmp . $name . "." . $type;
+                $path = $tmp . "." . $type;
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);

625) /var/www/app/Http/Controllers/ImportExportController.php:44    [M] Concat

--- Original
+++ New
@@ @@
             foreach (Storage::files($tmp) as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
-                $path = $tmp . $name . "." . $type;
+                $path = $tmp . "." . $name . $type;
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);

626) /var/www/app/Http/Controllers/ImportExportController.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             foreach (Storage::files($tmp) as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
-                $path = $tmp . $name . "." . $type;
+                $path = $tmp . $name . $type;
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);

627) /var/www/app/Http/Controllers/ImportExportController.php:44    [M] Concat

--- Original
+++ New
@@ @@
             foreach (Storage::files($tmp) as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
-                $path = $tmp . $name . "." . $type;
+                $path = $tmp . $name . $type . ".";
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);

628) /var/www/app/Http/Controllers/ImportExportController.php:44    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             foreach (Storage::files($tmp) as $filename) {
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
-                $path = $tmp . $name . "." . $type;
+                $path = $tmp . $name . ".";
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);

629) /var/www/app/Http/Controllers/ImportExportController.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $name = pathinfo($filename, PATHINFO_FILENAME);
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
                 $path = $tmp . $name . "." . $type;
-                Excel::import(new UsersImport(), $path);
+                
                 $this->set_student_rol();
                 Storage::delete($path);
                 break;

630) /var/www/app/Http/Controllers/ImportExportController.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $type = strtolower(pathinfo($filename, PATHINFO_EXTENSION));
                 $path = $tmp . $name . "." . $type;
                 Excel::import(new UsersImport(), $path);
-                $this->set_student_rol();
+                
                 Storage::delete($path);
                 break;
             }

631) /var/www/app/Http/Controllers/ImportExportController.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $path = $tmp . $name . "." . $type;
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
-                Storage::delete($path);
+                
                 break;
             }
         } catch (\Exception $e) {

632) /var/www/app/Http/Controllers/ImportExportController.php:50    [M] Break_

--- Original
+++ New
@@ @@
                 Excel::import(new UsersImport(), $path);
                 $this->set_student_rol();
                 Storage::delete($path);
-                break;
+                continue;
             }
         } catch (\Exception $e) {
             return redirect()->route('lecture.import', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());

633) /var/www/app/Http/Controllers/ImportExportController.php:54    [M] Concat

--- Original
+++ New
@@ @@
                 break;
             }
         } catch (\Exception $e) {
-            return redirect()->route('lecture.import', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return redirect()->route('lecture.import', $instance)->with('error', $e->getMessage() . 'Ocurrió un error: ');
         }
         return redirect()->route('lecture.user.list', $instance)->with('success', 'Alumnos importados con éxito');
     }

634) /var/www/app/Http/Controllers/ImportExportController.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 break;
             }
         } catch (\Exception $e) {
-            return redirect()->route('lecture.import', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return redirect()->route('lecture.import', $instance)->with('error', $e->getMessage());
         }
         return redirect()->route('lecture.user.list', $instance)->with('success', 'Alumnos importados con éxito');
     }

635) /var/www/app/Http/Controllers/ImportExportController.php:54    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 break;
             }
         } catch (\Exception $e) {
-            return redirect()->route('lecture.import', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return redirect()->route('lecture.import', $instance)->with('error', 'Ocurrió un error: ');
         }
         return redirect()->route('lecture.user.list', $instance)->with('success', 'Alumnos importados con éxito');
     }

636) /var/www/app/Http/Controllers/ImportExportController.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('lecture.user.list', $instance)->with('success', 'Alumnos importados con éxito');
     }
-    public function set_student_rol()
+    protected function set_student_rol()
     {
         $users = User::all();
         foreach ($users as $user) {

637) /var/www/app/Http/Controllers/ImportExportController.php:64    [M] Foreach_

--- Original
+++ New
@@ @@
     public function set_student_rol()
     {
         $users = User::all();
-        foreach ($users as $user) {
+        foreach (array() as $user) {
             // si un usuario no tiene roles es que se acaba de importar
             if ($user->roles->isEmpty()) {
                 $student_role = Role::where('rol', 'STUDENT')->get();

638) /var/www/app/Http/Controllers/ImportExportController.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // si un usuario no tiene roles es que se acaba de importar
             if ($user->roles->isEmpty()) {
                 $student_role = Role::where('rol', 'STUDENT')->get();
-                $user->roles()->attach($student_role);
+                
             }
         }
     }

639) /var/www/app/Http/Controllers/ImportExportController.php:74    [M] PublicVisibility

--- Original
+++ New
@@ @@
             }
         }
     }
-    public function export()
+    protected function export()
     {
         $instance = \Instantiation::instance();
         $route = route('lecture.export.save', $instance);

640) /var/www/app/Http/Controllers/ImportExportController.php:79    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('lecture.export.save', $instance);
-        return view('importexport.export', ['instance' => $instance, 'route' => $route]);
+        view('importexport.export', ['instance' => $instance, 'route' => $route]);
+        return null;
     }
     public function export_save(Request $request)
     {

641) /var/www/app/Http/Controllers/ImportExportController.php:80    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('lecture.export.save', $instance);
-        return view('importexport.export', ['instance' => $instance, 'route' => $route]);
+        return view('importexport.export', ['route' => $route]);
     }
     public function export_save(Request $request)
     {

642) /var/www/app/Http/Controllers/ImportExportController.php:83    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $route = route('lecture.export.save', $instance);
         return view('importexport.export', ['instance' => $instance, 'route' => $route]);
     }
-    public function export_save(Request $request)
+    protected function export_save(Request $request)
     {
         $instance = \Instantiation::instance();
         $evidences_select = $request->input('evidences');

644) /var/www/app/Http/Controllers/ImportExportController.php:94    [M] Concat

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
+            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), Carbon::now() . 'evidencias' . '.xlsx');
         } catch (\Exception $e) {
             return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

645) /var/www/app/Http/Controllers/ImportExportController.php:94    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
+            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), Carbon::now() . '.xlsx');
         } catch (\Exception $e) {
             return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

646) /var/www/app/Http/Controllers/ImportExportController.php:94    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
+            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . '.xlsx');
         } catch (\Exception $e) {
             return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

647) /var/www/app/Http/Controllers/ImportExportController.php:94    [M] Concat

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
+            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . '.xlsx' . Carbon::now());
         } catch (\Exception $e) {
             return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

648) /var/www/app/Http/Controllers/ImportExportController.php:94    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             // limpiar búfer de salida
             ob_end_clean();
-            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
+            return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now());
         } catch (\Exception $e) {
             return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

649) /var/www/app/Http/Controllers/ImportExportController.php:96    [M] Concat

--- Original
+++ New
@@ @@
             ob_end_clean();
             return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
         } catch (\Exception $e) {
-            return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return redirect()->route('lecture.export', $instance)->with('error', $e->getMessage() . 'Ocurrió un error: ');
         }
     }
 }

650) /var/www/app/Http/Controllers/ImportExportController.php:96    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             ob_end_clean();
             return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
         } catch (\Exception $e) {
-            return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return redirect()->route('lecture.export', $instance)->with('error', $e->getMessage());
         }
     }
 }

651) /var/www/app/Http/Controllers/ImportExportController.php:96    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             ob_end_clean();
             return Excel::download(new EvidencesExport($evidences_select, $meetings_select, $events_select, $bonus), 'evidencias' . Carbon::now() . '.xlsx');
         } catch (\Exception $e) {
-            return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ' . $e->getMessage());
+            return redirect()->route('lecture.export', $instance)->with('error', 'Ocurrió un error: ');
         }
     }
 }

653) /var/www/app/Http/Controllers/InstanceController.php:22    [M] ArrayItem

--- Original
+++ New
@@ @@
     }
     public function create()
     {
-        return view('instances.createandedit', ['route' => route('admin.instance.new')]);
+        return view('instances.createandedit', ['route' > route('admin.instance.new')]);
     }
     public function new(Request $request)
     {

654) /var/www/app/Http/Controllers/InstanceController.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function create()
     {
-        return view('instances.createandedit', ['route' => route('admin.instance.new')]);
+        return view('instances.createandedit', []);
     }
     public function new(Request $request)
     {

655) /var/www/app/Http/Controllers/InstanceController.php:22    [M] FunctionCall

--- Original
+++ New
@@ @@
     }
     public function create()
     {
-        return view('instances.createandedit', ['route' => route('admin.instance.new')]);
+        view('instances.createandedit', ['route' => route('admin.instance.new')]);
+        return null;
     }
     public function new(Request $request)
     {

657) /var/www/app/Http/Controllers/InstanceController.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function new(Request $request)
     {
-        $validatedData = $request->validate(['name' => 'required|unique:instances', 'route' => 'required|unique:instances', 'host' => 'required', 'port' => 'required', 'database' => 'required|unique:instances', 'username' => 'required', 'password' => 'required']);
+        $validatedData = $request->validate(['route' => 'required|unique:instances', 'host' => 'required', 'port' => 'required', 'database' => 'required|unique:instances', 'username' => 'required', 'password' => 'required']);
         $instance = new Instance();
         $instance->name = $request->name;
         $instance->route = $request->route;

658) /var/www/app/Http/Controllers/InstanceController.php:47    [M] TrueValue

--- Original
+++ New
@@ @@
         $instance->database = $request->database;
         $instance->username = $request->username;
         $instance->password = $request->password;
-        $instance->active = true;
+        $instance->active = false;
         DB::connection()->getPdo()->exec("CREATE DATABASE IF NOT EXISTS `{$instance->database}`");
         DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
         \Instantiation::set($instance);

659) /var/www/app/Http/Controllers/InstanceController.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance->username = $request->username;
         $instance->password = $request->password;
         $instance->active = true;
-        DB::connection()->getPdo()->exec("CREATE DATABASE IF NOT EXISTS `{$instance->database}`");
+        
         DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
         \Instantiation::set($instance);
         try {

660) /var/www/app/Http/Controllers/InstanceController.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance->password = $request->password;
         $instance->active = true;
         DB::connection()->getPdo()->exec("CREATE DATABASE IF NOT EXISTS `{$instance->database}`");
-        DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
+        
         \Instantiation::set($instance);
         try {
             DB::connection()->getPdo();

661) /var/www/app/Http/Controllers/InstanceController.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance->active = true;
         DB::connection()->getPdo()->exec("CREATE DATABASE IF NOT EXISTS `{$instance->database}`");
         DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
-        \Instantiation::set($instance);
+        
         try {
             DB::connection()->getPdo();
             \Instantiation::migrate();

662) /var/www/app/Http/Controllers/InstanceController.php:55    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
         \Instantiation::set($instance);
         try {
-            DB::connection()->getPdo();
+            
             \Instantiation::migrate();
             Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'instance']);
         } catch (\Exception $e) {

663) /var/www/app/Http/Controllers/InstanceController.php:56    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         \Instantiation::set($instance);
         try {
             DB::connection()->getPdo();
-            \Instantiation::migrate();
+            
             Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'instance']);
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();

664) /var/www/app/Http/Controllers/InstanceController.php:57    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             DB::connection()->getPdo();
             \Instantiation::migrate();
-            Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'instance']);
+            
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");

665) /var/www/app/Http/Controllers/InstanceController.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             DB::connection()->getPdo();
             \Instantiation::migrate();
-            Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'instance']);
+            Artisan::call('db:seed', ['--database' => 'instance']);
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");

666) /var/www/app/Http/Controllers/InstanceController.php:64    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             \Instantiation::migrate();
             Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'instance']);
         } catch (\Exception $e) {
-            \Instantiation::set_default_connection();
+            
             DB::statement("DROP DATABASE `{$instance->database}`");
             return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(422);
         }

667) /var/www/app/Http/Controllers/InstanceController.php:65    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'instance']);
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
-            DB::statement("DROP DATABASE `{$instance->database}`");
+            
             return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(422);
         }
         \Instantiation::set_default_connection();

668) /var/www/app/Http/Controllers/InstanceController.php:66    [M] DecrementInteger

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");
-            return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(422);
+            return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(421);
         }
         \Instantiation::set_default_connection();
         $instance->save();

669) /var/www/app/Http/Controllers/InstanceController.php:66    [M] IncrementInteger

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");
-            return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(422);
+            return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(423);
         }
         \Instantiation::set_default_connection();
         $instance->save();

670) /var/www/app/Http/Controllers/InstanceController.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             DB::statement("DROP DATABASE `{$instance->database}`");
             return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(422);
         }
-        \Instantiation::set_default_connection();
+        
         $instance->save();
         $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);

671) /var/www/app/Http/Controllers/InstanceController.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.')->setStatusCode(422);
         }
         \Instantiation::set_default_connection();
-        $instance->save();
+        
         $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }

672) /var/www/app/Http/Controllers/InstanceController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

673) /var/www/app/Http/Controllers/InstanceController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

674) /var/www/app/Http/Controllers/InstanceController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

675) /var/www/app/Http/Controllers/InstanceController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)
