676) /var/www/app/Http/Controllers/InstanceController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

677) /var/www/app/Http/Controllers/InstanceController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

678) /var/www/app/Http/Controllers/InstanceController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . '</code>';
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

679) /var/www/app/Http/Controllers/InstanceController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . '</code>' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1');
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

680) /var/www/app/Http/Controllers/InstanceController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         }
         \Instantiation::set_default_connection();
         $instance->save();
-        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
+        $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1');
         return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
     }
     public function edit($id)

681) /var/www/app/Http/Controllers/InstanceController.php:76    [M] DecrementInteger

--- Original
+++ New
@@ @@
         \Instantiation::set_default_connection();
         $instance->save();
         $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
-        return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
+        return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(199);
     }
     public function edit($id)
     {

682) /var/www/app/Http/Controllers/InstanceController.php:76    [M] IncrementInteger

--- Original
+++ New
@@ @@
         \Instantiation::set_default_connection();
         $instance->save();
         $message = 'Instancia creada con éxito.<br><br>CREDENCIALES DE ACCESO</br>Usuario: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_USERNAME', 'profesor1') . '</code><br>Contraseña: <code style="color: white">' . env('LECTURE_NEW_INSTANCE_PASSWORD', 'profesor1') . '</code>';
-        return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(200);
+        return redirect()->route('admin.instance.manage')->with('success', $message)->setStatusCode(201);
     }
     public function edit($id)
     {

684) /var/www/app/Http/Controllers/InstanceController.php:82    [M] TrueValue

--- Original
+++ New
@@ @@
     public function edit($id)
     {
         $instance = Instance::find($id);
-        return view('instances.createandedit', ['instance' => $instance, 'edit' => true, 'route' => route('admin.instance.manage.save')]);
+        return view('instances.createandedit', ['instance' => $instance, 'edit' => false, 'route' => route('admin.instance.manage.save')]);
     }
     public function save(Request $request)
     {

685) /var/www/app/Http/Controllers/InstanceController.php:82    [M] ArrayItem

--- Original
+++ New
@@ @@
     public function edit($id)
     {
         $instance = Instance::find($id);
-        return view('instances.createandedit', ['instance' => $instance, 'edit' => true, 'route' => route('admin.instance.manage.save')]);
+        return view('instances.createandedit', ['instance' => $instance, 'edit' => true, 'route' > route('admin.instance.manage.save')]);
     }
     public function save(Request $request)
     {

686) /var/www/app/Http/Controllers/InstanceController.php:82    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function edit($id)
     {
         $instance = Instance::find($id);
-        return view('instances.createandedit', ['instance' => $instance, 'edit' => true, 'route' => route('admin.instance.manage.save')]);
+        return view('instances.createandedit', ['edit' => true, 'route' => route('admin.instance.manage.save')]);
     }
     public function save(Request $request)
     {

687) /var/www/app/Http/Controllers/InstanceController.php:82    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function edit($id)
     {
         $instance = Instance::find($id);
-        return view('instances.createandedit', ['instance' => $instance, 'edit' => true, 'route' => route('admin.instance.manage.save')]);
+        view('instances.createandedit', ['instance' => $instance, 'edit' => true, 'route' => route('admin.instance.manage.save')]);
+        return null;
     }
     public function save(Request $request)
     {

689) /var/www/app/Http/Controllers/InstanceController.php:88    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function save(Request $request)
     {
-        $validatedData = $request->validate(['name' => ['required', Rule::unique('instances')->ignore($request->_id)], 'route' => ['required', Rule::unique('instances')->ignore($request->_id)], 'host' => 'required', 'port' => 'required', 'username' => 'required', 'password' => 'required']);
+        $validatedData = $request->validate(['route' => ['required', Rule::unique('instances')->ignore($request->_id)], 'host' => 'required', 'port' => 'required', 'username' => 'required', 'password' => 'required']);
         $instance = Instance::where('id', $request->_id)->first();
         $instance->name = $request->name;
         $instance->route = $request->route;

690) /var/www/app/Http/Controllers/InstanceController.php:89    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function save(Request $request)
     {
-        $validatedData = $request->validate(['name' => ['required', Rule::unique('instances')->ignore($request->_id)], 'route' => ['required', Rule::unique('instances')->ignore($request->_id)], 'host' => 'required', 'port' => 'required', 'username' => 'required', 'password' => 'required']);
+        $validatedData = $request->validate(['name' => [Rule::unique('instances')->ignore($request->_id)], 'route' => ['required', Rule::unique('instances')->ignore($request->_id)], 'host' => 'required', 'port' => 'required', 'username' => 'required', 'password' => 'required']);
         $instance = Instance::where('id', $request->_id)->first();
         $instance->name = $request->name;
         $instance->route = $request->route;

691) /var/www/app/Http/Controllers/InstanceController.php:90    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function save(Request $request)
     {
-        $validatedData = $request->validate(['name' => ['required', Rule::unique('instances')->ignore($request->_id)], 'route' => ['required', Rule::unique('instances')->ignore($request->_id)], 'host' => 'required', 'port' => 'required', 'username' => 'required', 'password' => 'required']);
+        $validatedData = $request->validate(['name' => ['required', Rule::unique('instances')->ignore($request->_id)], 'route' => [Rule::unique('instances')->ignore($request->_id)], 'host' => 'required', 'port' => 'required', 'username' => 'required', 'password' => 'required']);
         $instance = Instance::where('id', $request->_id)->first();
         $instance->name = $request->name;
         $instance->route = $request->route;

692) /var/www/app/Http/Controllers/InstanceController.php:105    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance->port = $request->port;
         $instance->username = $request->username;
         $instance->password = $request->password;
-        \Instantiation::set($instance);
+        
         try {
             DB::connection()->getPdo();
             $instance->save();

694) /var/www/app/Http/Controllers/InstanceController.php:109    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         \Instantiation::set($instance);
         try {
             DB::connection()->getPdo();
-            $instance->save();
+            
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             return back()->withInput()->with('error', 'Conexión fallida, revise los parámetros de configuración de la base de datos.');

697) /var/www/app/Http/Controllers/InstanceController.php:122    [M] PublicVisibility

--- Original
+++ New
@@ @@
         \Instantiation::set_default_connection();
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia actualizada con éxito.');
     }
-    public function manage()
+    protected function manage()
     {
         $instances = Instance::all();
         return view('instances.manage', ['instances' => $instances]);

698) /var/www/app/Http/Controllers/InstanceController.php:127    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function manage()
     {
         $instances = Instance::all();
-        return view('instances.manage', ['instances' => $instances]);
+        return view('instances.manage', []);
     }
     public function delete($id)
     {

699) /var/www/app/Http/Controllers/InstanceController.php:127    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function manage()
     {
         $instances = Instance::all();
-        return view('instances.manage', ['instances' => $instances]);
+        view('instances.manage', ['instances' => $instances]);
+        return null;
     }
     public function delete($id)
     {

700) /var/www/app/Http/Controllers/InstanceController.php:130    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $instances = Instance::all();
         return view('instances.manage', ['instances' => $instances]);
     }
-    public function delete($id)
+    protected function delete($id)
     {
         $instance = Instance::where('id', $id)->first();
         return view('instances.delete', ['instance' => $instance]);

701) /var/www/app/Http/Controllers/InstanceController.php:133    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function delete($id)
     {
         $instance = Instance::where('id', $id)->first();
-        return view('instances.delete', ['instance' => $instance]);
+        return view('instances.delete', []);
     }
     public function remove(Request $request)
     {

702) /var/www/app/Http/Controllers/InstanceController.php:133    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function delete($id)
     {
         $instance = Instance::where('id', $id)->first();
-        return view('instances.delete', ['instance' => $instance]);
+        view('instances.delete', ['instance' => $instance]);
+        return null;
     }
     public function remove(Request $request)
     {

704) /var/www/app/Http/Controllers/InstanceController.php:140    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function remove(Request $request)
     {
         $instance = Instance::where('id', $request->id)->first();
-        $request->validate(['name' => 'in:' . $instance->name]);
+        $request->validate([]);
         DB::statement("DROP DATABASE `{$instance->database}`");
         $instance->delete();
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia eliminada con éxito.');
     }
 }

705) /var/www/app/Http/Controllers/InstanceController.php:140    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function remove(Request $request)
     {
         $instance = Instance::where('id', $request->id)->first();
-        $request->validate(['name' => 'in:' . $instance->name]);
+        
         DB::statement("DROP DATABASE `{$instance->database}`");
         $instance->delete();
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia eliminada con éxito.');
     }
 }

706) /var/www/app/Http/Controllers/InstanceController.php:141    [M] Concat

--- Original
+++ New
@@ @@
     public function remove(Request $request)
     {
         $instance = Instance::where('id', $request->id)->first();
-        $request->validate(['name' => 'in:' . $instance->name]);
+        $request->validate(['name' => $instance->name . 'in:']);
         DB::statement("DROP DATABASE `{$instance->database}`");
         $instance->delete();
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia eliminada con éxito.');
     }
 }

707) /var/www/app/Http/Controllers/InstanceController.php:141    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function remove(Request $request)
     {
         $instance = Instance::where('id', $request->id)->first();
-        $request->validate(['name' => 'in:' . $instance->name]);
+        $request->validate(['name' => $instance->name]);
         DB::statement("DROP DATABASE `{$instance->database}`");
         $instance->delete();
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia eliminada con éxito.');
     }
 }

708) /var/www/app/Http/Controllers/InstanceController.php:141    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     public function remove(Request $request)
     {
         $instance = Instance::where('id', $request->id)->first();
-        $request->validate(['name' => 'in:' . $instance->name]);
+        $request->validate(['name' => 'in:']);
         DB::statement("DROP DATABASE `{$instance->database}`");
         $instance->delete();
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia eliminada con éxito.');
     }
 }

709) /var/www/app/Http/Controllers/InstanceController.php:144    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = Instance::where('id', $request->id)->first();
         $request->validate(['name' => 'in:' . $instance->name]);
-        DB::statement("DROP DATABASE `{$instance->database}`");
+        
         $instance->delete();
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia eliminada con éxito.');
     }
 }

710) /var/www/app/Http/Controllers/InstanceController.php:146    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance = Instance::where('id', $request->id)->first();
         $request->validate(['name' => 'in:' . $instance->name]);
         DB::statement("DROP DATABASE `{$instance->database}`");
-        $instance->delete();
+        
         return redirect()->route('admin.instance.manage')->with('success', 'Instancia eliminada con éxito.');
     }
 }

712) /var/www/app/Http/Controllers/IntegrityController.php:15    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function __construct()
     {
         $this->middleware('auth');
-        $this->middleware('checkroles:LECTURE');
+        
     }
     public function integrity()
     {

713) /var/www/app/Http/Controllers/IntegrityController.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->middleware('auth');
         $this->middleware('checkroles:LECTURE');
     }
-    public function integrity()
+    protected function integrity()
     {
         $instance = \Instantiation::instance();
         $evidences = Evidence::all();

714) /var/www/app/Http/Controllers/IntegrityController.php:24    [M] FunctionCall

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $evidences = Evidence::all();
         $proofs = Proof::all();
-        return view('integrity.list', ['instance' => $instance, 'evidences' => $evidences, 'proofs' => $proofs]);
+        view('integrity.list', ['instance' => $instance, 'evidences' => $evidences, 'proofs' => $proofs]);
+        return null;
     }
 }

715) /var/www/app/Http/Controllers/IntegrityController.php:25    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $evidences = Evidence::all();
         $proofs = Proof::all();
-        return view('integrity.list', ['instance' => $instance, 'evidences' => $evidences, 'proofs' => $proofs]);
+        return view('integrity.list', ['evidences' => $evidences, 'proofs' => $proofs]);
     }
 }

735) /var/www/app/Http/Controllers/ManagementController.php:33    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $this->middleware('checkroles:LECTURE|PRESIDENT');
         $this->user_service = new UserService();
     }
-    public function user_list()
+    protected function user_list()
     {
         $instance = \Instantiation::instance();
         $users = User::all();

736) /var/www/app/Http/Controllers/ManagementController.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // el presidente no puede editar los usuarios de tipo profesor
         $filtered_users = collect();
         if (Auth::user()->hasRole('PRESIDENT')) {
-            $users->each(function ($item, $key) use($filtered_users) {
-                if (!$item->hasRole('LECTURE')) {
-                    $filtered_users->push($item);
-                }
-            });
+            
         } else {
             $filtered_users = $users;
         }

737) /var/www/app/Http/Controllers/ManagementController.php:42    [M] LogicalNot

--- Original
+++ New
@@ @@
         $filtered_users = collect();
         if (Auth::user()->hasRole('PRESIDENT')) {
             $users->each(function ($item, $key) use($filtered_users) {
-                if (!$item->hasRole('LECTURE')) {
+                if ($item->hasRole('LECTURE')) {
                     $filtered_users->push($item);
                 }
             });

738) /var/www/app/Http/Controllers/ManagementController.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (Auth::user()->hasRole('PRESIDENT')) {
             $users->each(function ($item, $key) use($filtered_users) {
                 if (!$item->hasRole('LECTURE')) {
-                    $filtered_users->push($item);
+                    
                 }
             });
         } else {

739) /var/www/app/Http/Controllers/ManagementController.php:50    [M] FunctionCall

--- Original
+++ New
@@ @@
         } else {
             $filtered_users = $users;
         }
-        return view('manage.user_list', ['instance' => $instance, 'users' => $filtered_users]);
+        view('manage.user_list', ['instance' => $instance, 'users' => $filtered_users]);
+        return null;
     }
     public function evidence_list()
     {

740) /var/www/app/Http/Controllers/ManagementController.php:51    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         } else {
             $filtered_users = $users;
         }
-        return view('manage.user_list', ['instance' => $instance, 'users' => $filtered_users]);
+        return view('manage.user_list', ['users' => $filtered_users]);
     }
     public function evidence_list()
     {

741) /var/www/app/Http/Controllers/ManagementController.php:54    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return view('manage.user_list', ['instance' => $instance, 'users' => $filtered_users]);
     }
-    public function evidence_list()
+    protected function evidence_list()
     {
         $instance = \Instantiation::instance();
         $evidences = Evidence::evidences_not_draft();

742) /var/www/app/Http/Controllers/ManagementController.php:59    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $evidences = Evidence::evidences_not_draft();
-        return view('manage.evidence_list', ['instance' => $instance, 'evidences' => $evidences]);
+        view('manage.evidence_list', ['instance' => $instance, 'evidences' => $evidences]);
+        return null;
     }
     public function meeting_list()
     {

743) /var/www/app/Http/Controllers/ManagementController.php:60    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $evidences = Evidence::evidences_not_draft();
-        return view('manage.evidence_list', ['instance' => $instance, 'evidences' => $evidences]);
+        return view('manage.evidence_list', ['evidences' => $evidences]);
     }
     public function meeting_list()
     {

744) /var/www/app/Http/Controllers/ManagementController.php:63    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $evidences = Evidence::evidences_not_draft();
         return view('manage.evidence_list', ['instance' => $instance, 'evidences' => $evidences]);
     }
-    public function meeting_list()
+    protected function meeting_list()
     {
         $instance = \Instantiation::instance();
         $meetings = Meeting::all();

745) /var/www/app/Http/Controllers/ManagementController.php:68    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meetings = Meeting::all();
-        return view('manage.meeting_list', ['instance' => $instance, 'meetings' => $meetings]);
+        view('manage.meeting_list', ['instance' => $instance, 'meetings' => $meetings]);
+        return null;
     }
     public function comittee_list()
     {

746) /var/www/app/Http/Controllers/ManagementController.php:69    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meetings = Meeting::all();
-        return view('manage.meeting_list', ['instance' => $instance, 'meetings' => $meetings]);
+        return view('manage.meeting_list', ['meetings' => $meetings]);
     }
     public function comittee_list()
     {

747) /var/www/app/Http/Controllers/ManagementController.php:72    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $meetings = Meeting::all();
         return view('manage.meeting_list', ['instance' => $instance, 'meetings' => $meetings]);
     }
-    public function comittee_list()
+    protected function comittee_list()
     {
         $instance = \Instantiation::instance();
         $comittees = Comittee::all();

748) /var/www/app/Http/Controllers/ManagementController.php:90    [M] FunctionCall

--- Original
+++ New
@@ @@
             $route_new = route('lecture.comittee.management.new', $instance);
             $route_remove = route('lecture.comittee.management.remove', $instance);
         }
-        return view('manage.comittee_list', ['instance' => $instance, 'comittees' => $comittees, 'route' => $route, 'route_new' => $route_new, 'route_remove' => $route_remove]);
+        view('manage.comittee_list', ['instance' => $instance, 'comittees' => $comittees, 'route' => $route, 'route_new' => $route_new, 'route_remove' => $route_remove]);
+        return null;
     }
     public function comittee_new(Request $request)
     {

749) /var/www/app/Http/Controllers/ManagementController.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $route_new = route('lecture.comittee.management.new', $instance);
             $route_remove = route('lecture.comittee.management.remove', $instance);
         }
-        return view('manage.comittee_list', ['instance' => $instance, 'comittees' => $comittees, 'route' => $route, 'route_new' => $route_new, 'route_remove' => $route_remove]);
+        return view('manage.comittee_list', ['comittees' => $comittees, 'route' => $route, 'route_new' => $route_new, 'route_remove' => $route_remove]);
     }
     public function comittee_new(Request $request)
     {

750) /var/www/app/Http/Controllers/ManagementController.php:94    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return view('manage.comittee_list', ['instance' => $instance, 'comittees' => $comittees, 'route' => $route, 'route_new' => $route_new, 'route_remove' => $route_remove]);
     }
-    public function comittee_new(Request $request)
+    protected function comittee_new(Request $request)
     {
         $instance = \Instantiation::instance();
         $request->validate(['icon' => 'max:255', 'name' => 'required|max:255|unique:comittees']);

751) /var/www/app/Http/Controllers/ManagementController.php:97    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function comittee_new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['icon' => 'max:255', 'name' => 'required|max:255|unique:comittees']);
+        $request->validate(['name' => 'required|max:255|unique:comittees']);
         Comittee::create(['icon' => $request->input('icon'), 'name' => $request->input('name')]);
         if (Auth::user()->hasRole('PRESIDENT')) {
             return redirect()->route('president.comittee.list', $instance)->with('success', 'Comité creado con éxito.');

752) /var/www/app/Http/Controllers/ManagementController.php:97    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function comittee_new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['icon' => 'max:255', 'name' => 'required|max:255|unique:comittees']);
+        
         Comittee::create(['icon' => $request->input('icon'), 'name' => $request->input('name')]);
         if (Auth::user()->hasRole('PRESIDENT')) {
             return redirect()->route('president.comittee.list', $instance)->with('success', 'Comité creado con éxito.');

753) /var/www/app/Http/Controllers/ManagementController.php:102    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['icon' => 'max:255', 'name' => 'required|max:255|unique:comittees']);
-        Comittee::create(['icon' => $request->input('icon'), 'name' => $request->input('name')]);
+        Comittee::create(['name' => $request->input('name')]);
         if (Auth::user()->hasRole('PRESIDENT')) {
             return redirect()->route('president.comittee.list', $instance)->with('success', 'Comité creado con éxito.');
         } else {

754) /var/www/app/Http/Controllers/ManagementController.php:102    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['icon' => 'max:255', 'name' => 'required|max:255|unique:comittees']);
-        Comittee::create(['icon' => $request->input('icon'), 'name' => $request->input('name')]);
+        
         if (Auth::user()->hasRole('PRESIDENT')) {
             return redirect()->route('president.comittee.list', $instance)->with('success', 'Comité creado con éxito.');
         } else {
