755) /var/www/app/Http/Controllers/ManagementController.php:103    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['icon' => 'max:255', 'name' => 'required|max:255|unique:comittees']);
-        Comittee::create(['icon' => $request->input('icon'), 'name' => $request->input('name')]);
+        Comittee::create(['icon' > $request->input('icon'), 'name' => $request->input('name')]);
         if (Auth::user()->hasRole('PRESIDENT')) {
             return redirect()->route('president.comittee.list', $instance)->with('success', 'Comité creado con éxito.');
         } else {

756) /var/www/app/Http/Controllers/ManagementController.php:104    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['icon' => 'max:255', 'name' => 'required|max:255|unique:comittees']);
-        Comittee::create(['icon' => $request->input('icon'), 'name' => $request->input('name')]);
+        Comittee::create(['icon' => $request->input('icon'), 'name' > $request->input('name')]);
         if (Auth::user()->hasRole('PRESIDENT')) {
             return redirect()->route('president.comittee.list', $instance)->with('success', 'Comité creado con éxito.');
         } else {

757) /var/www/app/Http/Controllers/ManagementController.php:114    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return redirect()->route('lecture.comittee.list', $instance)->with('success', 'Comité creado con éxito.');
         }
     }
-    public function comittee_save(Request $request)
+    protected function comittee_save(Request $request)
     {
         $instance = \Instantiation::instance();
         $returned_route = null;

758) /var/www/app/Http/Controllers/ManagementController.php:126    [M] Foreach_

--- Original
+++ New
@@ @@
         }
         // por sl algún usuario avispao modifica los ID en el HTML
         try {
-            foreach (Comittee::all() as $comittee) {
+            foreach (array() as $comittee) {
             }
         } catch (\Exception $e) {
             return redirect()->route($returned_route, $instance)->with('error', 'Error en la integridad de los comités.' . $e->getMessage());

759) /var/www/app/Http/Controllers/ManagementController.php:131    [M] Concat

--- Original
+++ New
@@ @@
             foreach (Comittee::all() as $comittee) {
             }
         } catch (\Exception $e) {
-            return redirect()->route($returned_route, $instance)->with('error', 'Error en la integridad de los comités.' . $e->getMessage());
+            return redirect()->route($returned_route, $instance)->with('error', $e->getMessage() . 'Error en la integridad de los comités.');
         }
         foreach (Comittee::all() as $comittee) {
             /*

760) /var/www/app/Http/Controllers/ManagementController.php:131    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             foreach (Comittee::all() as $comittee) {
             }
         } catch (\Exception $e) {
-            return redirect()->route($returned_route, $instance)->with('error', 'Error en la integridad de los comités.' . $e->getMessage());
+            return redirect()->route($returned_route, $instance)->with('error', $e->getMessage());
         }
         foreach (Comittee::all() as $comittee) {
             /*

761) /var/www/app/Http/Controllers/ManagementController.php:131    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             foreach (Comittee::all() as $comittee) {
             }
         } catch (\Exception $e) {
-            return redirect()->route($returned_route, $instance)->with('error', 'Error en la integridad de los comités.' . $e->getMessage());
+            return redirect()->route($returned_route, $instance)->with('error', 'Error en la integridad de los comités.');
         }
         foreach (Comittee::all() as $comittee) {
             /*

762) /var/www/app/Http/Controllers/ManagementController.php:134    [M] Foreach_

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
             return redirect()->route($returned_route, $instance)->with('error', 'Error en la integridad de los comités.' . $e->getMessage());
         }
-        foreach (Comittee::all() as $comittee) {
+        foreach (array() as $comittee) {
             /*
             $request->validate([
                 'icon_' . $comittee->id => 'max:255',

763) /var/www/app/Http/Controllers/ManagementController.php:143    [M] Concat

--- Original
+++ New
@@ @@
                 'name_' . $comittee->id => 'required|max:255|unique:comittees'
             ]);
             */
-            $new_icon = $request->input('icon_' . $comittee->id);
+            $new_icon = $request->input($comittee->id . 'icon_');
             $new_name = $request->input('name_' . $comittee->id);
             if ($new_name != "") {
                 $saved_comittee = Comittee::find($comittee->id);

764) /var/www/app/Http/Controllers/ManagementController.php:143    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 'name_' . $comittee->id => 'required|max:255|unique:comittees'
             ]);
             */
-            $new_icon = $request->input('icon_' . $comittee->id);
+            $new_icon = $request->input($comittee->id);
             $new_name = $request->input('name_' . $comittee->id);
             if ($new_name != "") {
                 $saved_comittee = Comittee::find($comittee->id);

765) /var/www/app/Http/Controllers/ManagementController.php:143    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 'name_' . $comittee->id => 'required|max:255|unique:comittees'
             ]);
             */
-            $new_icon = $request->input('icon_' . $comittee->id);
+            $new_icon = $request->input('icon_');
             $new_name = $request->input('name_' . $comittee->id);
             if ($new_name != "") {
                 $saved_comittee = Comittee::find($comittee->id);

766) /var/www/app/Http/Controllers/ManagementController.php:144    [M] Concat

--- Original
+++ New
@@ @@
             ]);
             */
             $new_icon = $request->input('icon_' . $comittee->id);
-            $new_name = $request->input('name_' . $comittee->id);
+            $new_name = $request->input($comittee->id . 'name_');
             if ($new_name != "") {
                 $saved_comittee = Comittee::find($comittee->id);
                 $saved_comittee->icon = $new_icon;

767) /var/www/app/Http/Controllers/ManagementController.php:144    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             ]);
             */
             $new_icon = $request->input('icon_' . $comittee->id);
-            $new_name = $request->input('name_' . $comittee->id);
+            $new_name = $request->input($comittee->id);
             if ($new_name != "") {
                 $saved_comittee = Comittee::find($comittee->id);
                 $saved_comittee->icon = $new_icon;

768) /var/www/app/Http/Controllers/ManagementController.php:144    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             ]);
             */
             $new_icon = $request->input('icon_' . $comittee->id);
-            $new_name = $request->input('name_' . $comittee->id);
+            $new_name = $request->input('name_');
             if ($new_name != "") {
                 $saved_comittee = Comittee::find($comittee->id);
                 $saved_comittee->icon = $new_icon;

769) /var/www/app/Http/Controllers/ManagementController.php:146    [M] NotEqual

--- Original
+++ New
@@ @@
             */
             $new_icon = $request->input('icon_' . $comittee->id);
             $new_name = $request->input('name_' . $comittee->id);
-            if ($new_name != "") {
+            if ($new_name == "") {
                 $saved_comittee = Comittee::find($comittee->id);
                 $saved_comittee->icon = $new_icon;
                 $saved_comittee->name = $new_name;

770) /var/www/app/Http/Controllers/ManagementController.php:152    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $saved_comittee = Comittee::find($comittee->id);
                 $saved_comittee->icon = $new_icon;
                 $saved_comittee->name = $new_name;
-                $saved_comittee->save();
+                
             }
         }
         return redirect()->route($returned_route, $instance)->with('success', 'Comités guardados con éxito.');

771) /var/www/app/Http/Controllers/ManagementController.php:159    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route($returned_route, $instance)->with('success', 'Comités guardados con éxito.');
     }
-    public function comittee_remove(Request $request)
+    protected function comittee_remove(Request $request)
     {
         $instance = \Instantiation::instance();
         $returned_route = null;

772) /var/www/app/Http/Controllers/ManagementController.php:171    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $comittee = Comittee::find($request->input('_id'));
         if ($comittee->can_be_removed()) {
-            $comittee->delete();
+            
             return redirect()->route($returned_route, $instance)->with('success', 'Comité eliminado con éxito.');
         } else {
             return redirect()->route($returned_route, $instance)->with('error', 'El comité no ha podido ser eliminado.');

773) /var/www/app/Http/Controllers/ManagementController.php:179    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return redirect()->route($returned_route, $instance)->with('error', 'El comité no ha podido ser eliminado.');
         }
     }
-    public function user_management($instance, $id)
+    protected function user_management($instance, $id)
     {
         $instance = \Instantiation::instance();
         $user = User::findOrFail($id);

774) /var/www/app/Http/Controllers/ManagementController.php:202    [M] FunctionCall

--- Original
+++ New
@@ @@
             $roles = Role::all();
         }
         $comittees = Comittee::all();
-        return view('manage.user_management', ['instance' => $instance, 'route' => $route, 'user' => $user, 'roles' => $roles, 'comittees' => $comittees]);
+        view('manage.user_management', ['instance' => $instance, 'route' => $route, 'user' => $user, 'roles' => $roles, 'comittees' => $comittees]);
+        return null;
     }
     public function user_management_save(Request $request)
     {

775) /var/www/app/Http/Controllers/ManagementController.php:203    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $roles = Role::all();
         }
         $comittees = Comittee::all();
-        return view('manage.user_management', ['instance' => $instance, 'route' => $route, 'user' => $user, 'roles' => $roles, 'comittees' => $comittees]);
+        return view('manage.user_management', ['route' => $route, 'user' => $user, 'roles' => $roles, 'comittees' => $comittees]);
     }
     public function user_management_save(Request $request)
     {

776) /var/www/app/Http/Controllers/ManagementController.php:206    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $comittees = Comittee::all();
         return view('manage.user_management', ['instance' => $instance, 'route' => $route, 'user' => $user, 'roles' => $roles, 'comittees' => $comittees]);
     }
-    public function user_management_save(Request $request)
+    protected function user_management_save(Request $request)
     {
         $instance = \Instantiation::instance();
         $user = User::find($request->input('user_id'));

777) /var/www/app/Http/Controllers/ManagementController.php:213    [M] Equal

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $user = User::find($request->input('user_id'));
         // guardar bloqueo
-        if ($request->input('pass') == 'on') {
+        if ($request->input('pass') != 'on') {
             $user->block = false;
         } else {
             $user->block = true;

778) /var/www/app/Http/Controllers/ManagementController.php:214    [M] FalseValue

--- Original
+++ New
@@ @@
         $user = User::find($request->input('user_id'));
         // guardar bloqueo
         if ($request->input('pass') == 'on') {
-            $user->block = false;
+            $user->block = true;
         } else {
             $user->block = true;
         }

779) /var/www/app/Http/Controllers/ManagementController.php:216    [M] TrueValue

--- Original
+++ New
@@ @@
         if ($request->input('pass') == 'on') {
             $user->block = false;
         } else {
-            $user->block = true;
+            $user->block = false;
         }
         $user->save();
         // aqui se cambian los roles

780) /var/www/app/Http/Controllers/ManagementController.php:218    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         } else {
             $user->block = true;
         }
-        $user->save();
+        
         // aqui se cambian los roles
         $roles_id = $request->input('roles', []);
         $comittee_id = $request->input('comittee');

781) /var/www/app/Http/Controllers/ManagementController.php:223    [M] Equal

--- Original
+++ New
@@ @@
         // aqui se cambian los roles
         $roles_id = $request->input('roles', []);
         $comittee_id = $request->input('comittee');
-        if (Comittee::find($comittee_id) == null) {
+        if (Comittee::find($comittee_id) != null) {
             return redirect()->route('lecture.user.management', ['instance' => $instance, 'id' => $user->id])->with('error', 'Comité no válido.');
         }
         // elimino toda asociación previa

782) /var/www/app/Http/Controllers/ManagementController.php:224    [M] ArrayItem

--- Original
+++ New
@@ @@
         $roles_id = $request->input('roles', []);
         $comittee_id = $request->input('comittee');
         if (Comittee::find($comittee_id) == null) {
-            return redirect()->route('lecture.user.management', ['instance' => $instance, 'id' => $user->id])->with('error', 'Comité no válido.');
+            return redirect()->route('lecture.user.management', ['instance' => $instance, 'id' > $user->id])->with('error', 'Comité no válido.');
         }
         // elimino toda asociación previa
         DB::table('coordinators')->where(['user_id' => $user->id])->delete();

783) /var/www/app/Http/Controllers/ManagementController.php:224    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $roles_id = $request->input('roles', []);
         $comittee_id = $request->input('comittee');
         if (Comittee::find($comittee_id) == null) {
-            return redirect()->route('lecture.user.management', ['instance' => $instance, 'id' => $user->id])->with('error', 'Comité no válido.');
+            return redirect()->route('lecture.user.management', ['id' => $user->id])->with('error', 'Comité no válido.');
         }
         // elimino toda asociación previa
         DB::table('coordinators')->where(['user_id' => $user->id])->delete();

784) /var/www/app/Http/Controllers/ManagementController.php:228    [M] ArrayItem

--- Original
+++ New
@@ @@
             return redirect()->route('lecture.user.management', ['instance' => $instance, 'id' => $user->id])->with('error', 'Comité no válido.');
         }
         // elimino toda asociación previa
-        DB::table('coordinators')->where(['user_id' => $user->id])->delete();
+        DB::table('coordinators')->where(['user_id' > $user->id])->delete();
         DB::table('secretaries')->where(['user_id' => $user->id])->delete();
         // elimino roles anteriores
         $user->roles()->detach();

785) /var/www/app/Http/Controllers/ManagementController.php:228    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return redirect()->route('lecture.user.management', ['instance' => $instance, 'id' => $user->id])->with('error', 'Comité no válido.');
         }
         // elimino toda asociación previa
-        DB::table('coordinators')->where(['user_id' => $user->id])->delete();
+        DB::table('coordinators')->where([])->delete();
         DB::table('secretaries')->where(['user_id' => $user->id])->delete();
         // elimino roles anteriores
         $user->roles()->detach();

786) /var/www/app/Http/Controllers/ManagementController.php:228    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if (Comittee::find($comittee_id) == null) {
             return redirect()->route('lecture.user.management', ['instance' => $instance, 'id' => $user->id])->with('error', 'Comité no válido.');
         }
-        // elimino toda asociación previa
-        DB::table('coordinators')->where(['user_id' => $user->id])->delete();
+        
         DB::table('secretaries')->where(['user_id' => $user->id])->delete();
         // elimino roles anteriores
         $user->roles()->detach();

787) /var/www/app/Http/Controllers/ManagementController.php:229    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         // elimino toda asociación previa
         DB::table('coordinators')->where(['user_id' => $user->id])->delete();
-        DB::table('secretaries')->where(['user_id' => $user->id])->delete();
+        DB::table('secretaries')->where(['user_id' > $user->id])->delete();
         // elimino roles anteriores
         $user->roles()->detach();
         // asigno los nuevos roles

788) /var/www/app/Http/Controllers/ManagementController.php:229    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         // elimino toda asociación previa
         DB::table('coordinators')->where(['user_id' => $user->id])->delete();
-        DB::table('secretaries')->where(['user_id' => $user->id])->delete();
+        DB::table('secretaries')->where([])->delete();
         // elimino roles anteriores
         $user->roles()->detach();
         // asigno los nuevos roles

789) /var/www/app/Http/Controllers/ManagementController.php:229    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // elimino toda asociación previa
         DB::table('coordinators')->where(['user_id' => $user->id])->delete();
-        DB::table('secretaries')->where(['user_id' => $user->id])->delete();
+        
         // elimino roles anteriores
         $user->roles()->detach();
         // asigno los nuevos roles

790) /var/www/app/Http/Controllers/ManagementController.php:232    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // elimino toda asociación previa
         DB::table('coordinators')->where(['user_id' => $user->id])->delete();
         DB::table('secretaries')->where(['user_id' => $user->id])->delete();
-        // elimino roles anteriores
-        $user->roles()->detach();
+        
         // asigno los nuevos roles
         foreach ($roles_id as $rol_id) {
             $rol = Role::find($rol_id);

791) /var/www/app/Http/Controllers/ManagementController.php:235    [M] Foreach_

--- Original
+++ New
@@ @@
         // elimino roles anteriores
         $user->roles()->detach();
         // asigno los nuevos roles
-        foreach ($roles_id as $rol_id) {
+        foreach (array() as $rol_id) {
             $rol = Role::find($rol_id);
             $user->roles()->attach($rol);
             $user->save();

792) /var/www/app/Http/Controllers/ManagementController.php:237    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // asigno los nuevos roles
         foreach ($roles_id as $rol_id) {
             $rol = Role::find($rol_id);
-            $user->roles()->attach($rol);
+            
             $user->save();
         }
         // ¿tiene rol de coordinador?

793) /var/www/app/Http/Controllers/ManagementController.php:238    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         foreach ($roles_id as $rol_id) {
             $rol = Role::find($rol_id);
             $user->roles()->attach($rol);
-            $user->save();
+            
         }
         // ¿tiene rol de coordinador?
         if ($user->hasRole('COORDINATOR')) {

794) /var/www/app/Http/Controllers/ManagementController.php:243    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         // ¿tiene rol de coordinador?
         if ($user->hasRole('COORDINATOR')) {
-            DB::table('coordinators')->insert(['comittee_id' => $comittee_id, 'user_id' => $user->id]);
+            DB::table('coordinators')->insert(['comittee_id' => $comittee_id, 'user_id' > $user->id]);
         }
         // ¿tiene rol de secretario?
         if ($user->hasRole('SECRETARY')) {

795) /var/www/app/Http/Controllers/ManagementController.php:243    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         // ¿tiene rol de coordinador?
         if ($user->hasRole('COORDINATOR')) {
-            DB::table('coordinators')->insert(['comittee_id' => $comittee_id, 'user_id' => $user->id]);
+            DB::table('coordinators')->insert(['user_id' => $user->id]);
         }
         // ¿tiene rol de secretario?
         if ($user->hasRole('SECRETARY')) {

796) /var/www/app/Http/Controllers/ManagementController.php:243    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // ¿tiene rol de coordinador?
         if ($user->hasRole('COORDINATOR')) {
-            DB::table('coordinators')->insert(['comittee_id' => $comittee_id, 'user_id' => $user->id]);
+            
         }
         // ¿tiene rol de secretario?
         if ($user->hasRole('SECRETARY')) {

797) /var/www/app/Http/Controllers/ManagementController.php:248    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         // ¿tiene rol de secretario?
         if ($user->hasRole('SECRETARY')) {
-            DB::table('secretaries')->insert(['comittee_id' => $comittee_id, 'user_id' => $user->id]);
+            DB::table('secretaries')->insert(['comittee_id' => $comittee_id, 'user_id' > $user->id]);
         }
         $user->save();
         // el profesor tiene potestad para cambiar datos sensibles de un alumno

798) /var/www/app/Http/Controllers/ManagementController.php:248    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         // ¿tiene rol de secretario?
         if ($user->hasRole('SECRETARY')) {
-            DB::table('secretaries')->insert(['comittee_id' => $comittee_id, 'user_id' => $user->id]);
+            DB::table('secretaries')->insert(['user_id' => $user->id]);
         }
         $user->save();
         // el profesor tiene potestad para cambiar datos sensibles de un alumno

799) /var/www/app/Http/Controllers/ManagementController.php:248    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // ¿tiene rol de secretario?
         if ($user->hasRole('SECRETARY')) {
-            DB::table('secretaries')->insert(['comittee_id' => $comittee_id, 'user_id' => $user->id]);
+            
         }
         $user->save();
         // el profesor tiene potestad para cambiar datos sensibles de un alumno

801) /var/www/app/Http/Controllers/ManagementController.php:256    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $user->save();
         // el profesor tiene potestad para cambiar datos sensibles de un alumno
         if (Auth::user()->hasRole('LECTURE')) {
-            $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
+            $request->validate(['surname' => 'required|max:255']);
             // si se cambia el uvus, comprueba que el nuevo sea único
             if ($request->input('username') != $user->username) {
                 $request->validate(['username' => 'required|max:255|unique:users']);

802) /var/www/app/Http/Controllers/ManagementController.php:256    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->save();
         // el profesor tiene potestad para cambiar datos sensibles de un alumno
         if (Auth::user()->hasRole('LECTURE')) {
-            $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
+            
             // si se cambia el uvus, comprueba que el nuevo sea único
             if ($request->input('username') != $user->username) {
                 $request->validate(['username' => 'required|max:255|unique:users']);

803) /var/www/app/Http/Controllers/ManagementController.php:262    [M] NotEqual

--- Original
+++ New
@@ @@
         if (Auth::user()->hasRole('LECTURE')) {
             $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
             // si se cambia el uvus, comprueba que el nuevo sea único
-            if ($request->input('username') != $user->username) {
+            if ($request->input('username') == $user->username) {
                 $request->validate(['username' => 'required|max:255|unique:users']);
             }
             // si se cambia el email, comprueba que el nuevo sea único

804) /var/www/app/Http/Controllers/ManagementController.php:263    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
             // si se cambia el uvus, comprueba que el nuevo sea único
             if ($request->input('username') != $user->username) {
-                $request->validate(['username' => 'required|max:255|unique:users']);
+                $request->validate([]);
             }
             // si se cambia el email, comprueba que el nuevo sea único
             if ($request->input('email') != $user->email) {

805) /var/www/app/Http/Controllers/ManagementController.php:263    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
             // si se cambia el uvus, comprueba que el nuevo sea único
             if ($request->input('username') != $user->username) {
-                $request->validate(['username' => 'required|max:255|unique:users']);
+                
             }
             // si se cambia el email, comprueba que el nuevo sea único
             if ($request->input('email') != $user->email) {

806) /var/www/app/Http/Controllers/ManagementController.php:269    [M] NotEqual

--- Original
+++ New
@@ @@
                 $request->validate(['username' => 'required|max:255|unique:users']);
             }
             // si se cambia el email, comprueba que el nuevo sea único
-            if ($request->input('email') != $user->email) {
+            if ($request->input('email') == $user->email) {
                 $request->validate(['email' => 'required|max:255|unique:users']);
             }
             $user->username = $request->input('username');

807) /var/www/app/Http/Controllers/ManagementController.php:270    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             // si se cambia el email, comprueba que el nuevo sea único
             if ($request->input('email') != $user->email) {
-                $request->validate(['email' => 'required|max:255|unique:users']);
+                $request->validate([]);
             }
             $user->username = $request->input('username');
             $user->name = $request->input('name');

808) /var/www/app/Http/Controllers/ManagementController.php:270    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             // si se cambia el email, comprueba que el nuevo sea único
             if ($request->input('email') != $user->email) {
-                $request->validate(['email' => 'required|max:255|unique:users']);
+                
             }
             $user->username = $request->input('username');
             $user->name = $request->input('name');

809) /var/www/app/Http/Controllers/ManagementController.php:279    [M] UnwrapTrim

--- Original
+++ New
@@ @@
             $user->name = $request->input('name');
             $user->surname = $request->input('surname');
             $user->email = $request->input('email');
-            $user->clean_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))), ' '));
+            $user->clean_name = strtoupper(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))));
             $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
             // si se cambia la contraseña
             if ($request->input('password') != "") {

810) /var/www/app/Http/Controllers/ManagementController.php:279    [M] UnwrapStrToUpper

--- Original
+++ New
@@ @@
             $user->name = $request->input('name');
             $user->surname = $request->input('surname');
             $user->email = $request->input('email');
-            $user->clean_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))), ' '));
+            $user->clean_name = trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))), ' ');
             $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
             // si se cambia la contraseña
             if ($request->input('password') != "") {
