811) /var/www/app/Http/Controllers/ManagementController.php:280    [M] UnwrapTrim

--- Original
+++ New
@@ @@
             $user->surname = $request->input('surname');
             $user->email = $request->input('email');
             $user->clean_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))), ' '));
-            $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
+            $user->clean_surname = strtoupper(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))));
             // si se cambia la contraseña
             if ($request->input('password') != "") {
                 $request->validate(['password' => 'required|confirmed|min:6']);

812) /var/www/app/Http/Controllers/ManagementController.php:280    [M] UnwrapStrToUpper

--- Original
+++ New
@@ @@
             $user->surname = $request->input('surname');
             $user->email = $request->input('email');
             $user->clean_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))), ' '));
-            $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
+            $user->clean_surname = trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' ');
             // si se cambia la contraseña
             if ($request->input('password') != "") {
                 $request->validate(['password' => 'required|confirmed|min:6']);

813) /var/www/app/Http/Controllers/ManagementController.php:284    [M] NotEqual

--- Original
+++ New
@@ @@
             $user->clean_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))), ' '));
             $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
             // si se cambia la contraseña
-            if ($request->input('password') != "") {
+            if ($request->input('password') == "") {
                 $request->validate(['password' => 'required|confirmed|min:6']);
                 $user->password = Hash::make($request->input('password'));
             }

814) /var/www/app/Http/Controllers/ManagementController.php:285    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
             // si se cambia la contraseña
             if ($request->input('password') != "") {
-                $request->validate(['password' => 'required|confirmed|min:6']);
+                $request->validate([]);
                 $user->password = Hash::make($request->input('password'));
             }
             $user->save();

815) /var/www/app/Http/Controllers/ManagementController.php:285    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
             // si se cambia la contraseña
             if ($request->input('password') != "") {
-                $request->validate(['password' => 'required|confirmed|min:6']);
+                
                 $user->password = Hash::make($request->input('password'));
             }
             $user->save();

817) /var/www/app/Http/Controllers/ManagementController.php:296    [M] ArrayItem

--- Original
+++ New
@@ @@
             $user->save();
         }
         if ($user->hasRole('PRESIDENT')) {
-            return redirect()->route('president.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
+            return redirect()->route('president.user.list', ['instance' => $instance, 'id' > $user->id])->with('success', 'Usuario actualizado con éxito');
         }
         return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
     }

818) /var/www/app/Http/Controllers/ManagementController.php:296    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             $user->save();
         }
         if ($user->hasRole('PRESIDENT')) {
-            return redirect()->route('president.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
+            return redirect()->route('president.user.list', ['id' => $user->id])->with('success', 'Usuario actualizado con éxito');
         }
         return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
     }

819) /var/www/app/Http/Controllers/ManagementController.php:299    [M] ArrayItem

--- Original
+++ New
@@ @@
         if ($user->hasRole('PRESIDENT')) {
             return redirect()->route('president.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
         }
-        return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
+        return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' > $user->id])->with('success', 'Usuario actualizado con éxito');
     }
     public function user_management_new(Request $request)
     {

820) /var/www/app/Http/Controllers/ManagementController.php:299    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if ($user->hasRole('PRESIDENT')) {
             return redirect()->route('president.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
         }
-        return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
+        return redirect()->route('lecture.user.list', ['id' => $user->id])->with('success', 'Usuario actualizado con éxito');
     }
     public function user_management_new(Request $request)
     {

821) /var/www/app/Http/Controllers/ManagementController.php:302    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario actualizado con éxito');
     }
-    public function user_management_new(Request $request)
+    protected function user_management_new(Request $request)
     {
         $instance = \Instantiation::instance();
         $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255', 'email' => 'required|max:255|unique:users', 'username' => 'required|max:255|unique:users']);

822) /var/www/app/Http/Controllers/ManagementController.php:307    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function user_management_new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255', 'email' => 'required|max:255|unique:users', 'username' => 'required|max:255|unique:users']);
+        $request->validate(['surname' => 'required|max:255', 'email' => 'required|max:255|unique:users', 'username' => 'required|max:255|unique:users']);
         $student_role = Role::where('rol', 'STUDENT')->get();
         $user->roles()->attach($student_role);

823) /var/www/app/Http/Controllers/ManagementController.php:307    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function user_management_new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255', 'email' => 'required|max:255|unique:users', 'username' => 'required|max:255|unique:users']);
+        
         $student_role = Role::where('rol', 'STUDENT')->get();
         $user->roles()->attach($student_role);

834) /var/www/app/Http/Controllers/ManagementController.php:327    [M] ArrayItem

--- Original
+++ New
@@ @@
         $student_role = Role::where('rol', 'STUDENT')->get();
         $user->roles()->attach($student_role);
-        return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario creado con éxito');
+        return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' > $user->id])->with('success', 'Usuario creado con éxito');
     }
     public function user_management_delete_all(Request $request)
     {

835) /var/www/app/Http/Controllers/ManagementController.php:327    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $student_role = Role::where('rol', 'STUDENT')->get();
         $user->roles()->attach($student_role);
-        return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario creado con éxito');
+        return redirect()->route('lecture.user.list', ['id' => $user->id])->with('success', 'Usuario creado con éxito');
     }
     public function user_management_delete_all(Request $request)
     {

836) /var/www/app/Http/Controllers/ManagementController.php:331    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $user->roles()->attach($student_role);
         return redirect()->route('lecture.user.list', ['instance' => $instance, 'id' => $user->id])->with('success', 'Usuario creado con éxito');
     }
-    public function user_management_delete_all(Request $request)
+    protected function user_management_delete_all(Request $request)
     {
         $users = $this->user_service->all_except_logged();
         foreach ($users as $user) {

837) /var/www/app/Http/Controllers/ManagementController.php:335    [M] Foreach_

--- Original
+++ New
@@ @@
     public function user_management_delete_all(Request $request)
     {
         $users = $this->user_service->all_except_logged();
-        foreach ($users as $user) {
+        foreach (array() as $user) {
             $this->user_service->delete($user->id);
         }
         return redirect()->route('lecture.user.list', ['instance' => \Instantiation::instance()])->with('success', 'Usuarios borrados con éxito');

838) /var/www/app/Http/Controllers/ManagementController.php:336    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $users = $this->user_service->all_except_logged();
         foreach ($users as $user) {
-            $this->user_service->delete($user->id);
+            
         }
         return redirect()->route('lecture.user.list', ['instance' => \Instantiation::instance()])->with('success', 'Usuarios borrados con éxito');
     }

839) /var/www/app/Http/Controllers/ManagementController.php:339    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         foreach ($users as $user) {
             $this->user_service->delete($user->id);
         }
-        return redirect()->route('lecture.user.list', ['instance' => \Instantiation::instance()])->with('success', 'Usuarios borrados con éxito');
+        return redirect()->route('lecture.user.list', [])->with('success', 'Usuarios borrados con éxito');
     }
     public function evidences_export($instance, $ext)
     {

840) /var/www/app/Http/Controllers/ManagementController.php:342    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('lecture.user.list', ['instance' => \Instantiation::instance()])->with('success', 'Usuarios borrados con éxito');
     }
-    public function evidences_export($instance, $ext)
+    protected function evidences_export($instance, $ext)
     {
         try {
             ob_end_clean();

844) /var/www/app/Http/Controllers/ManagementController.php:349    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementEvidencesExport(), \Illuminate\Support\Carbon::now() . 'evidencias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

845) /var/www/app/Http/Controllers/ManagementController.php:349    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementEvidencesExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

846) /var/www/app/Http/Controllers/ManagementController.php:349    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

847) /var/www/app/Http/Controllers/ManagementController.php:349    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

848) /var/www/app/Http/Controllers/ManagementController.php:349    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

849) /var/www/app/Http/Controllers/ManagementController.php:349    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

850) /var/www/app/Http/Controllers/ManagementController.php:349    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementEvidencesExport(), 'evidencias-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

854) /var/www/app/Http/Controllers/ManagementController.php:356    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
-    public function management_student_export($instance, $ext)
+    protected function management_student_export($instance, $ext)
     {
         try {
             ob_end_clean();

858) /var/www/app/Http/Controllers/ManagementController.php:363    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementStudentExport(), \Illuminate\Support\Carbon::now() . 'alumnos-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

859) /var/www/app/Http/Controllers/ManagementController.php:363    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementStudentExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

860) /var/www/app/Http/Controllers/ManagementController.php:363    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementStudentExport(), 'alumnos-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

861) /var/www/app/Http/Controllers/ManagementController.php:363    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementStudentExport(), 'alumnos-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

862) /var/www/app/Http/Controllers/ManagementController.php:363    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

863) /var/www/app/Http/Controllers/ManagementController.php:363    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

864) /var/www/app/Http/Controllers/ManagementController.php:363    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new ManagementStudentExport(), 'alumnos-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

871) /var/www/app/Http/Controllers/MeetingController.php:26    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meetings = Auth::user()->meetings()->get();
-        return view('meeting.mylist', ['instance' => $instance, 'meetings' => $meetings]);
+        view('meeting.mylist', ['instance' => $instance, 'meetings' => $meetings]);
+        return null;
     }
     public function meeting_export($instance, $ext)
     {

872) /var/www/app/Http/Controllers/MeetingController.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meetings = Auth::user()->meetings()->get();
-        return view('meeting.mylist', ['instance' => $instance, 'meetings' => $meetings]);
+        return view('meeting.mylist', ['meetings' => $meetings]);
     }
     public function meeting_export($instance, $ext)
     {

873) /var/www/app/Http/Controllers/MeetingController.php:31    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $meetings = Auth::user()->meetings()->get();
         return view('meeting.mylist', ['instance' => $instance, 'meetings' => $meetings]);
     }
-    public function meeting_export($instance, $ext)
+    protected function meeting_export($instance, $ext)
     {
         try {
             ob_end_clean();

877) /var/www/app/Http/Controllers/MeetingController.php:38    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingsExport(), \Illuminate\Support\Carbon::now() . 'reunion-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

878) /var/www/app/Http/Controllers/MeetingController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingsExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

879) /var/www/app/Http/Controllers/MeetingController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingsExport(), 'reunion-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

880) /var/www/app/Http/Controllers/MeetingController.php:38    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingsExport(), 'reunion-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

881) /var/www/app/Http/Controllers/MeetingController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

882) /var/www/app/Http/Controllers/MeetingController.php:38    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

883) /var/www/app/Http/Controllers/MeetingController.php:38    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingsExport(), 'reunion-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

891) /var/www/app/Http/Controllers/MeetingController.php:51    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyMeetingsExport(), \Illuminate\Support\Carbon::now() . 'misreuniones-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }
