892) /var/www/app/Http/Controllers/MeetingController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyMeetingsExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

893) /var/www/app/Http/Controllers/MeetingController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

894) /var/www/app/Http/Controllers/MeetingController.php:51    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

895) /var/www/app/Http/Controllers/MeetingController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

896) /var/www/app/Http/Controllers/MeetingController.php:51    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

897) /var/www/app/Http/Controllers/MeetingController.php:51    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MyMeetingsExport(), 'misreuniones-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
 }

904) /var/www/app/Http/Controllers/MeetingSecretaryController.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function manage()
     {
         $instance = \Instantiation::instance();
-        return view('meeting.manage', ['instance' => $instance]);
+        return view('meeting.manage', []);
     }
     /*
      *  Requests

905) /var/www/app/Http/Controllers/MeetingSecretaryController.php:45    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function manage()
     {
         $instance = \Instantiation::instance();
-        return view('meeting.manage', ['instance' => $instance]);
+        view('meeting.manage', ['instance' => $instance]);
+        return null;
     }
     /*
      *  Requests

906) /var/www/app/Http/Controllers/MeetingSecretaryController.php:51    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /*
      *  Requests
      */
-    public function request_list()
+    protected function request_list()
     {
         $instance = \Instantiation::instance();
         $meeting_requests = Auth::user()->secretary->meeting_requests;

907) /var/www/app/Http/Controllers/MeetingSecretaryController.php:58    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meeting_requests = Auth::user()->secretary->meeting_requests;
-        return view('meeting.request_list', ["meeting_requests" => $meeting_requests, "instance" => $instance]);
+        return view('meeting.request_list', ["instance" => $instance]);
     }
     public function request_create()
     {

908) /var/www/app/Http/Controllers/MeetingSecretaryController.php:58    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meeting_requests = Auth::user()->secretary->meeting_requests;
-        return view('meeting.request_list', ["meeting_requests" => $meeting_requests, "instance" => $instance]);
+        view('meeting.request_list', ["meeting_requests" => $meeting_requests, "instance" => $instance]);
+        return null;
     }
     public function request_create()
     {

909) /var/www/app/Http/Controllers/MeetingSecretaryController.php:61    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $meeting_requests = Auth::user()->secretary->meeting_requests;
         return view('meeting.request_list', ["meeting_requests" => $meeting_requests, "instance" => $instance]);
     }
-    public function request_create()
+    protected function request_create()
     {
         $instance = \Instantiation::instance();
         return view('meeting.request_createandedit', ['instance' => $instance]);

910) /var/www/app/Http/Controllers/MeetingSecretaryController.php:65    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function request_create()
     {
         $instance = \Instantiation::instance();
-        return view('meeting.request_createandedit', ['instance' => $instance]);
+        return view('meeting.request_createandedit', []);
     }
     public function request_new(Request $request_http)
     {

911) /var/www/app/Http/Controllers/MeetingSecretaryController.php:65    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function request_create()
     {
         $instance = \Instantiation::instance();
-        return view('meeting.request_createandedit', ['instance' => $instance]);
+        view('meeting.request_createandedit', ['instance' => $instance]);
+        return null;
     }
     public function request_new(Request $request_http)
     {

912) /var/www/app/Http/Controllers/MeetingSecretaryController.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         return view('meeting.request_createandedit', ['instance' => $instance]);
     }
-    public function request_new(Request $request_http)
+    protected function request_new(Request $request_http)
     {
         $instance = \Instantiation::instance();

914) /var/www/app/Http/Controllers/MeetingSecretaryController.php:84    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if ($validator->fails()) {
             $points = json_decode($request_http->input('points_list'), true);
-            return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' => collect($points)]);
+            return back()->withErrors($validator)->withInput()->with(['points' => collect($points)]);
         }
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);

915) /var/www/app/Http/Controllers/MeetingSecretaryController.php:86    [M] ArrayItem

--- Original
+++ New
@@ @@
         if ($validator->fails()) {
             $points = json_decode($request_http->input('points_list'), true);
-            return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' => collect($points)]);
+            return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' > collect($points)]);
         }
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);

928) /var/www/app/Http/Controllers/MeetingSecretaryController.php:100    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' => collect($points)]);
         }
-        $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
+        $diary = Diary::create([]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
             DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
         }

929) /var/www/app/Http/Controllers/MeetingSecretaryController.php:101    [M] ArrayItem

--- Original
+++ New
@@ @@
             return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' => collect($points)]);
         }
-        $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
+        $diary = Diary::create(["meeting_request_id" > $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
             DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
         }

930) /var/www/app/Http/Controllers/MeetingSecretaryController.php:104    [M] DecrementInteger

--- Original
+++ New
@@ @@
         }
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
-        foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
+        foreach (json_decode($request_http->input('points_list'), 0) as $key => $value) {
             DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
         }
         // Genera PDF de la convocatoria

931) /var/www/app/Http/Controllers/MeetingSecretaryController.php:104    [M] IncrementInteger

--- Original
+++ New
@@ @@
         }
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
-        foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
+        foreach (json_decode($request_http->input('points_list'), 2) as $key => $value) {
             DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
         }
         // Genera PDF de la convocatoria

932) /var/www/app/Http/Controllers/MeetingSecretaryController.php:104    [M] Foreach_

--- Original
+++ New
@@ @@
         }
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
-        foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
+        foreach (array() as $key => $value) {
             DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
         }
         // Genera PDF de la convocatoria

933) /var/www/app/Http/Controllers/MeetingSecretaryController.php:106    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
-            DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
+            DiaryPoints::create(["point" => $value]);
         }
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);

934) /var/www/app/Http/Controllers/MeetingSecretaryController.php:106    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
-            DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
+            
         }
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);

935) /var/www/app/Http/Controllers/MeetingSecretaryController.php:107    [M] ArrayItem

--- Original
+++ New
@@ @@
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
-            DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
+            DiaryPoints::create(["diary_id" > $diary->id, "point" => $value]);
         }
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);

936) /var/www/app/Http/Controllers/MeetingSecretaryController.php:114    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             DiaryPoints::create(["diary_id" => $diary->id, "point" => $value]);
         }
         // Genera PDF de la convocatoria
-        $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
+        $pdf = PDF::loadView('meeting.request_template', []);
         $content = $pdf->download()->getOriginalContent();
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)

937) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] Concat

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        Storage::put('/meeting_requests/meeting_request_' . \Instantiation::instance() . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

938) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        Storage::put('/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

939) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

940) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] Concat

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . $meeting_request->id . '/meeting_requests/meeting_request_' . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

941) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

942) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] Concat

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf' . $meeting_request->id, $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

943) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id, $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

944) /var/www/app/Http/Controllers/MeetingSecretaryController.php:116    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
+        
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);

945) /var/www/app/Http/Controllers/MeetingSecretaryController.php:119    [M] Equal

--- Original
+++ New
@@ @@
         $content = $pdf->download()->getOriginalContent();
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
-        if ($request_http->input('create_signature_sheet') == 'on') {
+        if ($request_http->input('create_signature_sheet') != 'on') {
             SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');

946) /var/www/app/Http/Controllers/MeetingSecretaryController.php:120    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

947) /var/www/app/Http/Controllers/MeetingSecretaryController.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

948) /var/www/app/Http/Controllers/MeetingSecretaryController.php:121    [M] Concat

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => $request_http->input('title') . 'Hoja de firmas de ', 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

949) /var/www/app/Http/Controllers/MeetingSecretaryController.php:121    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

950) /var/www/app/Http/Controllers/MeetingSecretaryController.php:121    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => 'Hoja de firmas de ', 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

951) /var/www/app/Http/Controllers/MeetingSecretaryController.php:122    [M] DecrementInteger

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(3), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }
