952) /var/www/app/Http/Controllers/MeetingSecretaryController.php:122    [M] IncrementInteger

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(5), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

953) /var/www/app/Http/Controllers/MeetingSecretaryController.php:122    [M] ArrayItem

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' > $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

954) /var/www/app/Http/Controllers/MeetingSecretaryController.php:123    [M] ArrayItem

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' > $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

955) /var/www/app/Http/Controllers/MeetingSecretaryController.php:124    [M] ArrayItem

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         // creamos una hoja de firmas (si el usuario lo ha querido así)
         if ($request_http->input('create_signature_sheet') == 'on') {
-            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' => Auth::user()->secretary->id]);
+            SignatureSheet::create(['title' => 'Hoja de firmas de ' . $request_http->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $meeting_request->id, 'secretary_id' > Auth::user()->secretary->id]);
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }

956) /var/www/app/Http/Controllers/MeetingSecretaryController.php:131    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión creada con éxito.');
     }
-    public function request_edit($instance, $id)
+    protected function request_edit($instance, $id)
     {
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::findOrFail($id);

957) /var/www/app/Http/Controllers/MeetingSecretaryController.php:139    [M] Foreach_

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::findOrFail($id);
         $points_array = array();
-        foreach ($meeting_request->diary->diary_points as $point) {
+        foreach (array() as $point) {
             array_push($points_array, $point->point);
         }
         return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);

958) /var/www/app/Http/Controllers/MeetingSecretaryController.php:140    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::findOrFail($id);
         $points_array = array();
         foreach ($meeting_request->diary->diary_points as $point) {
-            array_push($points_array, $point->point);
+            
         }
         return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
     }

959) /var/www/app/Http/Controllers/MeetingSecretaryController.php:143    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         foreach ($meeting_request->diary->diary_points as $point) {
             array_push($points_array, $point->point);
         }
-        return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
+        return view('meeting.request_createandedit', ['meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
     }
     public function request_save(Request $request_http)
     {

960) /var/www/app/Http/Controllers/MeetingSecretaryController.php:143    [M] FunctionCall

--- Original
+++ New
@@ @@
         foreach ($meeting_request->diary->diary_points as $point) {
             array_push($points_array, $point->point);
         }
-        return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
+        view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
+        return null;
     }
     public function request_save(Request $request_http)
     {

961) /var/www/app/Http/Controllers/MeetingSecretaryController.php:146    [M] TrueValue

--- Original
+++ New
@@ @@
         foreach ($meeting_request->diary->diary_points as $point) {
             array_push($points_array, $point->point);
         }
-        return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
+        return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => false, 'points' => collect($points_array)]);
     }
     public function request_save(Request $request_http)
     {

962) /var/www/app/Http/Controllers/MeetingSecretaryController.php:147    [M] ArrayItem

--- Original
+++ New
@@ @@
         foreach ($meeting_request->diary->diary_points as $point) {
             array_push($points_array, $point->point);
         }
-        return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
+        return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' > collect($points_array)]);
     }
     public function request_save(Request $request_http)
     {

963) /var/www/app/Http/Controllers/MeetingSecretaryController.php:151    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return view('meeting.request_createandedit', ['instance' => $instance, 'meeting_request' => $meeting_request, 'edit' => true, 'points' => collect($points_array)]);
     }
-    public function request_save(Request $request_http)
+    protected function request_save(Request $request_http)
     {
         $instance = \Instantiation::instance();

967) /var/www/app/Http/Controllers/MeetingSecretaryController.php:177    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         $meeting_request->title = $request_http->input('title');
         $meeting_request->place = $request_http->input('place');
-        $meeting_request->datetime = $request_http->input('date') . " " . $request_http->input('time');
+        $meeting_request->datetime = " " . $request_http->input('date') . $request_http->input('time');
         $meeting_request->modality = $request_http->input('modality');
         $meeting_request->type = $request_http->input('type');
         $meeting_request->save();

968) /var/www/app/Http/Controllers/MeetingSecretaryController.php:177    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         $meeting_request->title = $request_http->input('title');
         $meeting_request->place = $request_http->input('place');
-        $meeting_request->datetime = $request_http->input('date') . " " . $request_http->input('time');
+        $meeting_request->datetime = " " . $request_http->input('time');
         $meeting_request->modality = $request_http->input('modality');
         $meeting_request->type = $request_http->input('type');
         $meeting_request->save();

969) /var/www/app/Http/Controllers/MeetingSecretaryController.php:177    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         $meeting_request->title = $request_http->input('title');
         $meeting_request->place = $request_http->input('place');
-        $meeting_request->datetime = $request_http->input('date') . " " . $request_http->input('time');
+        $meeting_request->datetime = $request_http->input('date') . $request_http->input('time');
         $meeting_request->modality = $request_http->input('modality');
         $meeting_request->type = $request_http->input('type');
         $meeting_request->save();

970) /var/www/app/Http/Controllers/MeetingSecretaryController.php:177    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         $meeting_request->title = $request_http->input('title');
         $meeting_request->place = $request_http->input('place');
-        $meeting_request->datetime = $request_http->input('date') . " " . $request_http->input('time');
+        $meeting_request->datetime = $request_http->input('date') . $request_http->input('time') . " ";
         $meeting_request->modality = $request_http->input('modality');
         $meeting_request->type = $request_http->input('type');
         $meeting_request->save();

971) /var/www/app/Http/Controllers/MeetingSecretaryController.php:177    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         $meeting_request->title = $request_http->input('title');
         $meeting_request->place = $request_http->input('place');
-        $meeting_request->datetime = $request_http->input('date') . " " . $request_http->input('time');
+        $meeting_request->datetime = $request_http->input('date') . " ";
         $meeting_request->modality = $request_http->input('modality');
         $meeting_request->type = $request_http->input('type');
         $meeting_request->save();

972) /var/www/app/Http/Controllers/MeetingSecretaryController.php:181    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $meeting_request->datetime = $request_http->input('date') . " " . $request_http->input('time');
         $meeting_request->modality = $request_http->input('modality');
         $meeting_request->type = $request_http->input('type');
-        $meeting_request->save();
+        
         // borramos los puntos del día anteriores
         $old_diary = $meeting_request->diary;
         $old_diary?->delete();

973) /var/www/app/Http/Controllers/MeetingSecretaryController.php:185    [M] NullSafeMethodCall

--- Original
+++ New
@@ @@
         $meeting_request->save();
         // borramos los puntos del día anteriores
         $old_diary = $meeting_request->diary;
-        $old_diary?->delete();
+        $old_diary->delete();
         // añadimos los nuevos puntos
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {

974) /var/www/app/Http/Controllers/MeetingSecretaryController.php:188    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $old_diary = $meeting_request->diary;
         $old_diary?->delete();
         // añadimos los nuevos puntos
-        $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
+        $diary = Diary::create([]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
             $diary->diary_points()->create(['diary_id' => $diary->id, 'point' => $value]);
         }

975) /var/www/app/Http/Controllers/MeetingSecretaryController.php:189    [M] ArrayItem

--- Original
+++ New
@@ @@
         $old_diary = $meeting_request->diary;
         $old_diary?->delete();
         // añadimos los nuevos puntos
-        $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
+        $diary = Diary::create(["meeting_request_id" > $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
             $diary->diary_points()->create(['diary_id' => $diary->id, 'point' => $value]);
         }

979) /var/www/app/Http/Controllers/MeetingSecretaryController.php:194    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // añadimos los nuevos puntos
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
-            $diary->diary_points()->create(['diary_id' => $diary->id, 'point' => $value]);
+            $diary->diary_points()->create(['point' => $value]);
         }
         /*
          *  Por alguna extraña razón de Laravel, no es capaz de remapear el objeto meeting_request, pese a que

980) /var/www/app/Http/Controllers/MeetingSecretaryController.php:194    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // añadimos los nuevos puntos
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
-            $diary->diary_points()->create(['diary_id' => $diary->id, 'point' => $value]);
+            
         }
         /*
          *  Por alguna extraña razón de Laravel, no es capaz de remapear el objeto meeting_request, pese a que

981) /var/www/app/Http/Controllers/MeetingSecretaryController.php:195    [M] ArrayItem

--- Original
+++ New
@@ @@
         // añadimos los nuevos puntos
         $diary = Diary::create(["meeting_request_id" => $meeting_request->id]);
         foreach (json_decode($request_http->input('points_list'), 1) as $key => $value) {
-            $diary->diary_points()->create(['diary_id' => $diary->id, 'point' => $value]);
+            $diary->diary_points()->create(['diary_id' > $diary->id, 'point' => $value]);
         }
         /*
          *  Por alguna extraña razón de Laravel, no es capaz de remapear el objeto meeting_request, pese a que

982) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] Concat

--- Original
+++ New
@@ @@
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete('/meeting_requests/meeting_request_' . \Instantiation::instance() . $meeting_request->id . '.pdf');
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

983) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete('/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

984) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting_request->id . '.pdf');
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

985) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] Concat

--- Original
+++ New
@@ @@
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting_request->id . '/meeting_requests/meeting_request_' . '.pdf');
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

986) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf');
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

987) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] Concat

--- Original
+++ New
@@ @@
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf' . $meeting_request->id);
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

988) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
         // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id);
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

989) /var/www/app/Http/Controllers/MeetingSecretaryController.php:212    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
          *  No sé, es muy extraño.
          */
         $meeting_request = MeetingRequest::findOrFail($request_http->input('_id'));
-        // borramos el PDF de la convocatoria anterior
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        
         // Genera PDF de la convocatoria
         $pdf = PDF::loadView('meeting.request_template', ['meeting_request' => $meeting_request]);
         $content = $pdf->download()->getOriginalContent();

999) /var/www/app/Http/Controllers/MeetingSecretaryController.php:222    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria de reunión editada con éxito.');
     }
-    public function request_download($instance, $id)
+    protected function request_download($instance, $id)
     {
         $meeting_request = MeetingRequest::findOrFail($id);
         $response = Storage::download(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');

1008) /var/www/app/Http/Controllers/MeetingSecretaryController.php:234    [M] PublicVisibility

--- Original
+++ New
@@ @@
         ob_end_clean();
         return $response;
     }
-    public function request_remove(Request $request)
+    protected function request_remove(Request $request)
     {
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();

1009) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete('/meeting_requests/meeting_request_' . \Instantiation::instance() . $meeting_request->id . '.pdf');
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1010) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete('/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1011) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting_request->id . '.pdf');
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1012) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting_request->id . '/meeting_requests/meeting_request_' . '.pdf');
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1013) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf');
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1014) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . '.pdf' . $meeting_request->id);
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1015) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id);
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1016) /var/www/app/Http/Controllers/MeetingSecretaryController.php:241    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $meeting_request = MeetingRequest::where('id', $request->input('meeting_request_id'))->first();
         $instance = \Instantiation::instance();
-        // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
+        
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {

1017) /var/www/app/Http/Controllers/MeetingSecretaryController.php:245    [M] NotEqual

--- Original
+++ New
@@ @@
         Storage::delete(\Instantiation::instance() . '/meeting_requests/meeting_request_' . $meeting_request->id . '.pdf');
         // desemparejamos signature sheet (si la hubiera)
         $signature_sheet = $meeting_request->signature_sheet;
-        if ($signature_sheet != null) {
+        if ($signature_sheet == null) {
             $signature_sheet->meeting_request_id = null;
             $signature_sheet->save();
         }
