1018) /var/www/app/Http/Controllers/MeetingSecretaryController.php:247    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $signature_sheet = $meeting_request->signature_sheet;
         if ($signature_sheet != null) {
             $signature_sheet->meeting_request_id = null;
-            $signature_sheet->save();
+            
         }
         // eliminamos la entidad en sí
         $meeting_request->delete();

1019) /var/www/app/Http/Controllers/MeetingSecretaryController.php:251    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $signature_sheet->meeting_request_id = null;
             $signature_sheet->save();
         }
-        // eliminamos la entidad en sí
-        $meeting_request->delete();
+        
         return redirect()->route('secretary.meeting.manage.request.list', $instance)->with('success', 'Convocatoria eliminada con éxito.');
     }
     /*

1020) /var/www/app/Http/Controllers/MeetingSecretaryController.php:259    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /*
      *  Signature sheets
      */
-    public function signaturesheet_list()
+    protected function signaturesheet_list()
     {
         $instance = \Instantiation::instance();
         $signature_sheets = Auth::user()->secretary->signature_sheets;

1021) /var/www/app/Http/Controllers/MeetingSecretaryController.php:265    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $signature_sheets = Auth::user()->secretary->signature_sheets;
-        return view('meeting.signaturesheet_list', ["instance" => $instance, 'signature_sheets' => $signature_sheets]);
+        return view('meeting.signaturesheet_list', ['signature_sheets' => $signature_sheets]);
     }
     public function signaturesheet_create()
     {

1022) /var/www/app/Http/Controllers/MeetingSecretaryController.php:265    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $signature_sheets = Auth::user()->secretary->signature_sheets;
-        return view('meeting.signaturesheet_list', ["instance" => $instance, 'signature_sheets' => $signature_sheets]);
+        view('meeting.signaturesheet_list', ["instance" => $instance, 'signature_sheets' => $signature_sheets]);
+        return null;
     }
     public function signaturesheet_create()
     {

1023) /var/www/app/Http/Controllers/MeetingSecretaryController.php:268    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $signature_sheets = Auth::user()->secretary->signature_sheets;
         return view('meeting.signaturesheet_list', ["instance" => $instance, 'signature_sheets' => $signature_sheets]);
     }
-    public function signaturesheet_create()
+    protected function signaturesheet_create()
     {
         $instance = \Instantiation::instance();
         $available_meeting_requests = Auth::user()->secretary->meeting_requests;

1024) /var/www/app/Http/Controllers/MeetingSecretaryController.php:275    [M] Equal

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $available_meeting_requests = Auth::user()->secretary->meeting_requests;
         $available_meeting_requests = $available_meeting_requests->filter(function ($value, $key) {
-            return $value->signature_sheet == null;
+            return $value->signature_sheet != null;
         });
         return view('meeting.signaturesheet_create', ['instance' => $instance, 'available_meeting_requests' => $available_meeting_requests]);
     }

1025) /var/www/app/Http/Controllers/MeetingSecretaryController.php:278    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $available_meeting_requests = $available_meeting_requests->filter(function ($value, $key) {
             return $value->signature_sheet == null;
         });
-        return view('meeting.signaturesheet_create', ['instance' => $instance, 'available_meeting_requests' => $available_meeting_requests]);
+        return view('meeting.signaturesheet_create', ['available_meeting_requests' => $available_meeting_requests]);
     }
     public function signaturesheet_new(Request $request)
     {

1026) /var/www/app/Http/Controllers/MeetingSecretaryController.php:278    [M] FunctionCall

--- Original
+++ New
@@ @@
         $available_meeting_requests = $available_meeting_requests->filter(function ($value, $key) {
             return $value->signature_sheet == null;
         });
-        return view('meeting.signaturesheet_create', ['instance' => $instance, 'available_meeting_requests' => $available_meeting_requests]);
+        view('meeting.signaturesheet_create', ['instance' => $instance, 'available_meeting_requests' => $available_meeting_requests]);
+        return null;
     }
     public function signaturesheet_new(Request $request)
     {

1027) /var/www/app/Http/Controllers/MeetingSecretaryController.php:281    [M] PublicVisibility

--- Original
+++ New
@@ @@
         });
         return view('meeting.signaturesheet_create', ['instance' => $instance, 'available_meeting_requests' => $available_meeting_requests]);
     }
-    public function signaturesheet_new(Request $request)
+    protected function signaturesheet_new(Request $request)
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);

1028) /var/www/app/Http/Controllers/MeetingSecretaryController.php:285    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function signaturesheet_new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['title' => 'required|min:5|max:255']);
+        $request->validate([]);
         SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }

1029) /var/www/app/Http/Controllers/MeetingSecretaryController.php:285    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function signaturesheet_new(Request $request)
     {
         $instance = \Instantiation::instance();
-        $request->validate(['title' => 'required|min:5|max:255']);
+        
         SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }

1030) /var/www/app/Http/Controllers/MeetingSecretaryController.php:289    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        SignatureSheet::create(['random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1031) /var/www/app/Http/Controllers/MeetingSecretaryController.php:289    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1032) /var/www/app/Http/Controllers/MeetingSecretaryController.php:290    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        SignatureSheet::create(['title' > $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1033) /var/www/app/Http/Controllers/MeetingSecretaryController.php:291    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(3), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1034) /var/www/app/Http/Controllers/MeetingSecretaryController.php:291    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(5), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1035) /var/www/app/Http/Controllers/MeetingSecretaryController.php:291    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' > $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1036) /var/www/app/Http/Controllers/MeetingSecretaryController.php:292    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' > $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1037) /var/www/app/Http/Controllers/MeetingSecretaryController.php:293    [M] ArrayItem

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $request->validate(['title' => 'required|min:5|max:255']);
-        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' => Auth::user()->secretary->id]);
+        SignatureSheet::create(['title' => $request->input('title'), 'random_identifier' => $this->generate_random_identifier_for_signature(4), 'meeting_request_id' => $request->input('meeting_request'), 'secretary_id' > Auth::user()->secretary->id]);
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas creada con éxito.');
     }
     private function generate_random_identifier_for_signature($number) : string

1038) /var/www/app/Http/Controllers/MeetingSecretaryController.php:308    [M] NotEqual

--- Original
+++ New
@@ @@
         // generdor de identificador aleatorio (comprueba si ya está ocupado)
         $random_identifier = \Random::getRandomIdentifier($number);
         $signature_sheet_with_random_identifier = SignatureSheet::where('random_identifier', $random_identifier)->first();
-        if ($signature_sheet_with_random_identifier != null) {
+        if ($signature_sheet_with_random_identifier == null) {
             return $this->generate_random_identifier_for_signature($number);
         }
         return $random_identifier;

1039) /var/www/app/Http/Controllers/MeetingSecretaryController.php:315    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $random_identifier;
     }
-    public function signaturesheet_view($instance, $signature_sheet)
+    protected function signaturesheet_view($instance, $signature_sheet)
     {
         $signature_sheet = SignatureSheet::findOrFail($signature_sheet);
         return view('meeting.signaturesheet_view', ["instance" => $instance, 'signature_sheet' => $signature_sheet]);

1040) /var/www/app/Http/Controllers/MeetingSecretaryController.php:319    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function signaturesheet_view($instance, $signature_sheet)
     {
         $signature_sheet = SignatureSheet::findOrFail($signature_sheet);
-        return view('meeting.signaturesheet_view', ["instance" => $instance, 'signature_sheet' => $signature_sheet]);
+        return view('meeting.signaturesheet_view', ['signature_sheet' => $signature_sheet]);
     }
     public function signaturesheet_edit($instance, $id)
     {

1041) /var/www/app/Http/Controllers/MeetingSecretaryController.php:319    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function signaturesheet_view($instance, $signature_sheet)
     {
         $signature_sheet = SignatureSheet::findOrFail($signature_sheet);
-        return view('meeting.signaturesheet_view', ["instance" => $instance, 'signature_sheet' => $signature_sheet]);
+        view('meeting.signaturesheet_view', ["instance" => $instance, 'signature_sheet' => $signature_sheet]);
+        return null;
     }
     public function signaturesheet_edit($instance, $id)
     {

1042) /var/www/app/Http/Controllers/MeetingSecretaryController.php:322    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $signature_sheet = SignatureSheet::findOrFail($signature_sheet);
         return view('meeting.signaturesheet_view', ["instance" => $instance, 'signature_sheet' => $signature_sheet]);
     }
-    public function signaturesheet_edit($instance, $id)
+    protected function signaturesheet_edit($instance, $id)
     {
         $instance = \Instantiation::instance();
         $signature_sheet = SignatureSheet::findOrFail($id);

1044) /var/www/app/Http/Controllers/MeetingSecretaryController.php:334    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $available_meeting_requests = $available_meeting_requests->filter(function ($value, $key) {
             return $value->signature_sheet == null;
         });
-        return view('meeting.signaturesheet_edit', ['instance' => $instance, 'signature_sheet' => $signature_sheet, 'available_meeting_requests' => $available_meeting_requests, 'edit' => true]);
+        return view('meeting.signaturesheet_edit', ['signature_sheet' => $signature_sheet, 'available_meeting_requests' => $available_meeting_requests, 'edit' => true]);
     }
     public function signaturesheet_save(Request $request)
     {

1045) /var/www/app/Http/Controllers/MeetingSecretaryController.php:334    [M] FunctionCall

--- Original
+++ New
@@ @@
         $available_meeting_requests = $available_meeting_requests->filter(function ($value, $key) {
             return $value->signature_sheet == null;
         });
-        return view('meeting.signaturesheet_edit', ['instance' => $instance, 'signature_sheet' => $signature_sheet, 'available_meeting_requests' => $available_meeting_requests, 'edit' => true]);
+        view('meeting.signaturesheet_edit', ['instance' => $instance, 'signature_sheet' => $signature_sheet, 'available_meeting_requests' => $available_meeting_requests, 'edit' => true]);
+        return null;
     }
     public function signaturesheet_save(Request $request)
     {

1046) /var/www/app/Http/Controllers/MeetingSecretaryController.php:338    [M] TrueValue

--- Original
+++ New
@@ @@
         $available_meeting_requests = $available_meeting_requests->filter(function ($value, $key) {
             return $value->signature_sheet == null;
         });
-        return view('meeting.signaturesheet_edit', ['instance' => $instance, 'signature_sheet' => $signature_sheet, 'available_meeting_requests' => $available_meeting_requests, 'edit' => true]);
+        return view('meeting.signaturesheet_edit', ['instance' => $instance, 'signature_sheet' => $signature_sheet, 'available_meeting_requests' => $available_meeting_requests, 'edit' => false]);
     }
     public function signaturesheet_save(Request $request)
     {

1047) /var/www/app/Http/Controllers/MeetingSecretaryController.php:342    [M] PublicVisibility

--- Original
+++ New
@@ @@
         });
         return view('meeting.signaturesheet_edit', ['instance' => $instance, 'signature_sheet' => $signature_sheet, 'available_meeting_requests' => $available_meeting_requests, 'edit' => true]);
     }
-    public function signaturesheet_save(Request $request)
+    protected function signaturesheet_save(Request $request)
     {
         $instance = \Instantiation::instance();
         $signature_sheet = SignatureSheet::findOrFail($request->input('_id'));

1048) /var/www/app/Http/Controllers/MeetingSecretaryController.php:348    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $signature_sheet = SignatureSheet::findOrFail($request->input('_id'));
-        $request->validate(['title' => 'required|min:5|max:255']);
+        $request->validate([]);
         // actualizamos el título
         $signature_sheet->title = $request->input('title');
         $signature_sheet->save();

1049) /var/www/app/Http/Controllers/MeetingSecretaryController.php:348    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $signature_sheet = SignatureSheet::findOrFail($request->input('_id'));
-        $request->validate(['title' => 'required|min:5|max:255']);
+        
         // actualizamos el título
         $signature_sheet->title = $request->input('title');
         $signature_sheet->save();

1050) /var/www/app/Http/Controllers/MeetingSecretaryController.php:354    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $request->validate(['title' => 'required|min:5|max:255']);
         // actualizamos el título
         $signature_sheet->title = $request->input('title');
-        $signature_sheet->save();
+        
         // actualizamos la convocatoria asociada
         $meeting_request = MeetingRequest::find($request->input('meeting_request_id'));
         if ($meeting_request != null) {

1051) /var/www/app/Http/Controllers/MeetingSecretaryController.php:359    [M] NotEqual

--- Original
+++ New
@@ @@
         $signature_sheet->save();
         // actualizamos la convocatoria asociada
         $meeting_request = MeetingRequest::find($request->input('meeting_request_id'));
-        if ($meeting_request != null) {
+        if ($meeting_request == null) {
             if ($meeting_request->signature_sheet == null) {
                 $signature_sheet->meeting_request_id = $meeting_request->id;
                 $signature_sheet->save();

1052) /var/www/app/Http/Controllers/MeetingSecretaryController.php:360    [M] Equal

--- Original
+++ New
@@ @@
         // actualizamos la convocatoria asociada
         $meeting_request = MeetingRequest::find($request->input('meeting_request_id'));
         if ($meeting_request != null) {
-            if ($meeting_request->signature_sheet == null) {
+            if ($meeting_request->signature_sheet != null) {
                 $signature_sheet->meeting_request_id = $meeting_request->id;
                 $signature_sheet->save();
             }

1053) /var/www/app/Http/Controllers/MeetingSecretaryController.php:362    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($meeting_request != null) {
             if ($meeting_request->signature_sheet == null) {
                 $signature_sheet->meeting_request_id = $meeting_request->id;
-                $signature_sheet->save();
+                
             }
         }
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas actualizada con éxito.');

1054) /var/www/app/Http/Controllers/MeetingSecretaryController.php:371    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas actualizada con éxito.');
     }
-    public function signaturesheet_remove(Request $request)
+    protected function signaturesheet_remove(Request $request)
     {
         $signature_sheet = SignatureSheet::where('id', $request->input('signature_sheet_id'))->first();
         $instance = \Instantiation::instance();

1055) /var/www/app/Http/Controllers/MeetingSecretaryController.php:378    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $signature_sheet = SignatureSheet::where('id', $request->input('signature_sheet_id'))->first();
         $instance = \Instantiation::instance();
-        // eliminamos la entidad en sí
-        $signature_sheet->delete();
+        
         return redirect()->route('secretary.meeting.manage.signaturesheet.list', $instance)->with('success', 'Hoja de firmas eliminada con éxito.');
     }
     /*

1056) /var/www/app/Http/Controllers/MeetingSecretaryController.php:386    [M] PublicVisibility

--- Original
+++ New
@@ @@
     /*
      *  Minutes
      */
-    public function minutes_list()
+    protected function minutes_list()
     {
         $instance = \Instantiation::instance();
         $meeting_minutes = Auth::user()->secretary->meeting_minutes;

1057) /var/www/app/Http/Controllers/MeetingSecretaryController.php:392    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meeting_minutes = Auth::user()->secretary->meeting_minutes;
-        return view('meeting.minutes_list', ["instance" => $instance, 'meeting_minutes' => $meeting_minutes]);
+        return view('meeting.minutes_list', ['meeting_minutes' => $meeting_minutes]);
     }
     public function minutes_create()
     {

1058) /var/www/app/Http/Controllers/MeetingSecretaryController.php:392    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meeting_minutes = Auth::user()->secretary->meeting_minutes;
-        return view('meeting.minutes_list', ["instance" => $instance, 'meeting_minutes' => $meeting_minutes]);
+        view('meeting.minutes_list', ["instance" => $instance, 'meeting_minutes' => $meeting_minutes]);
+        return null;
     }
     public function minutes_create()
     {

1059) /var/www/app/Http/Controllers/MeetingSecretaryController.php:395    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $meeting_minutes = Auth::user()->secretary->meeting_minutes;
         return view('meeting.minutes_list', ["instance" => $instance, 'meeting_minutes' => $meeting_minutes]);
     }
-    public function minutes_create()
+    protected function minutes_create()
     {
         $instance = \Instantiation::instance();
         return redirect()->route('secretary.meeting.manage.minutes.create.step1', ['instance' => $instance]);

1060) /var/www/app/Http/Controllers/MeetingSecretaryController.php:399    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function minutes_create()
     {
         $instance = \Instantiation::instance();
-        return redirect()->route('secretary.meeting.manage.minutes.create.step1', ['instance' => $instance]);
+        return redirect()->route('secretary.meeting.manage.minutes.create.step1', []);
     }
     public function minutes_create_step1()
     {

1061) /var/www/app/Http/Controllers/MeetingSecretaryController.php:402    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         return redirect()->route('secretary.meeting.manage.minutes.create.step1', ['instance' => $instance]);
     }
-    public function minutes_create_step1()
+    protected function minutes_create_step1()
     {
         $instance = \Instantiation::instance();
         $meeting_requests = Auth::user()->secretary->meeting_requests;

1062) /var/www/app/Http/Controllers/MeetingSecretaryController.php:408    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meeting_requests = Auth::user()->secretary->meeting_requests;
-        return view('meeting.minutes_create_step1', ['instance' => $instance, 'meeting_requests' => $meeting_requests]);
+        return view('meeting.minutes_create_step1', ['meeting_requests' => $meeting_requests]);
     }
     public function minutes_create_step1_p(Request $request)
     {

1063) /var/www/app/Http/Controllers/MeetingSecretaryController.php:408    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meeting_requests = Auth::user()->secretary->meeting_requests;
-        return view('meeting.minutes_create_step1', ['instance' => $instance, 'meeting_requests' => $meeting_requests]);
+        view('meeting.minutes_create_step1', ['instance' => $instance, 'meeting_requests' => $meeting_requests]);
+        return null;
     }
     public function minutes_create_step1_p(Request $request)
     {

1064) /var/www/app/Http/Controllers/MeetingSecretaryController.php:414    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $meeting_requests = Auth::user()->secretary->meeting_requests;
         return view('meeting.minutes_create_step1', ['instance' => $instance, 'meeting_requests' => $meeting_requests]);
     }
-    public function minutes_create_step1_p(Request $request)
+    protected function minutes_create_step1_p(Request $request)
     {
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::find($request->input('meeting_request'));

1065) /var/www/app/Http/Controllers/MeetingSecretaryController.php:420    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::find($request->input('meeting_request'));
-        return redirect()->route('secretary.meeting.manage.minutes.create.step2', ['instance' => $instance, 'meeting_request' => $meeting_request]);
+        return redirect()->route('secretary.meeting.manage.minutes.create.step2', ['meeting_request' => $meeting_request]);
     }
     public function minutes_create_step2(Request $request)
     {
