1066) /var/www/app/Http/Controllers/MeetingSecretaryController.php:426    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $meeting_request = MeetingRequest::find($request->input('meeting_request'));
         return redirect()->route('secretary.meeting.manage.minutes.create.step2', ['instance' => $instance, 'meeting_request' => $meeting_request]);
     }
-    public function minutes_create_step2(Request $request)
+    protected function minutes_create_step2(Request $request)
     {
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::find($request->input('meeting_request'));

1067) /var/www/app/Http/Controllers/MeetingSecretaryController.php:434    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::find($request->input('meeting_request'));
         $signature_sheets = Auth::user()->secretary->signature_sheets;
-        return view('meeting.minutes_create_step2', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheets' => $signature_sheets]);
+        return view('meeting.minutes_create_step2', ['meeting_request' => $meeting_request, 'signature_sheets' => $signature_sheets]);
     }
     public function minutes_create_step2_p(Request $request)
     {

1068) /var/www/app/Http/Controllers/MeetingSecretaryController.php:434    [M] FunctionCall

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::find($request->input('meeting_request'));
         $signature_sheets = Auth::user()->secretary->signature_sheets;
-        return view('meeting.minutes_create_step2', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheets' => $signature_sheets]);
+        view('meeting.minutes_create_step2', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheets' => $signature_sheets]);
+        return null;
     }
     public function minutes_create_step2_p(Request $request)
     {

1069) /var/www/app/Http/Controllers/MeetingSecretaryController.php:441    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $signature_sheets = Auth::user()->secretary->signature_sheets;
         return view('meeting.minutes_create_step2', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheets' => $signature_sheets]);
     }
-    public function minutes_create_step2_p(Request $request)
+    protected function minutes_create_step2_p(Request $request)
     {
         $instance = \Instantiation::instance();
         $meeting_request_input = $request->input('meeting_request');

1070) /var/www/app/Http/Controllers/MeetingSecretaryController.php:451    [M] NotEqual

--- Original
+++ New
@@ @@
         $signature_sheet_input = $request->input('signature_sheet');
         $meeting_request = MeetingRequest::find($meeting_request_input);
         $signature_sheet = SignatureSheet::find($signature_sheet_input);
-        if ($signature_sheet != null) {
+        if ($signature_sheet == null) {
             // si la hoja de firmas tiene una convocatoria asociada, se descarta cualquier otra elegida
             // por el secretario
             if ($signature_sheet->meeting_request != null) {

1071) /var/www/app/Http/Controllers/MeetingSecretaryController.php:455    [M] NotEqual

--- Original
+++ New
@@ @@
         if ($signature_sheet != null) {
             // si la hoja de firmas tiene una convocatoria asociada, se descarta cualquier otra elegida
             // por el secretario
-            if ($signature_sheet->meeting_request != null) {
+            if ($signature_sheet->meeting_request == null) {
                 $meeting_request = $signature_sheet->meeting_request;
             }
         }

1072) /var/www/app/Http/Controllers/MeetingSecretaryController.php:461    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $meeting_request = $signature_sheet->meeting_request;
             }
         }
-        return redirect()->route('secretary.meeting.manage.minutes.create.step3', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet]);
+        return redirect()->route('secretary.meeting.manage.minutes.create.step3', ['meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet]);
     }
     public function minutes_create_step3(Request $request)
     {

1073) /var/www/app/Http/Controllers/MeetingSecretaryController.php:468    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return redirect()->route('secretary.meeting.manage.minutes.create.step3', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet]);
     }
-    public function minutes_create_step3(Request $request)
+    protected function minutes_create_step3(Request $request)
     {
         $instance = \Instantiation::instance();
         $meeting_request = MeetingRequest::find($request->input('meeting_request'));

1074) /var/www/app/Http/Controllers/MeetingSecretaryController.php:478    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $signature_sheet = SignatureSheet::find($request->input('signature_sheet'));
         $users = $this->user_service->all_except_logged();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('meeting.minutes_create_step3', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet, 'users' => $users, 'defaultlists' => $defaultlists]);
+        return view('meeting.minutes_create_step3', ['meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet, 'users' => $users, 'defaultlists' => $defaultlists]);
     }
     public function minutes_create_step3_p(Request $request)
     {

1075) /var/www/app/Http/Controllers/MeetingSecretaryController.php:478    [M] FunctionCall

--- Original
+++ New
@@ @@
         $signature_sheet = SignatureSheet::find($request->input('signature_sheet'));
         $users = $this->user_service->all_except_logged();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('meeting.minutes_create_step3', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet, 'users' => $users, 'defaultlists' => $defaultlists]);
+        view('meeting.minutes_create_step3', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet, 'users' => $users, 'defaultlists' => $defaultlists]);
+        return null;
     }
     public function minutes_create_step3_p(Request $request)
     {

1076) /var/www/app/Http/Controllers/MeetingSecretaryController.php:487    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $defaultlists = Auth::user()->secretary->default_lists;
         return view('meeting.minutes_create_step3', ['instance' => $instance, 'meeting_request' => $meeting_request, 'signature_sheet' => $signature_sheet, 'users' => $users, 'defaultlists' => $defaultlists]);
     }
-    public function minutes_create_step3_p(Request $request)
+    protected function minutes_create_step3_p(Request $request)
     {
         $instance = \Instantiation::instance();
         $minutes = $request->input('minutes');

1080) /var/www/app/Http/Controllers/MeetingSecretaryController.php:506    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         if ($validator->fails()) {
             $points = json_decode($request->input('points_json'), true);
-            return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' => collect($points)]);
+            return back()->withErrors($validator)->withInput()->with(['points' => collect($points)]);
         }
         $meeting->comittee()->associate(Auth::user()->secretary->comittee);

1081) /var/www/app/Http/Controllers/MeetingSecretaryController.php:508    [M] ArrayItem

--- Original
+++ New
@@ @@
         if ($validator->fails()) {
             $points = json_decode($request->input('points_json'), true);
-            return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' => collect($points)]);
+            return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' > collect($points)]);
         }
         $meeting->comittee()->associate(Auth::user()->secretary->comittee);

1104) /var/www/app/Http/Controllers/MeetingSecretaryController.php:521    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             return back()->withErrors($validator)->withInput()->with(['error' => 'Hay errores en el formulario.', 'points' => collect($points)]);
         }
-        $meeting->comittee()->associate(Auth::user()->secretary->comittee);
+        
         $meeting->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);

1105) /var/www/app/Http/Controllers/MeetingSecretaryController.php:523    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         $meeting->comittee()->associate(Auth::user()->secretary->comittee);
-        $meeting->save();
+        
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);
         foreach ($users_ids as $user_id) {

1107) /var/www/app/Http/Controllers/MeetingSecretaryController.php:530    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $users_ids = $request->input('users', []);
         foreach ($users_ids as $user_id) {
             $user = User::find($user_id);
-            $meeting->users()->attach($user);
+            
         }
         // Añadimos el secretario a la reunión
         $meeting->users()->attach(Auth::user()->secretary->user);

1108) /var/www/app/Http/Controllers/MeetingSecretaryController.php:535    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $user = User::find($user_id);
             $meeting->users()->attach($user);
         }
-        // Añadimos el secretario a la reunión
-        $meeting->users()->attach(Auth::user()->secretary->user);
+        
         // Guardamos los puntos y los acuerdos tomados
         $meeting_minutes = MeetingMinutes::create(['meeting_id' => $meeting->id, 'secretary_id' => Auth::user()->secretary->id]);
         $points = json_decode($request->input('points_json'), true);

1109) /var/www/app/Http/Controllers/MeetingSecretaryController.php:538    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // Añadimos el secretario a la reunión
         $meeting->users()->attach(Auth::user()->secretary->user);
         // Guardamos los puntos y los acuerdos tomados
-        $meeting_minutes = MeetingMinutes::create(['meeting_id' => $meeting->id, 'secretary_id' => Auth::user()->secretary->id]);
+        $meeting_minutes = MeetingMinutes::create(['secretary_id' => Auth::user()->secretary->id]);
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {

1110) /var/www/app/Http/Controllers/MeetingSecretaryController.php:539    [M] ArrayItem

--- Original
+++ New
@@ @@
         // Añadimos el secretario a la reunión
         $meeting->users()->attach(Auth::user()->secretary->user);
         // Guardamos los puntos y los acuerdos tomados
-        $meeting_minutes = MeetingMinutes::create(['meeting_id' => $meeting->id, 'secretary_id' => Auth::user()->secretary->id]);
+        $meeting_minutes = MeetingMinutes::create(['meeting_id' > $meeting->id, 'secretary_id' => Auth::user()->secretary->id]);
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {

1111) /var/www/app/Http/Controllers/MeetingSecretaryController.php:540    [M] ArrayItem

--- Original
+++ New
@@ @@
         // Añadimos el secretario a la reunión
         $meeting->users()->attach(Auth::user()->secretary->user);
         // Guardamos los puntos y los acuerdos tomados
-        $meeting_minutes = MeetingMinutes::create(['meeting_id' => $meeting->id, 'secretary_id' => Auth::user()->secretary->id]);
+        $meeting_minutes = MeetingMinutes::create(['meeting_id' => $meeting->id, 'secretary_id' > Auth::user()->secretary->id]);
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {

1112) /var/www/app/Http/Controllers/MeetingSecretaryController.php:546    [M] Foreach_

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::create(['meeting_id' => $meeting->id, 'secretary_id' => Auth::user()->secretary->id]);
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
-        foreach ($points as $point) {
+        foreach (array() as $point) {
             $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);

1113) /var/www/app/Http/Controllers/MeetingSecretaryController.php:547    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {
-            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
+            $new_point = Point::create(['title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo

1114) /var/www/app/Http/Controllers/MeetingSecretaryController.php:548    [M] ArrayItem

--- Original
+++ New
@@ @@
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {
-            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
+            $new_point = Point::create(['meeting_minutes_id' > $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo

1115) /var/www/app/Http/Controllers/MeetingSecretaryController.php:550    [M] Equal

--- Original
+++ New
@@ @@
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {
-            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
+            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] != '' ? 0 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo

1116) /var/www/app/Http/Controllers/MeetingSecretaryController.php:550    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {
-            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
+            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? -1 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo

1117) /var/www/app/Http/Controllers/MeetingSecretaryController.php:550    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {
-            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
+            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 1 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo

1118) /var/www/app/Http/Controllers/MeetingSecretaryController.php:550    [M] Ternary

--- Original
+++ New
@@ @@
         $points = json_decode($request->input('points_json'), true);
         $points = collect($points);
         foreach ($points as $point) {
-            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
+            $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? $point['duration'] : 0, 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo

1119) /var/www/app/Http/Controllers/MeetingSecretaryController.php:554    [M] Foreach_

--- Original
+++ New
@@ @@
         $points = collect($points);
         foreach ($points as $point) {
             $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
-            foreach ($point['agreements'] as $agreement) {
+            foreach (array() as $agreement) {
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo
                 $identificator = "ISD";

1120) /var/www/app/Http/Controllers/MeetingSecretaryController.php:556    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         foreach ($points as $point) {
             $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
-                $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
+                $new_agreement = Agreement::create(['description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo
                 $identificator = "ISD";
                 $identificator .= '-';

1121) /var/www/app/Http/Controllers/MeetingSecretaryController.php:557    [M] ArrayItem

--- Original
+++ New
@@ @@
         foreach ($points as $point) {
             $new_point = Point::create(['meeting_minutes_id' => $meeting_minutes->id, 'title' => $point['title'], 'duration' => $point['duration'] == '' ? 0 : $point['duration'], 'description' => $point['description']]);
             foreach ($point['agreements'] as $agreement) {
-                $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
+                $new_agreement = Agreement::create(['point_id' > $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo
                 $identificator = "ISD";
                 $identificator .= '-';

1122) /var/www/app/Http/Controllers/MeetingSecretaryController.php:563    [M] Assignment

--- Original
+++ New
@@ @@
                 $new_agreement = Agreement::create(['point_id' => $new_point->id, 'description' => $agreement['description']]);
                 // generamos el identificador único para este acuerdo
                 $identificator = "ISD";
-                $identificator .= '-';
+                $identificator = '-';
                 $identificator .= Carbon::now()->format('Y-m-d');
                 $identificator .= '-';
                 $identificator .= Auth::user()->secretary->comittee->id;

1123) /var/www/app/Http/Controllers/MeetingSecretaryController.php:564    [M] Assignment

--- Original
+++ New
@@ @@
                 // generamos el identificador único para este acuerdo
                 $identificator = "ISD";
                 $identificator .= '-';
-                $identificator .= Carbon::now()->format('Y-m-d');
+                $identificator = Carbon::now()->format('Y-m-d');
                 $identificator .= '-';
                 $identificator .= Auth::user()->secretary->comittee->id;
                 $identificator .= '-';

1124) /var/www/app/Http/Controllers/MeetingSecretaryController.php:565    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator = "ISD";
                 $identificator .= '-';
                 $identificator .= Carbon::now()->format('Y-m-d');
-                $identificator .= '-';
+                $identificator = '-';
                 $identificator .= Auth::user()->secretary->comittee->id;
                 $identificator .= '-';
                 $identificator .= $meeting->id;

1125) /var/www/app/Http/Controllers/MeetingSecretaryController.php:566    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator .= '-';
                 $identificator .= Carbon::now()->format('Y-m-d');
                 $identificator .= '-';
-                $identificator .= Auth::user()->secretary->comittee->id;
+                $identificator = Auth::user()->secretary->comittee->id;
                 $identificator .= '-';
                 $identificator .= $meeting->id;
                 $identificator .= '-';

1126) /var/www/app/Http/Controllers/MeetingSecretaryController.php:567    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator .= Carbon::now()->format('Y-m-d');
                 $identificator .= '-';
                 $identificator .= Auth::user()->secretary->comittee->id;
-                $identificator .= '-';
+                $identificator = '-';
                 $identificator .= $meeting->id;
                 $identificator .= '-';
                 $identificator .= $new_point->id;

1127) /var/www/app/Http/Controllers/MeetingSecretaryController.php:568    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator .= '-';
                 $identificator .= Auth::user()->secretary->comittee->id;
                 $identificator .= '-';
-                $identificator .= $meeting->id;
+                $identificator = $meeting->id;
                 $identificator .= '-';
                 $identificator .= $new_point->id;
                 $identificator .= '-';

1128) /var/www/app/Http/Controllers/MeetingSecretaryController.php:569    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator .= Auth::user()->secretary->comittee->id;
                 $identificator .= '-';
                 $identificator .= $meeting->id;
-                $identificator .= '-';
+                $identificator = '-';
                 $identificator .= $new_point->id;
                 $identificator .= '-';
                 $identificator .= $new_agreement->id;

1129) /var/www/app/Http/Controllers/MeetingSecretaryController.php:570    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator .= '-';
                 $identificator .= $meeting->id;
                 $identificator .= '-';
-                $identificator .= $new_point->id;
+                $identificator = $new_point->id;
                 $identificator .= '-';
                 $identificator .= $new_agreement->id;
                 $new_agreement->identificator = $identificator;

1130) /var/www/app/Http/Controllers/MeetingSecretaryController.php:571    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator .= $meeting->id;
                 $identificator .= '-';
                 $identificator .= $new_point->id;
-                $identificator .= '-';
+                $identificator = '-';
                 $identificator .= $new_agreement->id;
                 $new_agreement->identificator = $identificator;
                 $new_agreement->save();

1131) /var/www/app/Http/Controllers/MeetingSecretaryController.php:572    [M] Assignment

--- Original
+++ New
@@ @@
                 $identificator .= '-';
                 $identificator .= $new_point->id;
                 $identificator .= '-';
-                $identificator .= $new_agreement->id;
+                $identificator = $new_agreement->id;
                 $new_agreement->identificator = $identificator;
                 $new_agreement->save();
             }

1132) /var/www/app/Http/Controllers/MeetingSecretaryController.php:575    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $identificator .= '-';
                 $identificator .= $new_agreement->id;
                 $new_agreement->identificator = $identificator;
-                $new_agreement->save();
+                
             }
         }
         // Genera PDF del acta

1133) /var/www/app/Http/Controllers/MeetingSecretaryController.php:580    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
         }
         // Genera PDF del acta
-        $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
+        $pdf = PDF::loadView('meeting.minutes_template', []);
         $content = $pdf->download()->getOriginalContent();
         Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');

1134) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] Concat

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        Storage::put('/meeting_minutes/meeting_minutes_' . \Instantiation::instance() . $meeting_minutes->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)

1135) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        Storage::put('/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)
