1136) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . $meeting_minutes->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)

1137) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] Concat

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . $meeting_minutes->id . '/meeting_minutes/meeting_minutes_' . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)

1138) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)

1139) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] Concat

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf' . $meeting_minutes->id, $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)

1140) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id, $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)

1141) /var/www/app/Http/Controllers/MeetingSecretaryController.php:582    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // Genera PDF del acta
         $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
         $content = $pdf->download()->getOriginalContent();
-        Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
+        
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
     public function minutes_edit($instance, $id)

1142) /var/www/app/Http/Controllers/MeetingSecretaryController.php:588    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión creada con éxito.');
     }
-    public function minutes_edit($instance, $id)
+    protected function minutes_edit($instance, $id)
     {
         $instance = \Instantiation::instance();
         $meeting_minutes = MeetingMinutes::findOrFail($id);

1143) /var/www/app/Http/Controllers/MeetingSecretaryController.php:596    [M] Foreach_

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $meeting_minutes = MeetingMinutes::findOrFail($id);
         $points_array = array();
-        foreach ($meeting_minutes->points as $point) {
+        foreach (array() as $point) {
             $agreements_array = array();
             foreach ($point->agreements as $agreement) {
                 $agreement_array = array('description' => $agreement->description);

1144) /var/www/app/Http/Controllers/MeetingSecretaryController.php:600    [M] Foreach_

--- Original
+++ New
@@ @@
         $points_array = array();
         foreach ($meeting_minutes->points as $point) {
             $agreements_array = array();
-            foreach ($point->agreements as $agreement) {
+            foreach (array() as $agreement) {
                 $agreement_array = array('description' => $agreement->description);
                 array_push($agreements_array, $agreement_array);
             }

1145) /var/www/app/Http/Controllers/MeetingSecretaryController.php:601    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         foreach ($meeting_minutes->points as $point) {
             $agreements_array = array();
             foreach ($point->agreements as $agreement) {
-                $agreement_array = array('description' => $agreement->description);
+                $agreement_array = array();
                 array_push($agreements_array, $agreement_array);
             }
             $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);

1146) /var/www/app/Http/Controllers/MeetingSecretaryController.php:602    [M] ArrayItem

--- Original
+++ New
@@ @@
         foreach ($meeting_minutes->points as $point) {
             $agreements_array = array();
             foreach ($point->agreements as $agreement) {
-                $agreement_array = array('description' => $agreement->description);
+                $agreement_array = array('description' > $agreement->description);
                 array_push($agreements_array, $agreement_array);
             }
             $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);

1147) /var/www/app/Http/Controllers/MeetingSecretaryController.php:604    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
             $agreements_array = array();
             foreach ($point->agreements as $agreement) {
                 $agreement_array = array('description' => $agreement->description);
-                array_push($agreements_array, $agreement_array);
+                
             }
             $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
             array_push($points_array, $point_array);

1148) /var/www/app/Http/Controllers/MeetingSecretaryController.php:607    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $agreement_array = array('description' => $agreement->description);
                 array_push($agreements_array, $agreement_array);
             }
-            $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
+            $point_array = array('title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
             array_push($points_array, $point_array);
         }
         $points = collect($points_array);

1149) /var/www/app/Http/Controllers/MeetingSecretaryController.php:608    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $agreement_array = array('description' => $agreement->description);
                 array_push($agreements_array, $agreement_array);
             }
-            $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
+            $point_array = array('id' > $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
             array_push($points_array, $point_array);
         }
         $points = collect($points_array);

1150) /var/www/app/Http/Controllers/MeetingSecretaryController.php:609    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $agreement_array = array('description' => $agreement->description);
                 array_push($agreements_array, $agreement_array);
             }
-            $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
+            $point_array = array('id' => $point->id, 'title' > $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
             array_push($points_array, $point_array);
         }
         $points = collect($points_array);

1151) /var/www/app/Http/Controllers/MeetingSecretaryController.php:610    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $agreement_array = array('description' => $agreement->description);
                 array_push($agreements_array, $agreement_array);
             }
-            $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
+            $point_array = array('id' => $point->id, 'title' => $point->title, 'description' > $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
             array_push($points_array, $point_array);
         }
         $points = collect($points_array);

1152) /var/www/app/Http/Controllers/MeetingSecretaryController.php:611    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $agreement_array = array('description' => $agreement->description);
                 array_push($agreements_array, $agreement_array);
             }
-            $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
+            $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' > $point->duration, 'agreements' => $agreements_array);
             array_push($points_array, $point_array);
         }
         $points = collect($points_array);

1153) /var/www/app/Http/Controllers/MeetingSecretaryController.php:615    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                 array_push($agreements_array, $agreement_array);
             }
             $point_array = array('id' => $point->id, 'title' => $point->title, 'description' => $point->description, 'duration' => $point->duration, 'agreements' => $agreements_array);
-            array_push($points_array, $point_array);
+            
         }
         $points = collect($points_array);
         $users = $this->user_service->all_except_logged();

1154) /var/www/app/Http/Controllers/MeetingSecretaryController.php:623    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $points = collect($points_array);
         $users = $this->user_service->all_except_logged();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('meeting.minutes_edit', ['instance' => $instance, 'meeting_minutes' => $meeting_minutes, 'points' => $points, 'users' => $users, 'defaultlists' => $defaultlists]);
+        return view('meeting.minutes_edit', ['meeting_minutes' => $meeting_minutes, 'points' => $points, 'users' => $users, 'defaultlists' => $defaultlists]);
     }
     public function minutes_save(Request $request)
     {

1155) /var/www/app/Http/Controllers/MeetingSecretaryController.php:623    [M] FunctionCall

--- Original
+++ New
@@ @@
         $points = collect($points_array);
         $users = $this->user_service->all_except_logged();
         $defaultlists = Auth::user()->secretary->default_lists;
-        return view('meeting.minutes_edit', ['instance' => $instance, 'meeting_minutes' => $meeting_minutes, 'points' => $points, 'users' => $users, 'defaultlists' => $defaultlists]);
+        view('meeting.minutes_edit', ['instance' => $instance, 'meeting_minutes' => $meeting_minutes, 'points' => $points, 'users' => $users, 'defaultlists' => $defaultlists]);
+        return null;
     }
     public function minutes_save(Request $request)
     {

1156) /var/www/app/Http/Controllers/MeetingSecretaryController.php:633    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $defaultlists = Auth::user()->secretary->default_lists;
         return view('meeting.minutes_edit', ['instance' => $instance, 'meeting_minutes' => $meeting_minutes, 'points' => $points, 'users' => $users, 'defaultlists' => $defaultlists]);
     }
-    public function minutes_save(Request $request)
+    protected function minutes_save(Request $request)
     {
         $instance = \Instantiation::instance();
         $minutes = $request->input('minutes');

1162) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] DecrementInteger

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 99 / 60) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1163) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] IncrementInteger

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 101 / 60) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1164) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] Multiplication

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes / 100 / 60) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1165) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] DecrementInteger

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 59) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1166) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] IncrementInteger

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 61) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1167) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] Division

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 100 * 60) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1168) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] RoundingFamily

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + ceil($minutes * 100 / 60) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1169) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] RoundingFamily

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + round($minutes * 100 / 60) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1170) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] DecrementInteger

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 99;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1171) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] IncrementInteger

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 101;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1172) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] Division

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) * 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1173) /var/www/app/Http/Controllers/MeetingSecretaryController.php:661    [M] Plus

--- Original
+++ New
@@ @@
         // modificamos la info básica de la reunión
         $meeting = Meeting::where('id', $request->input('meeting_id'))->first();
         $meeting->title = $request->input('title');
-        $meeting->hours = $request->input('hours') + floor($minutes * 100 / 60) / 100;
+        $meeting->hours = $request->input('hours') - floor($minutes * 100 / 60) / 100;
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');

1174) /var/www/app/Http/Controllers/MeetingSecretaryController.php:665    [M] Concat

--- Original
+++ New
@@ @@
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');
-        $meeting->datetime = $request->input('date') . " " . $request->input('time');
+        $meeting->datetime = " " . $request->input('date') . $request->input('time');
         $meeting->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);

1175) /var/www/app/Http/Controllers/MeetingSecretaryController.php:665    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');
-        $meeting->datetime = $request->input('date') . " " . $request->input('time');
+        $meeting->datetime = " " . $request->input('time');
         $meeting->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);

1176) /var/www/app/Http/Controllers/MeetingSecretaryController.php:665    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');
-        $meeting->datetime = $request->input('date') . " " . $request->input('time');
+        $meeting->datetime = $request->input('date') . $request->input('time');
         $meeting->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);

1177) /var/www/app/Http/Controllers/MeetingSecretaryController.php:665    [M] Concat

--- Original
+++ New
@@ @@
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');
-        $meeting->datetime = $request->input('date') . " " . $request->input('time');
+        $meeting->datetime = $request->input('date') . $request->input('time') . " ";
         $meeting->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);

1178) /var/www/app/Http/Controllers/MeetingSecretaryController.php:665    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting->type = $request->input('type');
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');
-        $meeting->datetime = $request->input('date') . " " . $request->input('time');
+        $meeting->datetime = $request->input('date') . " ";
         $meeting->save();
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);

1179) /var/www/app/Http/Controllers/MeetingSecretaryController.php:666    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $meeting->modality = $request->input('modality');
         $meeting->place = $request->input('place');
         $meeting->datetime = $request->input('date') . " " . $request->input('time');
-        $meeting->save();
+        
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);
         // eliminamos usuarios antiguos de la reunión

1180) /var/www/app/Http/Controllers/MeetingSecretaryController.php:672    [M] Foreach_

--- Original
+++ New
@@ @@
         // Asociamos los usuarios a la reunión
         $users_ids = $request->input('users', []);
         // eliminamos usuarios antiguos de la reunión
-        foreach ($meeting->users as $user) {
+        foreach (array() as $user) {
             $meeting->users()->detach($user);
         }
         // agregamos los usuarios nuevos de la reunión

1181) /var/www/app/Http/Controllers/MeetingSecretaryController.php:673    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $users_ids = $request->input('users', []);
         // eliminamos usuarios antiguos de la reunión
         foreach ($meeting->users as $user) {
-            $meeting->users()->detach($user);
+            
         }
         // agregamos los usuarios nuevos de la reunión
         foreach ($users_ids as $user_id) {

1182) /var/www/app/Http/Controllers/MeetingSecretaryController.php:677    [M] Foreach_

--- Original
+++ New
@@ @@
             $meeting->users()->detach($user);
         }
         // agregamos los usuarios nuevos de la reunión
-        foreach ($users_ids as $user_id) {
+        foreach (array() as $user_id) {
             $user = User::find($user_id);
             $meeting->users()->attach($user);
         }

1184) /var/www/app/Http/Controllers/MeetingSecretaryController.php:684    [M] Foreach_

--- Original
+++ New
@@ @@
         }
         // borramos los puntos y acuerdos previos
         if ($meeting->meeting_minutes->points) {
-            foreach ($meeting->meeting_minutes->points as $point) {
+            foreach (array() as $point) {
                 foreach ($point->agreements as $agreement) {
                     $agreement->delete();
                 }

1185) /var/www/app/Http/Controllers/MeetingSecretaryController.php:685    [M] Foreach_

--- Original
+++ New
@@ @@
         // borramos los puntos y acuerdos previos
         if ($meeting->meeting_minutes->points) {
             foreach ($meeting->meeting_minutes->points as $point) {
-                foreach ($point->agreements as $agreement) {
+                foreach (array() as $agreement) {
                     $agreement->delete();
                 }
                 $point->delete();

1186) /var/www/app/Http/Controllers/MeetingSecretaryController.php:686    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ($meeting->meeting_minutes->points) {
             foreach ($meeting->meeting_minutes->points as $point) {
                 foreach ($point->agreements as $agreement) {
-                    $agreement->delete();
+                    
                 }
                 $point->delete();
             }

1187) /var/www/app/Http/Controllers/MeetingSecretaryController.php:688    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 foreach ($point->agreements as $agreement) {
                     $agreement->delete();
                 }
-                $point->delete();
+                
             }
         }
         // borramos el pdf del acta antigua

1188) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] Concat

--- Original
+++ New
@@ @@
             }
         }
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        Storage::delete('/meeting_minutes/meeting_minutes_' . \Instantiation::instance() . $meeting->meeting_minutes->id . '.pdf');
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión
