1189) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
         }
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        Storage::delete('/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión

1190) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
         }
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting->meeting_minutes->id . '.pdf');
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión

1191) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] Concat

--- Original
+++ New
@@ @@
             }
         }
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting->meeting_minutes->id . '/meeting_minutes/meeting_minutes_' . '.pdf');
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión

1192) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
         }
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf');
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión

1193) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] Concat

--- Original
+++ New
@@ @@
             }
         }
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf' . $meeting->meeting_minutes->id);
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión

1194) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             }
         }
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id);
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión

1195) /var/www/app/Http/Controllers/MeetingSecretaryController.php:693    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $point->delete();
             }
         }
-        // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
+        
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
         // Añadimos el secretario a la reunión

1196) /var/www/app/Http/Controllers/MeetingSecretaryController.php:696    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         }
         // borramos el pdf del acta antigua
         Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
-        // borramos el acta antigua
-        $meeting->meeting_minutes->delete();
+        
         // Añadimos el secretario a la reunión
         $meeting->users()->attach(Auth::user()->secretary->user);
         // Guardamos los puntos y los acuerdos tomados

1197) /var/www/app/Http/Controllers/MeetingSecretaryController.php:699    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting->meeting_minutes->id . '.pdf');
         // borramos el acta antigua
         $meeting->meeting_minutes->delete();
-        // Añadimos el secretario a la reunión
-        $meeting->users()->attach(Auth::user()->secretary->user);
+        
         // Guardamos los puntos y los acuerdos tomados
         $meeting_minutes = MeetingMinutes::create(['meeting_id' => $meeting->id, 'secretary_id' => Auth::user()->secretary->id]);
         $points = json_decode($request->input('points_json'), true);

1222) /var/www/app/Http/Controllers/MeetingSecretaryController.php:744    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
         }
         // Generamos de nuevo el PDF
-        $pdf = PDF::loadView('meeting.minutes_template', ['meeting_minutes' => $meeting_minutes]);
+        $pdf = PDF::loadView('meeting.minutes_template', []);
         $content = $pdf->download()->getOriginalContent();
         Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión editada con éxito.');

1231) /var/www/app/Http/Controllers/MeetingSecretaryController.php:751    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Storage::put(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf', $content);
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión editada con éxito.');
     }
-    public function minutes_remove(Request $request)
+    protected function minutes_remove(Request $request)
     {
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();

1232) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        Storage::delete('/meeting_minutes/meeting_minutes_' . \Instantiation::instance() . $meeting_minutes->id . '.pdf');
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1233) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        Storage::delete('/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1234) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting_minutes->id . '.pdf');
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1235) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . $meeting_minutes->id . '/meeting_minutes/meeting_minutes_' . '.pdf');
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1236) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf');
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1237) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] Concat

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . '.pdf' . $meeting_minutes->id);
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1238) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id);
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1239) /var/www/app/Http/Controllers/MeetingSecretaryController.php:758    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $meeting_minutes = MeetingMinutes::where('id', $request->input('meeting_minutes_id'))->first();
         $instance = \Instantiation::instance();
-        // borramos el pdf del acta antigua
-        Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
+        
         $meeting_minutes->meeting->delete();
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');

1240) /var/www/app/Http/Controllers/MeetingSecretaryController.php:760    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         // borramos el pdf del acta antigua
         Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
-        $meeting_minutes->meeting->delete();
+        
         $meeting_minutes->delete();
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');
     }

1241) /var/www/app/Http/Controllers/MeetingSecretaryController.php:761    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         // borramos el pdf del acta antigua
         Storage::delete(\Instantiation::instance() . '/meeting_minutes/meeting_minutes_' . $meeting_minutes->id . '.pdf');
         $meeting_minutes->meeting->delete();
-        $meeting_minutes->delete();
+        
         return redirect()->route('secretary.meeting.manage.minutes.list', $instance)->with('success', 'Acta de reunión eliminada con éxito.');
     }
     public function minutes_download($instance, $id)

1251) /var/www/app/Http/Controllers/MeetingSecretaryController.php:779    [M] PublicVisibility

--- Original
+++ New
@@ @@
         ob_end_clean();
         return $response;
     }
-    public function meeting_requests_export($instance, $ext)
+    protected function meeting_requests_export($instance, $ext)
     {
         try {
             ob_end_clean();

1255) /var/www/app/Http/Controllers/MeetingSecretaryController.php:786    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingRequestExport(), \Illuminate\Support\Carbon::now() . 'convocatorias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1256) /var/www/app/Http/Controllers/MeetingSecretaryController.php:786    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingRequestExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1257) /var/www/app/Http/Controllers/MeetingSecretaryController.php:786    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1258) /var/www/app/Http/Controllers/MeetingSecretaryController.php:786    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1259) /var/www/app/Http/Controllers/MeetingSecretaryController.php:786    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1260) /var/www/app/Http/Controllers/MeetingSecretaryController.php:786    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1261) /var/www/app/Http/Controllers/MeetingSecretaryController.php:786    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingRequestExport(), 'convocatorias-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1265) /var/www/app/Http/Controllers/MeetingSecretaryController.php:792    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
-    public function signaturesheet_export($instance, $ext)
+    protected function signaturesheet_export($instance, $ext)
     {
         try {
             ob_end_clean();

1269) /var/www/app/Http/Controllers/MeetingSecretaryController.php:799    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new SignaturesheetExport(), \Illuminate\Support\Carbon::now() . 'firmas-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1270) /var/www/app/Http/Controllers/MeetingSecretaryController.php:799    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new SignaturesheetExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1271) /var/www/app/Http/Controllers/MeetingSecretaryController.php:799    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new SignaturesheetExport(), 'firmas-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1272) /var/www/app/Http/Controllers/MeetingSecretaryController.php:799    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new SignaturesheetExport(), 'firmas-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1273) /var/www/app/Http/Controllers/MeetingSecretaryController.php:799    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1274) /var/www/app/Http/Controllers/MeetingSecretaryController.php:799    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1275) /var/www/app/Http/Controllers/MeetingSecretaryController.php:799    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new SignaturesheetExport(), 'firmas-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1279) /var/www/app/Http/Controllers/MeetingSecretaryController.php:805    [M] PublicVisibility

--- Original
+++ New
@@ @@
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
     }
-    public function meeting_minutes_export($instance, $ext)
+    protected function meeting_minutes_export($instance, $ext)
     {
         try {
             ob_end_clean();

1283) /var/www/app/Http/Controllers/MeetingSecretaryController.php:812    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingMinutesExport(), \Illuminate\Support\Carbon::now() . 'actas-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1284) /var/www/app/Http/Controllers/MeetingSecretaryController.php:812    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingMinutesExport(), \Illuminate\Support\Carbon::now() . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1285) /var/www/app/Http/Controllers/MeetingSecretaryController.php:812    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingMinutesExport(), 'actas-' . '.' . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1286) /var/www/app/Http/Controllers/MeetingSecretaryController.php:812    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingMinutesExport(), 'actas-' . '.' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1287) /var/www/app/Http/Controllers/MeetingSecretaryController.php:812    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . $ext);
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1288) /var/www/app/Http/Controllers/MeetingSecretaryController.php:812    [M] Concat

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . $ext . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }

1289) /var/www/app/Http/Controllers/MeetingSecretaryController.php:812    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!in_array($ext, ['csv', 'pdf', 'xlsx'])) {
                 return back()->with('error', 'Solo se permite exportar los siguientes formatos: csv, pdf y xlsx');
             }
-            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.' . $ext);
+            return Excel::download(new MeetingMinutesExport(), 'actas-' . \Illuminate\Support\Carbon::now() . '.');
         } catch (\Exception $e) {
             return back()->with('error', 'Ocurrió un error: ' . $e->getMessage());
         }
