1293) /var/www/app/Http/Controllers/MeetingSecretaryController.php:901    [M] PublicVisibility

--- Original
+++ New
@@ @@
             ['instance' => $instance, 'meeting' => $meeting, 'edit' => true, 'users' => $users, 'defaultlists' => $defaultlists, 'route' => route('secretary.meeting.save',$instance)]);
     }
     */
-    public function defaultlist($instance, $id)
+    protected function defaultlist($instance, $id)
     {
         return DefaultList::find($id)->users;
     }

1294) /var/www/app/Http/Controllers/MessageController.php:10    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Http\Request;
 class MessageController extends Controller
 {
-    public function mailbox()
+    protected function mailbox()
     {
         $instance = \Instantiation::instance();
         return view('message.mailbox', ['instance' => $instance]);
     }
 }

1295) /var/www/app/Http/Controllers/MessageController.php:13    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function mailbox()
     {
         $instance = \Instantiation::instance();
-        return view('message.mailbox', ['instance' => $instance]);
+        view('message.mailbox', ['instance' => $instance]);
+        return null;
     }
 }

1296) /var/www/app/Http/Controllers/MessageController.php:14    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function mailbox()
     {
         $instance = \Instantiation::instance();
-        return view('message.mailbox', ['instance' => $instance]);
+        return view('message.mailbox', []);
     }
 }

1297) /var/www/app/Http/Controllers/MetaHomeController.php:27    [M] ArrayItem

--- Original
+++ New
@@ @@
         }
         // si estoy logueado
         if (Auth::check()) {
-            return redirect()->route('instance.login', ['instance' => $instance->route]);
+            return redirect()->route('instance.login', ['instance' > $instance->route]);
         }
         return redirect()->route('instance.login', ['instance' => $instance->route]);
     }
 }

1298) /var/www/app/Http/Controllers/MetaHomeController.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         }
         // si estoy logueado
         if (Auth::check()) {
-            return redirect()->route('instance.login', ['instance' => $instance->route]);
+            return redirect()->route('instance.login', []);
         }
         return redirect()->route('instance.login', ['instance' => $instance->route]);
     }
 }

1333) /var/www/app/Http/Controllers/ProfileController.php:24    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
     }
-    public function view()
+    protected function view()
     {
         $instance = \Instantiation::instance();
         $route_upload_info = route('profile.upload.info', $instance);

1334) /var/www/app/Http/Controllers/ProfileController.php:32    [M] FunctionCall

--- Original
+++ New
@@ @@
         $route_upload_info = route('profile.upload.info', $instance);
         $route_upload_biography = route('profile.upload.biography', $instance);
         $route_upload_pass = route('profile.upload.pass', $instance);
-        return view('profile.view', ['instance' => $instance, 'route_upload_info' => $route_upload_info, 'route_upload_biography' => $route_upload_biography, 'route_upload_pass' => $route_upload_pass]);
+        view('profile.view', ['instance' => $instance, 'route_upload_info' => $route_upload_info, 'route_upload_biography' => $route_upload_biography, 'route_upload_pass' => $route_upload_pass]);
+        return null;
     }
     public function upload_info(Request $request)
     {

1335) /var/www/app/Http/Controllers/ProfileController.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $route_upload_info = route('profile.upload.info', $instance);
         $route_upload_biography = route('profile.upload.biography', $instance);
         $route_upload_pass = route('profile.upload.pass', $instance);
-        return view('profile.view', ['instance' => $instance, 'route_upload_info' => $route_upload_info, 'route_upload_biography' => $route_upload_biography, 'route_upload_pass' => $route_upload_pass]);
+        return view('profile.view', ['route_upload_info' => $route_upload_info, 'route_upload_biography' => $route_upload_biography, 'route_upload_pass' => $route_upload_pass]);
     }
     public function upload_info(Request $request)
     {

1336) /var/www/app/Http/Controllers/ProfileController.php:38    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $route_upload_pass = route('profile.upload.pass', $instance);
         return view('profile.view', ['instance' => $instance, 'route_upload_info' => $route_upload_info, 'route_upload_biography' => $route_upload_biography, 'route_upload_pass' => $route_upload_pass]);
     }
-    public function upload_info(Request $request)
+    protected function upload_info(Request $request)
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();

1337) /var/www/app/Http/Controllers/ProfileController.php:44    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
+        $request->validate(['surname' => 'required|max:255']);
         // si el usuario cambia el email, comprueba que el nuevo sea único
         if ($request->input('email') != $user->email) {
             $request->validate(['email' => 'required|max:255|unique:users']);

1338) /var/www/app/Http/Controllers/ProfileController.php:44    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
+        
         // si el usuario cambia el email, comprueba que el nuevo sea único
         if ($request->input('email') != $user->email) {
             $request->validate(['email' => 'required|max:255|unique:users']);

1339) /var/www/app/Http/Controllers/ProfileController.php:50    [M] NotEqual

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $request->validate(['name' => 'required|max:255', 'surname' => 'required|max:255']);
         // si el usuario cambia el email, comprueba que el nuevo sea único
-        if ($request->input('email') != $user->email) {
+        if ($request->input('email') == $user->email) {
             $request->validate(['email' => 'required|max:255|unique:users']);
         }
         $user->name = $request->input('name');

1346) /var/www/app/Http/Controllers/ProfileController.php:63    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user->email = $request->input('email');
         $user->clean_name = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('name'), ENT_QUOTES, 'UTF-8'))), ' '));
         $user->clean_surname = strtoupper(trim(preg_replace('~[^0-9a-z]+~i', '', preg_replace('~&([a-z]{1,2})(acute|cedil|circ|grave|lig|orn|ring|slash|th|tilde|uml);~i', '$1', htmlentities($request->input('surname'), ENT_QUOTES, 'UTF-8'))), ' '));
-        $user->save();
+        
         try {
             if ($request->has('avatar')) {
                 // almacenamos en disco el avatar

1347) /var/www/app/Http/Controllers/ProfileController.php:71    [M] Concat

--- Original
+++ New
@@ @@
             if ($request->has('avatar')) {
                 // almacenamos en disco el avatar
                 $file = $request->file('avatar');
-                $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
+                $path = Storage::putFileAs('/avatares/' . $instance . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
                 $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello

1348) /var/www/app/Http/Controllers/ProfileController.php:71    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if ($request->has('avatar')) {
                 // almacenamos en disco el avatar
                 $file = $request->file('avatar');
-                $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
+                $path = Storage::putFileAs('/avatares/' . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
                 $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello

1349) /var/www/app/Http/Controllers/ProfileController.php:71    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if ($request->has('avatar')) {
                 // almacenamos en disco el avatar
                 $file = $request->file('avatar');
-                $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
+                $path = Storage::putFileAs($instance . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
                 $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello

1350) /var/www/app/Http/Controllers/ProfileController.php:71    [M] Concat

--- Original
+++ New
@@ @@
             if ($request->has('avatar')) {
                 // almacenamos en disco el avatar
                 $file = $request->file('avatar');
-                $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
+                $path = Storage::putFileAs($instance . $user->username . '/avatares/', $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
                 $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello

1351) /var/www/app/Http/Controllers/ProfileController.php:71    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if ($request->has('avatar')) {
                 // almacenamos en disco el avatar
                 $file = $request->file('avatar');
-                $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
+                $path = Storage::putFileAs($instance . '/avatares/', $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
                 $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello

1352) /var/www/app/Http/Controllers/ProfileController.php:74    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 $file = $request->file('avatar');
                 $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
-                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
+                $file_entity = File::create(['type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();

1353) /var/www/app/Http/Controllers/ProfileController.php:75    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $file = $request->file('avatar');
                 $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
-                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
+                $file_entity = File::create(['name' > $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();

1354) /var/www/app/Http/Controllers/ProfileController.php:76    [M] UnwrapStrToLower

--- Original
+++ New
@@ @@
                 $file = $request->file('avatar');
                 $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
-                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
+                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => $file->getClientOriginalExtension(), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();

1355) /var/www/app/Http/Controllers/ProfileController.php:76    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $file = $request->file('avatar');
                 $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
-                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
+                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' > strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
                 // cómputo del sello
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();

1356) /var/www/app/Http/Controllers/ProfileController.php:78    [M] ArrayItem

--- Original
+++ New
@@ @@
                 $file = $request->file('avatar');
                 $path = Storage::putFileAs($instance . '/avatares/' . $user->username, $file, $this->file_name_parser($file));
                 // almacenamos en la BBDD la información del archivo
-                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' => $file->getSize()]);
+                $file_entity = File::create(['name' => $this->file_name_parser($file), 'type' => strtolower($file->getClientOriginalExtension()), 'route' => $path, 'size' > $file->getSize()]);
                 // cómputo del sello
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();

1358) /var/www/app/Http/Controllers/ProfileController.php:86    [M] NotEqual

--- Original
+++ New
@@ @@
                 $file_entity = \Stamp::compute_file($file_entity);
                 $file_entity->save();
                 // borramos el avatar antiguo (si lo tuviera)
-                if ($user->avatar != null) {
+                if ($user->avatar == null) {
                     Storage::delete($user->avatar->file->route);
                     $user->avatar->file->delete();
                     $user->avatar->delete();

1359) /var/www/app/Http/Controllers/ProfileController.php:87    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $file_entity->save();
                 // borramos el avatar antiguo (si lo tuviera)
                 if ($user->avatar != null) {
-                    Storage::delete($user->avatar->file->route);
+                    
                     $user->avatar->file->delete();
                     $user->avatar->delete();
                 }

1360) /var/www/app/Http/Controllers/ProfileController.php:88    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 // borramos el avatar antiguo (si lo tuviera)
                 if ($user->avatar != null) {
                     Storage::delete($user->avatar->file->route);
-                    $user->avatar->file->delete();
+                    
                     $user->avatar->delete();
                 }
                 // almacenamos en la BBDD el avatar

1361) /var/www/app/Http/Controllers/ProfileController.php:89    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 if ($user->avatar != null) {
                     Storage::delete($user->avatar->file->route);
                     $user->avatar->file->delete();
-                    $user->avatar->delete();
+                    
                 }
                 // almacenamos en la BBDD el avatar
                 $avatar = Avatar::create(['user_id' => $user->id, 'file_id' => $file_entity->id]);

1362) /var/www/app/Http/Controllers/ProfileController.php:93    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                     $user->avatar->delete();
                 }
                 // almacenamos en la BBDD el avatar
-                $avatar = Avatar::create(['user_id' => $user->id, 'file_id' => $file_entity->id]);
+                $avatar = Avatar::create(['file_id' => $file_entity->id]);
                 $avatar->save();
             }
         } catch (\Exception $e) {

1363) /var/www/app/Http/Controllers/ProfileController.php:94    [M] ArrayItem

--- Original
+++ New
@@ @@
                     $user->avatar->delete();
                 }
                 // almacenamos en la BBDD el avatar
-                $avatar = Avatar::create(['user_id' => $user->id, 'file_id' => $file_entity->id]);
+                $avatar = Avatar::create(['user_id' > $user->id, 'file_id' => $file_entity->id]);
                 $avatar->save();
             }
         } catch (\Exception $e) {

1364) /var/www/app/Http/Controllers/ProfileController.php:95    [M] ArrayItem

--- Original
+++ New
@@ @@
                     $user->avatar->delete();
                 }
                 // almacenamos en la BBDD el avatar
-                $avatar = Avatar::create(['user_id' => $user->id, 'file_id' => $file_entity->id]);
+                $avatar = Avatar::create(['user_id' => $user->id, 'file_id' > $file_entity->id]);
                 $avatar->save();
             }
         } catch (\Exception $e) {

1365) /var/www/app/Http/Controllers/ProfileController.php:98    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
                 // almacenamos en la BBDD el avatar
                 $avatar = Avatar::create(['user_id' => $user->id, 'file_id' => $file_entity->id]);
-                $avatar->save();
+                
             }
         } catch (\Exception $e) {
             return $e;

1366) /var/www/app/Http/Controllers/ProfileController.php:116    [M] NotEqual

--- Original
+++ New
@@ @@
         $name = $file->getClientOriginalName();
         $file_from_ddbb = File::where("name", $name)->first();
         // si ya hay un avatar con ese nombre, ponerle otro nombre al nuevo
-        if ($file_from_ddbb != null) {
+        if ($file_from_ddbb == null) {
             $name .= " (copy)." . strtolower($file->getClientOriginalExtension());
         }
         return $name;

1367) /var/www/app/Http/Controllers/ProfileController.php:117    [M] UnwrapStrToLower

--- Original
+++ New
@@ @@
         $file_from_ddbb = File::where("name", $name)->first();
         // si ya hay un avatar con ese nombre, ponerle otro nombre al nuevo
         if ($file_from_ddbb != null) {
-            $name .= " (copy)." . strtolower($file->getClientOriginalExtension());
+            $name .= " (copy)." . $file->getClientOriginalExtension();
         }
         return $name;
     }

1368) /var/www/app/Http/Controllers/ProfileController.php:117    [M] Concat

--- Original
+++ New
@@ @@
         $file_from_ddbb = File::where("name", $name)->first();
         // si ya hay un avatar con ese nombre, ponerle otro nombre al nuevo
         if ($file_from_ddbb != null) {
-            $name .= " (copy)." . strtolower($file->getClientOriginalExtension());
+            $name .= strtolower($file->getClientOriginalExtension()) . " (copy).";
         }
         return $name;
     }

1369) /var/www/app/Http/Controllers/ProfileController.php:117    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $file_from_ddbb = File::where("name", $name)->first();
         // si ya hay un avatar con ese nombre, ponerle otro nombre al nuevo
         if ($file_from_ddbb != null) {
-            $name .= " (copy)." . strtolower($file->getClientOriginalExtension());
+            $name .= strtolower($file->getClientOriginalExtension());
         }
         return $name;
     }

1370) /var/www/app/Http/Controllers/ProfileController.php:117    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $file_from_ddbb = File::where("name", $name)->first();
         // si ya hay un avatar con ese nombre, ponerle otro nombre al nuevo
         if ($file_from_ddbb != null) {
-            $name .= " (copy)." . strtolower($file->getClientOriginalExtension());
+            $name .= " (copy).";
         }
         return $name;
     }

1371) /var/www/app/Http/Controllers/ProfileController.php:117    [M] Assignment

--- Original
+++ New
@@ @@
         $file_from_ddbb = File::where("name", $name)->first();
         // si ya hay un avatar con ese nombre, ponerle otro nombre al nuevo
         if ($file_from_ddbb != null) {
-            $name .= " (copy)." . strtolower($file->getClientOriginalExtension());
+            $name = " (copy)." . strtolower($file->getClientOriginalExtension());
         }
         return $name;
     }

1372) /var/www/app/Http/Controllers/ProfileController.php:123    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return $name;
     }
-    public function upload_biography(Request $request)
+    protected function upload_biography(Request $request)
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();

1373) /var/www/app/Http/Controllers/ProfileController.php:129    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
+        $request->validate(['participation' => 'required|numeric|min:1|max:3']);
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
         $user->save();

1374) /var/www/app/Http/Controllers/ProfileController.php:129    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
+        
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
         $user->save();

1375) /var/www/app/Http/Controllers/ProfileController.php:130    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
+        $request->validate(['biography' => ['required', new MinCharacters(9), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
         $user->save();

1376) /var/www/app/Http/Controllers/ProfileController.php:130    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
+        $request->validate(['biography' => ['required', new MinCharacters(11), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
         $user->save();

1377) /var/www/app/Http/Controllers/ProfileController.php:130    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
+        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(19999)], 'participation' => 'required|numeric|min:1|max:3']);
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
         $user->save();

1378) /var/www/app/Http/Controllers/ProfileController.php:130    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
+        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20001)], 'participation' => 'required|numeric|min:1|max:3']);
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
         $user->save();

1379) /var/www/app/Http/Controllers/ProfileController.php:130    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
+        $request->validate(['biography' => [new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
         $user->save();

1380) /var/www/app/Http/Controllers/ProfileController.php:137    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $request->validate(['biography' => ['required', new MinCharacters(10), new MaxCharacters(20000)], 'participation' => 'required|numeric|min:1|max:3']);
         $user->biography = $request->input('biography');
         $user->participation = $request->input('participation');
-        $user->save();
+        
         return redirect()->route('profile.view', $instance)->with('success', 'Biografía editada con éxito.');
     }
     public function upload_pass(Request $request)

1381) /var/www/app/Http/Controllers/ProfileController.php:143    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $user->save();
         return redirect()->route('profile.view', $instance)->with('success', 'Biografía editada con éxito.');
     }
-    public function upload_pass(Request $request)
+    protected function upload_pass(Request $request)
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();

1382) /var/www/app/Http/Controllers/ProfileController.php:150    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['password' => 'required|confirmed|min:6']);
+        $request->validate([]);
         $user->password = Hash::make($request->input('password'));
         $user->save();
         return redirect()->route('profile.view', $instance)->with('success', 'Contraseña cambiada con éxito.');

1383) /var/www/app/Http/Controllers/ProfileController.php:150    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = Auth::user();
-        $request->validate(['password' => 'required|confirmed|min:6']);
+        
         $user->password = Hash::make($request->input('password'));
         $user->save();
         return redirect()->route('profile.view', $instance)->with('success', 'Contraseña cambiada con éxito.');
