1384) /var/www/app/Http/Controllers/ProfileController.php:156    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $request->validate(['password' => 'required|confirmed|min:6']);
         $user->password = Hash::make($request->input('password'));
-        $user->save();
+        
         return redirect()->route('profile.view', $instance)->with('success', 'Contraseña cambiada con éxito.');
     }
     public function profiles_view($instance, $id)

1385) /var/www/app/Http/Controllers/ProfileController.php:162    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $user->save();
         return redirect()->route('profile.view', $instance)->with('success', 'Contraseña cambiada con éxito.');
     }
-    public function profiles_view($instance, $id)
+    protected function profiles_view($instance, $id)
     {
         $instance = \Instantiation::instance();
         $user = User::find($id);

1386) /var/www/app/Http/Controllers/ProfileController.php:167    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = User::find($id);
-        return view('profile.generalview', ['instance' => $instance, 'user' => $user]);
+        view('profile.generalview', ['instance' => $instance, 'user' => $user]);
+        return null;
     }
     public function evidences_view($instance, $id_user, $id_evidence)
     {

1387) /var/www/app/Http/Controllers/ProfileController.php:168    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $user = User::find($id);
-        return view('profile.generalview', ['instance' => $instance, 'user' => $user]);
+        return view('profile.generalview', ['user' => $user]);
     }
     public function evidences_view($instance, $id_user, $id_evidence)
     {

1388) /var/www/app/Http/Controllers/ProfileController.php:171    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $user = User::find($id);
         return view('profile.generalview', ['instance' => $instance, 'user' => $user]);
     }
-    public function evidences_view($instance, $id_user, $id_evidence)
+    protected function evidences_view($instance, $id_user, $id_evidence)
     {
         $instance = \Instantiation::instance();
         $user = User::find($id_user);

1389) /var/www/app/Http/Controllers/ProfileController.php:177    [M] AssignmentEqual

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $user = User::find($id_user);
         $evidence = Evidence::find($id_evidence);
-        if ($evidence == null) {
+        if ($evidence = null) {
             return redirect()->route('home', ['instance' => \Instantiation::instance()]);
         } else {
             if ($evidence->status == "DRAFT") {

1390) /var/www/app/Http/Controllers/ProfileController.php:177    [M] Equal

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $user = User::find($id_user);
         $evidence = Evidence::find($id_evidence);
-        if ($evidence == null) {
+        if ($evidence != null) {
             return redirect()->route('home', ['instance' => \Instantiation::instance()]);
         } else {
             if ($evidence->status == "DRAFT") {

1391) /var/www/app/Http/Controllers/ProfileController.php:178    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $user = User::find($id_user);
         $evidence = Evidence::find($id_evidence);
         if ($evidence == null) {
-            return redirect()->route('home', ['instance' => \Instantiation::instance()]);
+            return redirect()->route('home', []);
         } else {
             if ($evidence->status == "DRAFT") {
                 return redirect()->route('home', ['instance' => \Instantiation::instance()]);

1392) /var/www/app/Http/Controllers/ProfileController.php:179    [M] Equal

--- Original
+++ New
@@ @@
         if ($evidence == null) {
             return redirect()->route('home', ['instance' => \Instantiation::instance()]);
         } else {
-            if ($evidence->status == "DRAFT") {
+            if ($evidence->status != "DRAFT") {
                 return redirect()->route('home', ['instance' => \Instantiation::instance()]);
             }
         }

1393) /var/www/app/Http/Controllers/ProfileController.php:180    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             return redirect()->route('home', ['instance' => \Instantiation::instance()]);
         } else {
             if ($evidence->status == "DRAFT") {
-                return redirect()->route('home', ['instance' => \Instantiation::instance()]);
+                return redirect()->route('home', []);
             }
         }
         return view('profile.profile_evidence_view', ['instance' => $instance, 'user' => $user, 'evidence' => $evidence]);
     }
 }

1394) /var/www/app/Http/Controllers/ProfileController.php:183    [M] FunctionCall

--- Original
+++ New
@@ @@
                 return redirect()->route('home', ['instance' => \Instantiation::instance()]);
             }
         }
-        return view('profile.profile_evidence_view', ['instance' => $instance, 'user' => $user, 'evidence' => $evidence]);
+        view('profile.profile_evidence_view', ['instance' => $instance, 'user' => $user, 'evidence' => $evidence]);
+        return null;
     }
 }

1395) /var/www/app/Http/Controllers/ProfileController.php:184    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 return redirect()->route('home', ['instance' => \Instantiation::instance()]);
             }
         }
-        return view('profile.profile_evidence_view', ['instance' => $instance, 'user' => $user, 'evidence' => $evidence]);
+        return view('profile.profile_evidence_view', ['user' => $user, 'evidence' => $evidence]);
     }
 }

1396) /var/www/app/Http/Controllers/ProofController.php:13    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Support\Facades\Storage;
 class ProofController extends Controller
 {
-    public function download($instance, $id)
+    protected function download($instance, $id)
     {
         $proof = Proof::find($id);
         $file = $proof->file;

1397) /var/www/app/Http/Controllers/ProofController.php:21    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $proof = Proof::find($id);
         $file = $proof->file;
         $response = Storage::download($file->route);
-        // limpiar búfer de salida
-        ob_end_clean();
+        
         return $response;
     }
 }

1401) /var/www/app/Http/Controllers/QuickInstances.php:24    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function list()
     {
         $instance = \Instantiation::instance();
-        \Instantiation::set_default_connection();
+        
         $instances = Instance::orderBy('created_at', 'desc')->get();
         $route = route('lecture.instances.save', $instance);
         return view('manage.instances', ['instances' => $instances, 'instance' => $instance, 'route' => $route]);

1402) /var/www/app/Http/Controllers/QuickInstances.php:28    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         \Instantiation::set_default_connection();
         $instances = Instance::orderBy('created_at', 'desc')->get();
         $route = route('lecture.instances.save', $instance);
-        return view('manage.instances', ['instances' => $instances, 'instance' => $instance, 'route' => $route]);
+        return view('manage.instances', ['instance' => $instance, 'route' => $route]);
     }
     public function save(Request $request)
     {

1403) /var/www/app/Http/Controllers/QuickInstances.php:28    [M] FunctionCall

--- Original
+++ New
@@ @@
         \Instantiation::set_default_connection();
         $instances = Instance::orderBy('created_at', 'desc')->get();
         $route = route('lecture.instances.save', $instance);
-        return view('manage.instances', ['instances' => $instances, 'instance' => $instance, 'route' => $route]);
+        view('manage.instances', ['instances' => $instances, 'instance' => $instance, 'route' => $route]);
+        return null;
     }
     public function save(Request $request)
     {

1405) /var/www/app/Http/Controllers/QuickInstances.php:35    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function save(Request $request)
     {
-        // nos conectamos a la base de meta administración de Evidentia
-        \Instantiation::set_default_connection();
+        
         // validación
         $request->validate(['name' => 'required|unique:instances']);
         // creamos la ruta a través del nombre del curso, si no sigue el patrón, volvemos al form

1406) /var/www/app/Http/Controllers/QuickInstances.php:38    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         // nos conectamos a la base de meta administración de Evidentia
         \Instantiation::set_default_connection();
         // validación
-        $request->validate(['name' => 'required|unique:instances']);
+        $request->validate([]);
         // creamos la ruta a través del nombre del curso, si no sigue el patrón, volvemos al form
         $name = $request->input('name');
         $route = "";

1407) /var/www/app/Http/Controllers/QuickInstances.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         // nos conectamos a la base de meta administración de Evidentia
         \Instantiation::set_default_connection();
-        // validación
-        $request->validate(['name' => 'required|unique:instances']);
+        
         // creamos la ruta a través del nombre del curso, si no sigue el patrón, volvemos al form
         $name = $request->input('name');
         $route = "";

1408) /var/www/app/Http/Controllers/QuickInstances.php:46    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $name = $request->input('name');
         $route = "";
         try {
-            $route = explode('/', $name)[0];
+            $route = explode('/', $name)[1];
             $route = explode(' ', $route)[1];
         } catch (\Exception $e) {
             return back()->withInput()->with('error', 'El formato para el nombre del curso no es correcto: ' . $e->getMessage());

1409) /var/www/app/Http/Controllers/QuickInstances.php:47    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $route = "";
         try {
             $route = explode('/', $name)[0];
-            $route = explode(' ', $route)[1];
+            $route = explode(' ', $route)[0];
         } catch (\Exception $e) {
             return back()->withInput()->with('error', 'El formato para el nombre del curso no es correcto: ' . $e->getMessage());
         }

1410) /var/www/app/Http/Controllers/QuickInstances.php:47    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $route = "";
         try {
             $route = explode('/', $name)[0];
-            $route = explode(' ', $route)[1];
+            $route = explode(' ', $route)[2];
         } catch (\Exception $e) {
             return back()->withInput()->with('error', 'El formato para el nombre del curso no es correcto: ' . $e->getMessage());
         }

1411) /var/www/app/Http/Controllers/QuickInstances.php:49    [M] Concat

--- Original
+++ New
@@ @@
             $route = explode('/', $name)[0];
             $route = explode(' ', $route)[1];
         } catch (\Exception $e) {
-            return back()->withInput()->with('error', 'El formato para el nombre del curso no es correcto: ' . $e->getMessage());
+            return back()->withInput()->with('error', $e->getMessage() . 'El formato para el nombre del curso no es correcto: ');
         }
         // fecha preformateada para usarlo en el nombre de la base de datos
         $fecha = Carbon::now();

1412) /var/www/app/Http/Controllers/QuickInstances.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $route = explode('/', $name)[0];
             $route = explode(' ', $route)[1];
         } catch (\Exception $e) {
-            return back()->withInput()->with('error', 'El formato para el nombre del curso no es correcto: ' . $e->getMessage());
+            return back()->withInput()->with('error', $e->getMessage());
         }
         // fecha preformateada para usarlo en el nombre de la base de datos
         $fecha = Carbon::now();

1413) /var/www/app/Http/Controllers/QuickInstances.php:49    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $route = explode('/', $name)[0];
             $route = explode(' ', $route)[1];
         } catch (\Exception $e) {
-            return back()->withInput()->with('error', 'El formato para el nombre del curso no es correcto: ' . $e->getMessage());
+            return back()->withInput()->with('error', 'El formato para el nombre del curso no es correcto: ');
         }
         // fecha preformateada para usarlo en el nombre de la base de datos
         $fecha = Carbon::now();

1414) /var/www/app/Http/Controllers/QuickInstances.php:54    [M] UnwrapStrReplace

--- Original
+++ New
@@ @@
         }
         // fecha preformateada para usarlo en el nombre de la base de datos
         $fecha = Carbon::now();
-        $fecha = str_replace(" ", "_", $fecha);
+        $fecha = $fecha;
         $fecha = str_replace("-", "_", $fecha);
         $fecha = str_replace(":", "_", $fecha);
         // creación de nueva instancia

1415) /var/www/app/Http/Controllers/QuickInstances.php:55    [M] UnwrapStrReplace

--- Original
+++ New
@@ @@
         // fecha preformateada para usarlo en el nombre de la base de datos
         $fecha = Carbon::now();
         $fecha = str_replace(" ", "_", $fecha);
-        $fecha = str_replace("-", "_", $fecha);
+        $fecha = $fecha;
         $fecha = str_replace(":", "_", $fecha);
         // creación de nueva instancia
         $instance = new Instance();

1416) /var/www/app/Http/Controllers/QuickInstances.php:56    [M] UnwrapStrReplace

--- Original
+++ New
@@ @@
         $fecha = Carbon::now();
         $fecha = str_replace(" ", "_", $fecha);
         $fecha = str_replace("-", "_", $fecha);
-        $fecha = str_replace(":", "_", $fecha);
+        $fecha = $fecha;
         // creación de nueva instancia
         $instance = new Instance();
         $instance->name = $name;

1417) /var/www/app/Http/Controllers/QuickInstances.php:64    [M] Concat

--- Original
+++ New
@@ @@
         $instance->route = $route;
         $instance->host = env('DB_HOST');
         $instance->port = env('DB_PORT');
-        $instance->database = 'evidentia_' . $fecha;
+        $instance->database = $fecha . 'evidentia_';
         $instance->username = env('DB_USERNAME');
         $instance->password = 'secret';
         $instance->active = true;

1418) /var/www/app/Http/Controllers/QuickInstances.php:64    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance->route = $route;
         $instance->host = env('DB_HOST');
         $instance->port = env('DB_PORT');
-        $instance->database = 'evidentia_' . $fecha;
+        $instance->database = $fecha;
         $instance->username = env('DB_USERNAME');
         $instance->password = 'secret';
         $instance->active = true;

1419) /var/www/app/Http/Controllers/QuickInstances.php:64    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance->route = $route;
         $instance->host = env('DB_HOST');
         $instance->port = env('DB_PORT');
-        $instance->database = 'evidentia_' . $fecha;
+        $instance->database = 'evidentia_';
         $instance->username = env('DB_USERNAME');
         $instance->password = 'secret';
         $instance->active = true;

1420) /var/www/app/Http/Controllers/QuickInstances.php:67    [M] TrueValue

--- Original
+++ New
@@ @@
         $instance->database = 'evidentia_' . $fecha;
         $instance->username = env('DB_USERNAME');
         $instance->password = 'secret';
-        $instance->active = true;
+        $instance->active = false;
         DB::connection()->getPdo()->exec("CREATE DATABASE `{$instance->database}`");
         DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
         \Instantiation::set($instance);

1421) /var/www/app/Http/Controllers/QuickInstances.php:69    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance->username = env('DB_USERNAME');
         $instance->password = 'secret';
         $instance->active = true;
-        DB::connection()->getPdo()->exec("CREATE DATABASE `{$instance->database}`");
+        
         DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
         \Instantiation::set($instance);
         try {

1422) /var/www/app/Http/Controllers/QuickInstances.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance->password = 'secret';
         $instance->active = true;
         DB::connection()->getPdo()->exec("CREATE DATABASE `{$instance->database}`");
-        DB::connection()->getPdo()->exec("ALTER SCHEMA `{$instance->database}`  DEFAULT CHARACTER SET utf8mb4  DEFAULT COLLATE utf8mb4_unicode_ci");
+        
         \Instantiation::set($instance);
         try {
             DB::connection()->getPdo();

1433) /var/www/app/Http/Controllers/QuickInstances.php:90    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             DB::connection()->getPdo();
-            Artisan::call('migrate', ['--path' => 'database/migrations/instances', '--database' => 'quickinstance']);
+            
             Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'quickinstance']);
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();

1434) /var/www/app/Http/Controllers/QuickInstances.php:91    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         try {
             DB::connection()->getPdo();
-            Artisan::call('migrate', ['--path' => 'database/migrations/instances', '--database' => 'quickinstance']);
+            Artisan::call('migrate', ['--database' => 'quickinstance']);
             Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'quickinstance']);
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();

1435) /var/www/app/Http/Controllers/QuickInstances.php:96    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             DB::connection()->getPdo();
             Artisan::call('migrate', ['--path' => 'database/migrations/instances', '--database' => 'quickinstance']);
-            Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'quickinstance']);
+            
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");

1436) /var/www/app/Http/Controllers/QuickInstances.php:97    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             DB::connection()->getPdo();
             Artisan::call('migrate', ['--path' => 'database/migrations/instances', '--database' => 'quickinstance']);
-            Artisan::call('db:seed', ['--class' => 'SampleSeeder', '--database' => 'quickinstance']);
+            Artisan::call('db:seed', ['--database' => 'quickinstance']);
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");

1439) /var/www/app/Http/Controllers/QuickInstances.php:105    [M] Concat

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");
-            return back()->withInput()->with('error', 'Conexión fallida, contacte con el administrador del servidor: ' . $e->getMessage());
+            return back()->withInput()->with('error', $e->getMessage() . 'Conexión fallida, contacte con el administrador del servidor: ');
         }
         \Instantiation::set_default_connection();
         $instance->save();

1440) /var/www/app/Http/Controllers/QuickInstances.php:105    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");
-            return back()->withInput()->with('error', 'Conexión fallida, contacte con el administrador del servidor: ' . $e->getMessage());
+            return back()->withInput()->with('error', $e->getMessage());
         }
         \Instantiation::set_default_connection();
         $instance->save();

1441) /var/www/app/Http/Controllers/QuickInstances.php:105    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         } catch (\Exception $e) {
             \Instantiation::set_default_connection();
             DB::statement("DROP DATABASE `{$instance->database}`");
-            return back()->withInput()->with('error', 'Conexión fallida, contacte con el administrador del servidor: ' . $e->getMessage());
+            return back()->withInput()->with('error', 'Conexión fallida, contacte con el administrador del servidor: ');
         }
         \Instantiation::set_default_connection();
         $instance->save();

1445) /var/www/app/Http/Controllers/RandomizeController.php:17    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
     }
-    public function randomize()
+    protected function randomize()
     {
         $instance = \Instantiation::instance();
         $route = route('randomize.save', $instance);

1446) /var/www/app/Http/Controllers/RandomizeController.php:22    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('randomize.save', $instance);
-        return view('randomize.randomize', ['instance' => $instance, 'route' => $route]);
+        return view('randomize.randomize', ['route' => $route]);
     }
     public function randomize_save()
     {

1447) /var/www/app/Http/Controllers/RandomizeController.php:22    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('randomize.save', $instance);
-        return view('randomize.randomize', ['instance' => $instance, 'route' => $route]);
+        view('randomize.randomize', ['instance' => $instance, 'route' => $route]);
+        return null;
     }
     public function randomize_save()
     {

1448) /var/www/app/Http/Controllers/RandomizeController.php:25    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $route = route('randomize.save', $instance);
         return view('randomize.randomize', ['instance' => $instance, 'route' => $route]);
     }
-    public function randomize_save()
+    protected function randomize_save()
     {
         $instance = \Instantiation::instance();
         // eliminamos la aleatorización previa (si la hubiera)

1449) /var/www/app/Http/Controllers/RandomizeController.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         // eliminamos la aleatorización previa (si la hubiera)
         $previous_evidences = Evidence::where('rand', '=', '1')->get();
-        $previous_evidences->each(function ($item, $key) {
-            $item->rand = false;
-            $item->save();
-        });
+        
         $users = User::all();
         foreach ($users as $user) {
             try {

1450) /var/www/app/Http/Controllers/RandomizeController.php:32    [M] FalseValue

--- Original
+++ New
@@ @@
         // eliminamos la aleatorización previa (si la hubiera)
         $previous_evidences = Evidence::where('rand', '=', '1')->get();
         $previous_evidences->each(function ($item, $key) {
-            $item->rand = false;
+            $item->rand = true;
             $item->save();
         });
         $users = User::all();

1451) /var/www/app/Http/Controllers/RandomizeController.php:33    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $previous_evidences = Evidence::where('rand', '=', '1')->get();
         $previous_evidences->each(function ($item, $key) {
             $item->rand = false;
-            $item->save();
+            
         });
         $users = User::all();
         foreach ($users as $user) {

1453) /var/www/app/Http/Controllers/RandomizeController.php:43    [M] Equal

--- Original
+++ New
@@ @@
         foreach ($users as $user) {
             try {
                 $filtered_evidences = $user->evidences->filter(function ($value, $key) {
-                    return $value->status == "ACCEPTED";
+                    return $value->status != "ACCEPTED";
                 });
                 $evidence = $filtered_evidences->random();
                 $evidence->rand = true;

1454) /var/www/app/Http/Controllers/RandomizeController.php:47    [M] TrueValue

--- Original
+++ New
@@ @@
                     return $value->status == "ACCEPTED";
                 });
                 $evidence = $filtered_evidences->random();
-                $evidence->rand = true;
+                $evidence->rand = false;
                 $evidence->save();
             } catch (\Exception $e) {
             }

1455) /var/www/app/Http/Controllers/RandomizeController.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 });
                 $evidence = $filtered_evidences->random();
                 $evidence->rand = true;
-                $evidence->save();
+                
             } catch (\Exception $e) {
             }
         }

1456) /var/www/app/Http/Controllers/SignController.php:12    [M] PublicVisibility

--- Original
+++ New
@@ @@
 use Illuminate\Support\Facades\DB;
 class SignController extends Controller
 {
-    public function sign($instance, $random_identifier)
+    protected function sign($instance, $random_identifier)
     {
         $signature_sheet = SignatureSheet::where('random_identifier', $random_identifier)->first();
         if ($signature_sheet == null) {

1457) /var/www/app/Http/Controllers/SignController.php:16    [M] AssignmentEqual

--- Original
+++ New
@@ @@
     public function sign($instance, $random_identifier)
     {
         $signature_sheet = SignatureSheet::where('random_identifier', $random_identifier)->first();
-        if ($signature_sheet == null) {
+        if ($signature_sheet = null) {
             abort(404);
         }
         $instance = \Instantiation::instance();

1458) /var/www/app/Http/Controllers/SignController.php:16    [M] Equal

--- Original
+++ New
@@ @@
     public function sign($instance, $random_identifier)
     {
         $signature_sheet = SignatureSheet::where('random_identifier', $random_identifier)->first();
-        if ($signature_sheet == null) {
+        if ($signature_sheet != null) {
             abort(404);
         }
         $instance = \Instantiation::instance();

1459) /var/www/app/Http/Controllers/SignController.php:18    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $signature_sheet = SignatureSheet::where('random_identifier', $random_identifier)->first();
         if ($signature_sheet == null) {
-            abort(404);
+            abort(403);
         }
         $instance = \Instantiation::instance();
         return view('sign.sign', ['instance' => $instance, 'signature_sheet' => $signature_sheet]);

1460) /var/www/app/Http/Controllers/SignController.php:18    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $signature_sheet = SignatureSheet::where('random_identifier', $random_identifier)->first();
         if ($signature_sheet == null) {
-            abort(404);
+            abort(405);
         }
         $instance = \Instantiation::instance();
         return view('sign.sign', ['instance' => $instance, 'signature_sheet' => $signature_sheet]);

1461) /var/www/app/Http/Controllers/SignController.php:18    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
     {
         $signature_sheet = SignatureSheet::where('random_identifier', $random_identifier)->first();
         if ($signature_sheet == null) {
-            abort(404);
+            
         }
         $instance = \Instantiation::instance();
         return view('sign.sign', ['instance' => $instance, 'signature_sheet' => $signature_sheet]);

1462) /var/www/app/Http/Controllers/SignController.php:23    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             abort(404);
         }
         $instance = \Instantiation::instance();
-        return view('sign.sign', ['instance' => $instance, 'signature_sheet' => $signature_sheet]);
+        return view('sign.sign', ['signature_sheet' => $signature_sheet]);
     }
     public function sign_p(Request $request)
     {

1463) /var/www/app/Http/Controllers/SignController.php:23    [M] FunctionCall

--- Original
+++ New
@@ @@
             abort(404);
         }
         $instance = \Instantiation::instance();
-        return view('sign.sign', ['instance' => $instance, 'signature_sheet' => $signature_sheet]);
+        view('sign.sign', ['instance' => $instance, 'signature_sheet' => $signature_sheet]);
+        return null;
     }
     public function sign_p(Request $request)
     {

1464) /var/www/app/Http/Controllers/SignController.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         return view('sign.sign', ['instance' => $instance, 'signature_sheet' => $signature_sheet]);
     }
-    public function sign_p(Request $request)
+    protected function sign_p(Request $request)
     {
         $instance = \Instantiation::instance();
         $signature_sheet = SignatureSheet::findOrFail($request->input('signature_sheet'));
