1465) /var/www/app/Http/Controllers/SignController.php:37    [M] NotEqual

--- Original
+++ New
@@ @@
         $credentials = $request->only('username', 'password');
         if (Auth::attempt($credentials)) {
             // compruebo que el usuario no es un secretario e intenta firmar en su propia hoja
-            if (Auth::user()->secretary != null) {
+            if (Auth::user()->secretary == null) {
                 if (Auth::user()->secretary->id == $signature_sheet->secretary->id) {
                     Auth::logout();
                     $sign_message = "Eres el secretario de esta reunión, no es necesario que firmes en tu propia hoja de firmas.";

1466) /var/www/app/Http/Controllers/SignController.php:38    [M] Equal

--- Original
+++ New
@@ @@
         if (Auth::attempt($credentials)) {
             // compruebo que el usuario no es un secretario e intenta firmar en su propia hoja
             if (Auth::user()->secretary != null) {
-                if (Auth::user()->secretary->id == $signature_sheet->secretary->id) {
+                if (Auth::user()->secretary->id != $signature_sheet->secretary->id) {
                     Auth::logout();
                     $sign_message = "Eres el secretario de esta reunión, no es necesario que firmes en tu propia hoja de firmas.";
                     return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);

1467) /var/www/app/Http/Controllers/SignController.php:39    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             // compruebo que el usuario no es un secretario e intenta firmar en su propia hoja
             if (Auth::user()->secretary != null) {
                 if (Auth::user()->secretary->id == $signature_sheet->secretary->id) {
-                    Auth::logout();
+                    
                     $sign_message = "Eres el secretario de esta reunión, no es necesario que firmes en tu propia hoja de firmas.";
                     return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);
                 }

1468) /var/www/app/Http/Controllers/SignController.php:41    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 if (Auth::user()->secretary->id == $signature_sheet->secretary->id) {
                     Auth::logout();
                     $sign_message = "Eres el secretario de esta reunión, no es necesario que firmes en tu propia hoja de firmas.";
-                    return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);
+                    return redirect()->route('sign.finish', [])->with('sign_message', $sign_message);
                 }
             }
             // comprobamos que no haya firmado con anterioridad

1469) /var/www/app/Http/Controllers/SignController.php:47    [M] LogicalNot

--- Original
+++ New
@@ @@
                 }
             }
             // comprobamos que no haya firmado con anterioridad
-            if (!Auth::user()->signature_sheets->contains($signature_sheet->id)) {
+            if (Auth::user()->signature_sheets->contains($signature_sheet->id)) {
                 // firma
                 Auth::user()->signature_sheets()->attach($signature_sheet->id);
                 Auth::logout();

1470) /var/www/app/Http/Controllers/SignController.php:50    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             // comprobamos que no haya firmado con anterioridad
             if (!Auth::user()->signature_sheets->contains($signature_sheet->id)) {
-                // firma
-                Auth::user()->signature_sheets()->attach($signature_sheet->id);
+                
                 Auth::logout();
                 $sign_message = "Tu firma ha sido validada y registrada correctamente.";
                 return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);

1471) /var/www/app/Http/Controllers/SignController.php:52    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (!Auth::user()->signature_sheets->contains($signature_sheet->id)) {
                 // firma
                 Auth::user()->signature_sheets()->attach($signature_sheet->id);
-                Auth::logout();
+                
                 $sign_message = "Tu firma ha sido validada y registrada correctamente.";
                 return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);
             }

1472) /var/www/app/Http/Controllers/SignController.php:55    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
                 Auth::user()->signature_sheets()->attach($signature_sheet->id);
                 Auth::logout();
                 $sign_message = "Tu firma ha sido validada y registrada correctamente.";
-                return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);
+                return redirect()->route('sign.finish', [])->with('sign_message', $sign_message);
             }
             Auth::logout();
             $sign_message = "Parece ser que ya has firmado en esta reunión. Si consideras que es un error, contacta con el secretario de tu comité.";

1473) /var/www/app/Http/Controllers/SignController.php:58    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $sign_message = "Tu firma ha sido validada y registrada correctamente.";
                 return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);
             }
-            Auth::logout();
+            
             $sign_message = "Parece ser que ya has firmado en esta reunión. Si consideras que es un error, contacta con el secretario de tu comité.";
             return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);
         }

1474) /var/www/app/Http/Controllers/SignController.php:61    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
             }
             Auth::logout();
             $sign_message = "Parece ser que ya has firmado en esta reunión. Si consideras que es un error, contacta con el secretario de tu comité.";
-            return redirect()->route('sign.finish', ['instance' => $instance])->with('sign_message', $sign_message);
+            return redirect()->route('sign.finish', [])->with('sign_message', $sign_message);
         }
         return back()->withInput()->with('error', 'Las credenciales no son válidas.');
     }

1475) /var/www/app/Http/Controllers/SignController.php:68    [M] PublicVisibility

--- Original
+++ New
@@ @@
         }
         return back()->withInput()->with('error', 'Las credenciales no son válidas.');
     }
-    public function finish()
+    protected function finish()
     {
         if (session('sign_message')) {
             return view('sign.sign_finish', ['instance' => \Instantiation::instance()]);

1476) /var/www/app/Http/Controllers/SignController.php:72    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     public function finish()
     {
         if (session('sign_message')) {
-            return view('sign.sign_finish', ['instance' => \Instantiation::instance()]);
+            return view('sign.sign_finish', []);
         }
         return redirect()->route('instances.home');
         //return "hola";
     }
 }

1477) /var/www/app/Http/Controllers/SignController.php:72    [M] FunctionCall

--- Original
+++ New
@@ @@
     public function finish()
     {
         if (session('sign_message')) {
-            return view('sign.sign_finish', ['instance' => \Instantiation::instance()]);
+            view('sign.sign_finish', ['instance' => \Instantiation::instance()]);
+            return null;
         }
         return redirect()->route('instances.home');
         //return "hola";
     }
 }

1479) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:18    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->middleware('auth');
     }
-    public function suggestionsmailbox()
+    protected function suggestionsmailbox()
     {
         $instance = \Instantiation::instance();
         $route = route('suggestionsmailbox_p', $instance);

1480) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:24    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('suggestionsmailbox_p', $instance);
-        return view('suggestionsmailbox', ['instance' => $instance, 'route' => $route]);
+        return view('suggestionsmailbox', ['route' => $route]);
     }
     public function suggestionsmailbox_p(Request $request)
     {

1481) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:24    [M] FunctionCall

--- Original
+++ New
@@ @@
     {
         $instance = \Instantiation::instance();
         $route = route('suggestionsmailbox_p', $instance);
-        return view('suggestionsmailbox', ['instance' => $instance, 'route' => $route]);
+        view('suggestionsmailbox', ['instance' => $instance, 'route' => $route]);
+        return null;
     }
     public function suggestionsmailbox_p(Request $request)
     {

1482) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:27    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $route = route('suggestionsmailbox_p', $instance);
         return view('suggestionsmailbox', ['instance' => $instance, 'route' => $route]);
     }
-    public function suggestionsmailbox_p(Request $request)
+    protected function suggestionsmailbox_p(Request $request)
     {
         $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
         $subject_form = $request->input('subject');

1483) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:30    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function suggestionsmailbox_p(Request $request)
     {
-        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
+        $request->validate(['comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
         Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));

1484) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:30    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     public function suggestionsmailbox_p(Request $request)
     {
-        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
+        
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
         Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));

1485) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:32    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function suggestionsmailbox_p(Request $request)
     {
-        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
+        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(9), new MaxCharacters(20000)]]);
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
         Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));

1486) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:32    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function suggestionsmailbox_p(Request $request)
     {
-        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
+        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(11), new MaxCharacters(20000)]]);
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
         Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));

1487) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:32    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     public function suggestionsmailbox_p(Request $request)
     {
-        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
+        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(19999)]]);
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
         Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));

1488) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:32    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     public function suggestionsmailbox_p(Request $request)
     {
-        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
+        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20001)]]);
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
         Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));

1489) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:32    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     public function suggestionsmailbox_p(Request $request)
     {
-        $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
+        $request->validate(['subject' => 'required', 'comment' => [new MinCharacters(10), new MaxCharacters(20000)]]);
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
         Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));

1490) /var/www/app/Http/Controllers/SuggestionsMailboxController.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $request->validate(['subject' => 'required', 'comment' => ['required', new MinCharacters(10), new MaxCharacters(20000)]]);
         $subject_form = $request->input('subject');
         $comment = $request->input('comment');
-        Mail::to('evidentia.cloud@gmail.com')->send(new SuggestionsMailbox($subject_form, $comment));
+        
         return redirect()->route('suggestionsmailbox', \Instantiation::instance())->with('success', "Mensaje enviado con éxito. ¡Muchas gracias!");
     }
 }

1491) /var/www/app/Http/Controllers/UploadController.php:21    [M] PublicVisibility

--- Original
+++ New
@@ @@
     {
         $this->filepond = $filepond;
     }
-    public function process(Request $request)
+    protected function process(Request $request)
     {
         $user = Auth::user();
         $instance = \Instantiation::instance();

1492) /var/www/app/Http/Controllers/UploadController.php:30    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = $request->session()->token();
         $files = $request->file('files');
-        $file = $files[0];
+        $file = $files[1];
         $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }

1493) /var/www/app/Http/Controllers/UploadController.php:31    [M] Concat

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs('/tmp/' . $instance . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1494) /var/www/app/Http/Controllers/UploadController.php:31    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs('/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1495) /var/www/app/Http/Controllers/UploadController.php:31    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1496) /var/www/app/Http/Controllers/UploadController.php:31    [M] Concat

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . $user->username . '/tmp/' . '/' . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1497) /var/www/app/Http/Controllers/UploadController.php:31    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . '/tmp/' . '/' . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1498) /var/www/app/Http/Controllers/UploadController.php:31    [M] Concat

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . '/tmp/' . '/' . $user->username . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1499) /var/www/app/Http/Controllers/UploadController.php:31    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1500) /var/www/app/Http/Controllers/UploadController.php:31    [M] Concat

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . $token . '/' . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1501) /var/www/app/Http/Controllers/UploadController.php:31    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1502) /var/www/app/Http/Controllers/UploadController.php:31    [M] Concat

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . '/' . $token, $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1503) /var/www/app/Http/Controllers/UploadController.php:31    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $token = $request->session()->token();
         $files = $request->file('files');
         $file = $files[0];
-        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
+        $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token, $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)

1504) /var/www/app/Http/Controllers/UploadController.php:33    [M] DecrementInteger

--- Original
+++ New
@@ @@
         $files = $request->file('files');
         $file = $files[0];
         $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
-        return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
+        return Response::make($this->filepond->getServerIdFromPath($path), 199, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)
     {

1505) /var/www/app/Http/Controllers/UploadController.php:33    [M] IncrementInteger

--- Original
+++ New
@@ @@
         $files = $request->file('files');
         $file = $files[0];
         $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
-        return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
+        return Response::make($this->filepond->getServerIdFromPath($path), 201, ['Content-Type' => 'text/plain']);
     }
     public function delete(Request $request)
     {

1506) /var/www/app/Http/Controllers/UploadController.php:33    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $files = $request->file('files');
         $file = $files[0];
         $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
-        return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
+        return Response::make($this->filepond->getServerIdFromPath($path), 200, []);
     }
     public function delete(Request $request)
     {

1507) /var/www/app/Http/Controllers/UploadController.php:39    [M] PublicVisibility

--- Original
+++ New
@@ @@
         $path = Storage::putFileAs($instance . '/tmp/' . $user->username . '/' . $token . '/', $file, $file->getClientOriginalName());
         return Response::make($this->filepond->getServerIdFromPath($path), 200, ['Content-Type' => 'text/plain']);
     }
-    public function delete(Request $request)
+    protected function delete(Request $request)
     {
         $path = $this->filepond->getPathFromServerId($request->getContent());
         Storage::delete($path);

1508) /var/www/app/Http/Controllers/UploadController.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function delete(Request $request)
     {
         $path = $this->filepond->getPathFromServerId($request->getContent());
-        Storage::delete($path);
+        
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
     public function load($instance, $file_name)

1509) /var/www/app/Http/Controllers/UploadController.php:45    [M] DecrementInteger

--- Original
+++ New
@@ @@
     {
         $path = $this->filepond->getPathFromServerId($request->getContent());
         Storage::delete($path);
-        return Response::make('', 200, ['Content-Type' => 'text/plain']);
+        return Response::make('', 199, ['Content-Type' => 'text/plain']);
     }
     public function load($instance, $file_name)
     {

1510) /var/www/app/Http/Controllers/UploadController.php:45    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $path = $this->filepond->getPathFromServerId($request->getContent());
         Storage::delete($path);
-        return Response::make('', 200, ['Content-Type' => 'text/plain']);
+        return Response::make('', 201, ['Content-Type' => 'text/plain']);
     }
     public function load($instance, $file_name)
     {

1511) /var/www/app/Http/Controllers/UploadController.php:45    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     {
         $path = $this->filepond->getPathFromServerId($request->getContent());
         Storage::delete($path);
-        return Response::make('', 200, ['Content-Type' => 'text/plain']);
+        return Response::make('', 200, []);
     }
     public function load($instance, $file_name)
     {

1512) /var/www/app/Http/Controllers/UploadController.php:52    [M] PublicVisibility

--- Original
+++ New
@@ @@
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
-    public function load($instance, $file_name)
+    protected function load($instance, $file_name)
     {
         $user = Auth::user();
         $token = session()->token();

1513) /var/www/app/Http/Controllers/UploadController.php:58    [M] Concat

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = '/tmp/' . $instance . $user->username . '/' . $token . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1514) /var/www/app/Http/Controllers/UploadController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1515) /var/www/app/Http/Controllers/UploadController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . $user->username . '/' . $token . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1516) /var/www/app/Http/Controllers/UploadController.php:58    [M] Concat

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . $user->username . '/tmp/' . '/' . $token . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();
