1517) /var/www/app/Http/Controllers/UploadController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . '/' . $token . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1518) /var/www/app/Http/Controllers/UploadController.php:58    [M] Concat

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . '/' . $user->username . $token . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1519) /var/www/app/Http/Controllers/UploadController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . $user->username . $token . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1520) /var/www/app/Http/Controllers/UploadController.php:58    [M] Concat

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . $user->username . $token . '/' . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1521) /var/www/app/Http/Controllers/UploadController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . $user->username . '/' . '/' . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1522) /var/www/app/Http/Controllers/UploadController.php:58    [M] Concat

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . $user->username . '/' . '/' . $token . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1523) /var/www/app/Http/Controllers/UploadController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . $user->username . '/' . $token . $file_name;
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1524) /var/www/app/Http/Controllers/UploadController.php:58    [M] Concat

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . $user->username . '/' . $token . $file_name . '/';
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1525) /var/www/app/Http/Controllers/UploadController.php:58    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $user = Auth::user();
         $token = session()->token();
-        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
+        $route = $instance . '/tmp/' . $user->username . '/' . $token . '/';
         $response = Storage::download($route);
         // limpiar búfer de salida
         ob_end_clean();

1526) /var/www/app/Http/Controllers/UploadController.php:63    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $route = $instance . '/tmp/' . $user->username . '/' . $token . '/' . $file_name;
         $response = Storage::download($route);
-        // limpiar búfer de salida
-        ob_end_clean();
+        
         return $response;
     }
     public function remove($instance, $file_name)

1527) /var/www/app/Http/Controllers/UploadController.php:69    [M] PublicVisibility

--- Original
+++ New
@@ @@
         ob_end_clean();
         return $response;
     }
-    public function remove($instance, $file_name)
+    protected function remove($instance, $file_name)
     {
         $user = Auth::user();
         $instance = \Instantiation::instance();

1528) /var/www/app/Http/Controllers/UploadController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = '/tmp/' . $instance . $user->username . '/' . $token . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1529) /var/www/app/Http/Controllers/UploadController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = '/tmp/' . $user->username . '/' . $token . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1530) /var/www/app/Http/Controllers/UploadController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . $user->username . '/' . $token . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1531) /var/www/app/Http/Controllers/UploadController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . $user->username . '/tmp/' . '/' . $token . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1532) /var/www/app/Http/Controllers/UploadController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . '/' . $token . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1533) /var/www/app/Http/Controllers/UploadController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . '/' . $user->username . $token . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1534) /var/www/app/Http/Controllers/UploadController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . $token . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1535) /var/www/app/Http/Controllers/UploadController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . $token . '/' . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1536) /var/www/app/Http/Controllers/UploadController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . '/';
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1537) /var/www/app/Http/Controllers/UploadController.php:74    [M] Concat

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . '/' . $token;
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1538) /var/www/app/Http/Controllers/UploadController.php:74    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $user = Auth::user();
         $instance = \Instantiation::instance();
         $token = session()->token();
-        $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
+        $tmp = $instance . '/tmp/' . $user->username . '/' . $token;
         $path = $tmp . '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1539) /var/www/app/Http/Controllers/UploadController.php:75    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
-        $path = $tmp . '/' . $file_name;
+        $path = '/' . $tmp . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1540) /var/www/app/Http/Controllers/UploadController.php:75    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
-        $path = $tmp . '/' . $file_name;
+        $path = '/' . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1541) /var/www/app/Http/Controllers/UploadController.php:75    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
-        $path = $tmp . '/' . $file_name;
+        $path = $tmp . $file_name;
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1542) /var/www/app/Http/Controllers/UploadController.php:75    [M] Concat

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
-        $path = $tmp . '/' . $file_name;
+        $path = $tmp . $file_name . '/';
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1543) /var/www/app/Http/Controllers/UploadController.php:75    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         $instance = \Instantiation::instance();
         $token = session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
-        $path = $tmp . '/' . $file_name;
+        $path = $tmp . '/';
         Storage::delete($path);
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }

1544) /var/www/app/Http/Controllers/UploadController.php:77    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $token = session()->token();
         $tmp = $instance . '/tmp/' . $user->username . '/' . $token . '/';
         $path = $tmp . '/' . $file_name;
-        Storage::delete($path);
+        
         return Response::make('', 200, ['Content-Type' => 'text/plain']);
     }
 }
